pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0000.c
// bl602_demo_at_text_0000.c
// Generated by decompiling bl602_demo_at.elf
// using Reko decompiler version 0.9.3.0.

#include "bl602_demo_at.h"

// 23000300: void cmd_free_mem(Register Eq_2 ra, Register Eq_2 a3, Stack Eq_2 dwArg08, Stack Eq_2 dwArg28, Stack Eq_2 dwArg70, Stack Eq_2 dwArg98, Stack Eq_2 dwArgBC)
void cmd_free_mem(Eq_2 ra, Eq_2 a3, Eq_2 dwArg08, Eq_2 dwArg28, Eq_2 dwArg70, Eq_2 dwArg98, Eq_2 dwArgBC)
{
	xPortGetFreeHeapSize();
	word32 s1_43;
	word32 a0_44;
	word32 a1_45;
	word32 a2_46;
	word32 a3_47;
	word32 a4_48;
	word32 a5_49;
	word32 a7_50;
	word32 s2_51;
	word32 s3_52;
	word32 s4_53;
	word32 s5_54;
	word32 s6_55;
	word32 s7_56;
	word32 s8_57;
	word32 s9_58;
	word32 s10_59;
	word32 s11_60;
	word32 t4_61;
	printf(ra, &g_t230A993C, a3, dwArg08, dwArg28, dwArg70, ra, dwArg98, dwArgBC, out s1_43, out a0_44, out a1_45, out a2_46, out a3_47, out a4_48, out a5_49, out a7_50, out s2_51, out s3_52, out s4_53, out s5_54, out s6_55, out s7_56, out s8_57, out s9_58, out s10_59, out s11_60, out t4_61);
}

// 2300031A: void cmd_stack_ble(Register Eq_2 ra, Register word32 s0, Register Eq_2 s1, Register Eq_2 s2, Register (ptr32 Eq_326) s3, Register Eq_2 s6, Register Eq_2 s7, Register ptr32 fflags, Register ptr32 frm, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0158)
void cmd_stack_ble(Eq_2 ra, word32 s0, Eq_2 s1, Eq_2 s2, struct Eq_326 * s3, Eq_2 s6, Eq_2 s7, ptr32 fflags, ptr32 frm, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg6C, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0158)
{
	word32 a0_86;
	word32 a1_87;
	word32 mstatus_88;
	ble_stack_start(ra, s0, s1, s2, s3, s6, s7, fflags, frm, dwArg00, dwArg04, dwArg08, dwArg10, dwArg14, dwArg18, dwArg1C, dwArg20, dwArg24, dwArg28, dwArg34, dwArg38, dwArg3C, dwArg40, dwArg44, dwArg48, dwArg50, dwArg54, dwArg58, dwArg68, dwArg6C, dwArg78, dwArg88, dwArg8C, dwArg98, dwArg9C, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0138, dwArg0158, out a0_86, out a1_87, out mstatus_88);
}

// 2300031E: Register Eq_2 cmd_stack_wifi(Register Eq_2 ra, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg24, Stack Eq_2 dwArgC8, Stack Eq_2 dwArg0194, Register out ptr32 s0Out, Register out Eq_2 s1Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s6Out, Register out ptr32 s7Out)
// Called from:
//      aos_loop_proc
Eq_2 cmd_stack_wifi(Eq_2 ra, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg24, Eq_2 dwArgC8, Eq_2 dwArg0194, ptr32 & s0Out, union Eq_2 & s1Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s6Out, ptr32 & s7Out)
{
	if ((word32) g_b4200F259 != 0x01)
	{
		g_b4200F259 = 0x01;
		struct Eq_446 * a4_17;
		Eq_2 s1_23;
		ptr32 s2_24;
		ptr32 s3_25;
		ptr32 s6_28;
		ptr32 s7_29;
		Eq_2 ra_21 = hal_wifi_start_firmware_task(ra, mstatus, dwArg04, dwArgC8, dwArg0194, out s1_23, out a4_17, out s2_24, out s3_25, out s6_28, out s7_29);
		ptr32 s0_47;
		word32 a0_114;
		word32 a3_115;
		Eq_2 ra_46 = aos_post_event(ra_21, 0x02, a4_17, dwArg24, out s0_47, out a0_114, out a3_115);
		s0Out = s0_47;
		s1Out = s1_23;
		s2Out = s2_24;
		s3Out = s3_25;
		s6Out = s6_28;
		s7Out = s7_29;
		return ra_46;
	}
	else
	{
		word32 a0_107;
		word32 a1_108;
		word32 a2_109;
		word32 a4_110;
		word32 a5_111;
		word32 s4_112;
		word32 s8_113;
		Eq_2 s1_58 = puts(0x230A9950, out a0_107, out a1_108, out a2_109, out a4_110, out a5_111, out s4_112, out s8_113);
		s0Out = s0;
		s1Out = s1_58;
		s2Out = s2;
		s3Out = s3;
		s6Out = s6;
		s7Out = s7;
		return ra;
	}
}

// 23000356: void scan_complete_cb(Register word32 ra, Register ptr32 a0)
void scan_complete_cb(word32 ra, ptr32 a0)
{
	word32 s0_21;
	word32 s1_22;
	word32 a3_23;
	word32 a5_24;
	word32 s2_25;
	word32 s3_26;
	wifi_mgmr_scan_ap_all(ra, 0x00, a0, &g_t23000366, out s0_21, out s1_22, out a3_23, out a5_24, out s2_25, out s3_26);
}

// 23000366: void scan_item_cb(Register word32 ra, Register (ptr32 code) a1, Register Eq_2 a2)
void scan_item_cb(word32 ra, <anonymous> * a1, Eq_2 a2)
{
	word32 a3_109;
	word32 a2_108;
	word32 a1_107;
	word32 a4_110;
	word32 a5_111;
	word32 a6_112;
	word32 a7_113;
	memcpy(fp + -64, a2, 32, out a1_107, out a2_108, out a3_109, out a4_110, out a5_111, out a6_112, out a7_113);
	word32 a1_42;
	word32 a2_43;
	word32 a3_114;
	word32 a4_115;
	word32 a5_116;
	word32 a6_117;
	word32 a7_118;
	memcpy(fp + -28, (word32) a2 + 40, 0x06, out a1_42, out a2_43, out a3_114, out a4_115, out a5_116, out a6_117, out a7_118);
	if (a1 != null)
		a1();
}

// 230003AE: void wifiprov_wifi_state_get(Register Eq_2 ra, Register Eq_2 s2)
void wifiprov_wifi_state_get(Eq_2 ra, Eq_2 s2)
{
	word32 a0_326;
	word32 t1_325;
	word32 a1_327;
	word32 a2_328;
	word32 a3_329;
	word32 a4_330;
	word32 a5_331;
	word32 t1_332;
	word32 a0_333;
	word32 a1_334;
	word32 a2_335;
	word32 a3_336;
	word32 a4_337;
	word32 a5_338;
	Eq_2 ra_31 = memset(memset(ra, fp + -0x0118, 0x00, 88, out t1_325, out a0_326, out a1_327, out a2_328, out a3_329, out a4_330, out a5_331), fp + -0x00C0, 0x00, 0x00AE, out t1_332, out a0_333, out a1_334, out a2_335, out a3_336, out a4_337, out a5_338);
	struct Eq_665 * a4_38;
	word32 a5_339;
	wifi_mgmr_state_get(fp + -296, out a4_38, out a5_339);
	wifi_mgmr_sta_ip_get(fp + -292, fp + -288, fp + -0x011C, a4_38);
	word32 a3_340;
	word32 a4_341;
	Eq_2 ra_55 = wifi_mgmr_sta_connect_ind_stat_get(ra_31, fp + -0x00C0, s2, dwLoc0128, dwLoc0108, dwLocE0, dwLocDC, dwLocC0, dwLocBC, dwLocB8, dwLoc98, dwLoc94, dwLoc74, out a3_340, out a4_341);
	word32 a2_342;
	word32 a3_343;
	word32 a4_344;
	word32 a5_345;
	word32 a4_346;
	word32 a5_347;
	strcpy(fp + -0x0118, ip4addr_ntoa(out a2_342, out a3_343, out a4_344, out a5_345), out a4_346, out a5_347);
	word32 a2_348;
	word32 a3_349;
	word32 a4_350;
	word32 a5_351;
	word32 a4_352;
	word32 a5_353;
	strcpy(fp + -0x00F8, ip4addr_ntoa(out a2_348, out a3_349, out a4_350, out a5_351), out a4_352, out a5_353);
	word32 a2_354;
	word32 a3_355;
	word32 a4_356;
	word32 a5_357;
	word32 a4_358;
	word32 a5_359;
	strcpy(fp + -264, ip4addr_ntoa(out a2_354, out a3_355, out a4_356, out a5_357), out a4_358, out a5_359);
	word32 a1_360;
	word32 a2_361;
	word32 a3_362;
	word32 a4_363;
	word32 a5_364;
	word32 a6_365;
	word32 a7_366;
	memcpy(fp + -232, fp + -0x00BD, 32, out a1_360, out a2_361, out a3_362, out a4_363, out a5_364, out a6_365, out a7_366);
	Eq_2 a3_163;
	word32 a1_367;
	word32 a2_368;
	word32 a4_369;
	word32 a5_370;
	word32 a6_371;
	word32 a7_372;
	memcpy(fp + -199, fp + -28, 0x06, out a1_367, out a2_368, out a3_163, out a4_369, out a5_370, out a6_371, out a7_372);
	Eq_2 a3_180;
	Eq_2 a3_205;
	word32 s2_237;
	word32 s1_373;
	word32 a0_374;
	word32 a1_375;
	word32 a2_376;
	word32 a4_377;
	word32 a5_378;
	word32 a7_379;
	word32 s2_380;
	word32 s3_381;
	word32 s4_382;
	word32 s5_383;
	word32 s6_384;
	word32 s7_385;
	word32 s8_386;
	word32 s9_387;
	word32 s10_388;
	word32 s11_389;
	word32 t4_390;
	word32 s1_391;
	word32 a0_392;
	word32 a1_393;
	word32 a2_394;
	word32 a4_395;
	word32 a5_396;
	word32 a7_397;
	word32 s2_398;
	word32 s3_399;
	word32 s4_400;
	word32 s5_401;
	word32 s6_402;
	word32 s7_403;
	word32 s8_404;
	word32 s9_405;
	word32 s10_406;
	word32 s11_407;
	word32 t4_408;
	word32 s1_409;
	word32 a0_410;
	word32 a1_411;
	word32 a2_412;
	word32 a3_413;
	word32 a4_414;
	word32 a5_415;
	word32 a7_416;
	word32 s3_417;
	word32 s4_418;
	word32 s5_419;
	word32 s6_420;
	word32 s7_421;
	word32 s8_422;
	word32 s9_423;
	word32 s10_424;
	word32 s11_425;
	word32 t4_426;
	Eq_2 ra_233 = printf(printf(printf(ra_55, &g_t230A9EA8, a3_163, dwLoc0128, dwLoc0108, dwLocC0, dwLocBC, dwLoc98, dwLoc74, out s1_373, out a0_374, out a1_375, out a2_376, out a3_180, out a4_377, out a5_378, out a7_379, out s2_380, out s3_381, out s4_382, out s5_383, out s6_384, out s7_385, out s8_386, out s9_387, out s10_388, out s11_389, out t4_390), &g_t230A9EB4, a3_180, dwLoc0128, dwLoc0108, dwLocC0, dwLocBC, dwLoc98, dwLoc74, out s1_391, out a0_392, out a1_393, out a2_394, out a3_205, out a4_395, out a5_396, out a7_397, out s2_398, out s3_399, out s4_400, out s5_401, out s6_402, out s7_403, out s8_404, out s9_405, out s10_406, out s11_407, out t4_408), &g_t230A9EC0, a3_205, dwLoc0128, dwLoc0108, dwLocC0, dwLocBC, dwLoc98, dwLoc74, out s1_409, out a0_410, out a1_411, out a2_412, out a3_413, out a4_414, out a5_415, out a7_416, out s2_237, out s3_417, out s4_418, out s5_419, out s6_420, out s7_421, out s8_422, out s9_423, out s10_424, out s11_425, out t4_426);
	if (dwLoc4C != null)
		dwLoc4C();
}

// 23000472: void char_to_hex(Register word32 a0)
// Called from:
//      event_cb_wifi_event
void char_to_hex(word32 a0)
{
	if ((a0 + -48 & 0x00FF) > 0x09 && ((a0 + -97 & 0x00FF) <= 0x05 || (a0 + -65 & 0x00FF) <= 0x05))
		;
}

