pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0000.c
// 230004AE: void event_cb_wifi_event(Register Eq_2 ra, Register (ptr32 Eq_978) a0, Register Eq_2 a3, Register Eq_2 s4, Register Eq_2 s8, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38)
void event_cb_wifi_event(Eq_2 ra, struct Eq_978 * a0, Eq_2 a3, Eq_2 s4, Eq_2 s8, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg28, Eq_2 dwArg38)
{
	if ((word32) (word16) ((word32) a0->w0006 + -1) <= 0x12)
	{
		switch ((word32) (word16) (a0->w0006 + -1))
		{
		case 0x00:
			Eq_2 a1_740;
			Eq_2 a3_755;
			word32 t4_1061;
			word32 s9_1058;
			word32 s11_1060;
			word32 s10_1059;
			word32 s5_1054;
			word32 s7_1056;
			word32 s8_1057;
			word32 s6_1055;
			word32 a7_1050;
			word32 s3_1052;
			word32 s4_1053;
			word32 s2_1051;
			word32 a2_1047;
			word32 a5_1049;
			word32 a4_1048;
			word32 a5_1043;
			word32 a0_1045;
			word32 a1_1046;
			word32 s1_1044;
			word32 a2_1041;
			word32 a4_1042;
			word32 a0_1040;
			wifi_mgmr_start_background(printf(ra, &g_t230A999C, a1_740, dwLoc0138, dwLoc0118, dwLocD0, dwLocCC, dwLocA8, dwLoc84, out s1_1044, out a0_1045, out a1_1046, out a2_1047, out a3_755, out a4_1048, out a5_1049, out a7_1050, out s2_1051, out s3_1052, out s4_1053, out s5_1054, out s6_1055, out s7_1056, out s8_1057, out s9_1058, out s10_1059, out s11_1060, out t4_1061), aos_now_ms(a3, out a0_1040, out a1_740, out a2_1041, out a4_1042, out a5_1043), 0x4200EAEC, a3_755, mstatus, dwLoc0140, dwLoc013C, dwLoc0134, dwLoc0130, dwLoc012C, dwLoc0124, dwLoc0120, dwLoc011C, dwLoc0118, dwLoc0108, dwLocFC, dwLocF8, dwLocF4, dwLocE4, dwLocE0, dwLocDC, dwLocC8, dwLocB8, dwLocA8, dwLoc98, dwLoc88, dwLoc78, dwLoc68, dwLoc58, dwLoc48, dwLoc38, s8, s4, dwArg08);
			break;
		case 0x01:
			Eq_2 a1_72;
			Eq_2 s3_95;
			Eq_2 s3_123;
			word32 s4_1091;
			word32 s2_1090;
			word32 a5_1089;
			word32 a4_1088;
			word32 a3_1087;
			word32 a2_1086;
			word32 a0_1085;
			word32 s10_1081;
			word32 t4_1083;
			word32 s1_1084;
			word32 s11_1082;
			word32 s6_1077;
			word32 s8_1079;
			word32 s9_1080;
			word32 s7_1078;
			word32 a7_1073;
			word32 s4_1075;
			word32 s5_1076;
			word32 s2_1074;
			word32 a3_1070;
			word32 a5_1072;
			word32 a4_1071;
			word32 a0_1067;
			word32 a2_1069;
			word32 a1_1068;
			word32 a4_1064;
			word32 s1_1066;
			word32 a5_1065;
			word32 a2_1063;
			word32 a0_1062;
			Eq_2 ra_118 = at_key_value_get(printf(ra, &g_t230A99BC, a1_72, dwLoc0138, dwLoc0118, dwLocD0, dwLocCC, dwLocA8, dwLoc84, out s1_1066, out a0_1067, out a1_1068, out a2_1069, out a3_1070, out a4_1071, out a5_1072, out a7_1073, out s2_1074, out s3_95, out s4_1075, out s5_1076, out s6_1077, out s7_1078, out s8_1079, out s9_1080, out s10_1081, out s11_1082, out t4_1083), aos_now_ms(a3, out a0_1062, out a1_72, out a2_1063, out a4_1064, out a5_1065), 587897308, fp + -0x0118, s3_95, mstatus, dwLoc0138, dwLoc0108, dwLocF0, dwLocEC, dwLocD8, dwLocC8, dwLocA4, dwLoc98, dwLoc58, out s1_1084, out a0_1085, out a2_1086, out a3_1087, out a4_1088, out a5_1089, out s2_1090, out s3_123, out s4_1091);
			if (s3_123 == 0x01)
			{
				Eq_2 a3_146;
				word32 a5_148;
				Eq_2 s1_152;
				Eq_2 s2_155;
				word32 s4_1096;
				word32 s3_1095;
				word32 a4_1094;
				word32 a2_1093;
				word32 a0_1092;
				Eq_2 ra_151 = at_key_value_get(ra_118, dwArg38, 587897320, fp + -0x0114, s3_123, mstatus, dwLoc0138, dwLoc0108, dwLocF0, dwLocEC, dwLocD8, dwLocC8, dwLocA4, dwLoc98, dwLoc58, out s1_152, out a0_1092, out a2_1093, out a3_146, out a4_1094, out a5_148, out s2_155, out s3_1095, out s4_1096);
				if (a5_148 != 0x00)
				{
					word32 a0_172;
					ptr32 mstatus_180;
					Eq_2 s3_187;
					word32 a1_1097;
					word32 s2_1098;
					Eq_2 ra_181 = wifi_mgmr_sta_enable(ra_151, s1_152, a3_146, s2_155, mstatus, dwLoc013C, dwLoc0138, dwLoc0108, dwLocF8, dwLocF0, dwLocEC, dwLocCC, dwLocC8, dwLocB8, dwLocB0, 0x00, dwLocA4, dwLoc98, dwLoc88, dwLoc78, dwLoc58, dwLoc48, dwLoc38, dwArg28, out a0_172, out a1_1097, out s2_1098, out s3_187, out mstatus_180);
					g_dw4200F25C = a0_172;
					Eq_2 s3_295;
					word32 t1_1099;
					word32 a0_1100;
					word32 a1_1101;
					word32 a2_1102;
					word32 a3_1103;
					word32 a4_1104;
					word32 a5_1105;
					word32 t1_1106;
					word32 a0_1107;
					word32 a1_1108;
					word32 a2_1109;
					word32 a3_1110;
					word32 a4_1111;
					word32 a5_1112;
					word32 t1_1113;
					word32 a0_1114;
					word32 a1_1115;
					word32 a2_1116;
					word32 a3_1117;
					word32 a4_1118;
					word32 a5_1119;
					word32 t1_1120;
					word32 a0_1121;
					word32 a1_1122;
					word32 a2_1123;
					word32 a3_1124;
					word32 a4_1125;
					word32 a5_1126;
					word32 t1_1127;
					word32 a0_1128;
					word32 a1_1129;
					word32 a2_1130;
					word32 a3_1131;
					word32 a4_1132;
					word32 a5_1133;
					word32 t1_1134;
					word32 a0_1135;
					word32 a1_1136;
					word32 a2_1137;
					word32 a3_1138;
					word32 a4_1139;
					word32 a5_1140;
					word32 s0_1141;
					word32 s1_1142;
					word32 a0_1143;
					word32 s2_1144;
					word32 s4_1145;
					word32 s5_1146;
					word32 s9_1147;
					word32 s10_1148;
					word32 s11_1149;
					Eq_2 ra_289 = ef_get_env_blob(memset(memset(memset(memset(memset(memset(ra_181, fp + -220, 0x00, 33, out t1_1099, out a0_1100, out a1_1101, out a2_1102, out a3_1103, out a4_1104, out a5_1105), fp + -0x00B8, 0x00, 66, out t1_1106, out a0_1107, out a1_1108, out a2_1109, out a3_1110, out a4_1111, out a5_1112), fp + -252, 0x00, 32, out t1_1113, out a0_1114, out a1_1115, out a2_1116, out a3_1117, out a4_1118, out a5_1119), fp + -272, 0x00, 0x06, out t1_1120, out a0_1121, out a1_1122, out a2_1123, out a3_1124, out a4_1125, out a5_1126), fp + -264, 0x00, 0x0A, out t1_1127, out a0_1128, out a1_1129, out a2_1130, out a3_1131, out a4_1132, out a5_1133), fp + -116, 0x00, 66, out t1_1134, out a0_1135, out a1_1136, out a2_1137, out a3_1138, out a4_1139, out a5_1140), 587897332, fp + -116, 0x00, s3_187, mstatus_180, dwLoc0138, 0x00, dwLocE8, dwLocB8, dwLoc78, dwLoc38, out s0_1141, out s1_1142, out a0_1143, out s2_1144, out s3_295, out s4_1145, out s5_1146, out s9_1147, out s10_1148, out s11_1149);
					if ((word32) bLoc74 != 0x00)
					{
						word32 a2_1192;
						word32 a3_1193;
						word32 a4_1194;
						word32 a5_1195;
						strncpy(fp + -220, fp + -116, 32, out a2_1192, out a3_1193, out a4_1194, out a5_1195);
						Eq_2 s3_426;
						word32 t1_1196;
						word32 a0_1197;
						word32 a1_1198;
						word32 a2_1199;
						word32 a3_1200;
						word32 a4_1201;
						word32 a5_1202;
						word32 s0_1203;
						word32 s1_1204;
						word32 a0_1205;
						word32 s2_1206;
						word32 s4_1207;
						word32 s5_1208;
						word32 s9_1209;
						word32 s10_1210;
						word32 s11_1211;
						Eq_2 ra_420 = ef_get_env_blob(memset(ra_289, fp + -116, 0x00, 66, out t1_1196, out a0_1197, out a1_1198, out a2_1199, out a3_1200, out a4_1201, out a5_1202), 0x230A9A00, fp + -116, 0x00, s3_295, mstatus_180, dwLoc0138, 0x00, dwLocE8, dwLocB8, dwLoc78, dwLoc38, out s0_1203, out s1_1204, out a0_1205, out s2_1206, out s3_426, out s4_1207, out s5_1208, out s9_1209, out s10_1210, out s11_1211);
						if ((word32) bLoc74 != 0x00)
						{
							word32 a2_1236;
							word32 a3_1237;
							word32 a4_1238;
							word32 a5_1239;
							strncpy(fp + -0x00B8, fp + -116, 65, out a2_1236, out a3_1237, out a4_1238, out a5_1239);
						}
						word32 t1_1212;
						word32 a0_1213;
						word32 a1_1214;
						word32 a2_1215;
						word32 a3_1216;
						word32 a4_1217;
						word32 a5_1218;
						word32 t1_1219;
						word32 a0_1220;
						word32 a1_1221;
						word32 a2_1222;
						word32 a3_1223;
						word32 a4_1224;
						word32 a5_1225;
						word32 s0_1226;
						word32 s1_1227;
						word32 a0_1228;
						word32 s2_1229;
						word32 s3_1230;
						word32 s4_1231;
						word32 s5_1232;
						word32 s9_1233;
						word32 s10_1234;
						word32 s11_1235;
						Eq_2 ra_495 = ef_get_env_blob(memset(memset(ra_420, fp + -116, 0x00, 66, out t1_1212, out a0_1213, out a1_1214, out a2_1215, out a3_1216, out a4_1217, out a5_1218), fp + -116, 0x00, 66, out t1_1219, out a0_1220, out a1_1221, out a2_1222, out a3_1223, out a4_1224, out a5_1225), 587897620, fp + -116, 0x00, s3_426, mstatus_180, dwLoc0138, 0x00, dwLocE8, dwLocB8, dwLoc78, dwLoc38, out s0_1226, out s1_1227, out a0_1228, out s2_1229, out s3_1230, out s4_1231, out s5_1232, out s9_1233, out s10_1234, out s11_1235);
						if ((word32) bLoc74 == 0x00)
						{
l2300066C:
							goto l23000670;
						}
						Eq_2 a3_522;
						word32 a2_1240;
						word32 a4_1241;
						word32 a5_1242;
						strncpy(fp + -264, fp + -116, 0x09, out a2_1240, out a3_522, out a4_1241, out a5_1242);
						word32 s1_1243;
						word32 a0_1244;
						word32 a1_1245;
						word32 a2_1246;
						word32 a3_1247;
						word32 a4_1248;
						word32 a5_1249;
						word32 a7_1250;
						word32 s2_1251;
						word32 s3_1252;
						word32 s4_1253;
						word32 s5_1254;
						word32 s6_1255;
						word32 s7_1256;
						word32 s8_1257;
						word32 s9_1258;
						word32 s10_1259;
						word32 s11_1260;
						word32 t4_1261;
						ra_495 = printf(ra_495, &g_t230A9B24, a3_522, dwLoc0138, dwLoc0118, dwLocD0, dwLocCC, dwLocA8, dwLoc84, out s1_1243, out a0_1244, out a1_1245, out a2_1246, out a3_1247, out a4_1248, out a5_1249, out a7_1250, out s2_1251, out s3_1252, out s4_1253, out s5_1254, out s6_1255, out s7_1256, out s8_1257, out s9_1258, out s10_1259, out s11_1260, out t4_1261);
						word32 a1_1262;
						word32 a2_1263;
						word32 a3_1264;
						word32 a4_1265;
						word32 a5_1266;
						Eq_2 a0_559 = strchr(fp + -264, 0x007C, out a1_1262, out a2_1263, out a3_1264, out a4_1265, out a5_1266);
						if (a0_559 == 0x01)
							goto l2300066C;
						char_to_hex((word32) *((word32) a0_559 + 1));
						word32 a1_1267;
						word32 a2_1268;
						word32 a3_1269;
						word32 a4_1270;
						word32 a5_1271;
						word32 a1_1272;
						word32 a2_1273;
						word32 a3_1274;
						word32 a4_1275;
						word32 a5_1276;
						word32 s0_588 = strlen(fp + -264, out a1_1267, out a2_1268, out a3_1269, out a4_1270, out a5_1271) - strlen((word32) a0_559 + 1, out a1_1272, out a2_1273, out a3_1274, out a4_1275, out a5_1276);
						(fp + -48 + (s0_588 + -1))->b0F28 = 0x00;
						int32 s5_566 = 0x00;
						struct Eq_1939 * s0_594 = s0_588 + (fp + -264);
						while (true)
						{
							s0_594 = (struct Eq_1939 *) &s0_594->bFFFFFFFF;
							if (s5_566 >= s0_588 + -1)
								break;
							char_to_hex((word32) s0_594->bFFFFFFFF);
							++s5_566;
						}
l23000670:
						Eq_2 a3_629;
						word32 t1_1277;
						word32 a0_1278;
						word32 a1_1279;
						word32 a2_1280;
						word32 a4_1281;
						word32 a5_1282;
						Eq_2 ra_632 = memset(ra_495, fp + -116, 0x00, 66, out t1_1277, out a0_1278, out a1_1279, out a2_1280, out a3_629, out a4_1281, out a5_1282);
						word32 a0_1283;
						word32 a1_1284;
						word32 a2_1285;
						word32 a4_1286;
						word32 a5_1287;
						aos_now_ms(a3_629, out a0_1283, out a1_1284, out a2_1285, out a4_1286, out a5_1287);
						word32 a1_1288;
						word32 a2_1289;
						word32 a3_1290;
						word32 a4_1291;
						word32 a5_1292;
						Eq_2 a0_645 = strlen(fp + -220, out a1_1288, out a2_1289, out a3_1290, out a4_1291, out a5_1292);
						Eq_2 a3_654;
						word32 a1_1293;
						word32 a2_1294;
						word32 a4_1295;
						word32 a5_1296;
						strlen(fp + -0x00B8, out a1_1293, out a2_1294, out a3_654, out a4_1295, out a5_1296);
						Eq_2 s2_688;
						word32 s1_1297;
						word32 a0_1298;
						word32 a1_1299;
						word32 a2_1300;
						word32 a3_1301;
						word32 a4_1302;
						word32 a5_1303;
						word32 a7_1304;
						word32 s3_1305;
						word32 s4_1306;
						word32 s5_1307;
						word32 s6_1308;
						word32 s7_1309;
						word32 s8_1310;
						word32 s9_1311;
						word32 s10_1312;
						word32 s11_1313;
						word32 t4_1314;
						word32 s0_1315;
						word32 s3_1316;
						word32 mstatus_1317;
						wifi_mgmr_sta_connect(printf(ra_632, &g_t230A9B40, a3_654, a0_645, dwLoc0118, dwLocD0, dwLocCC, dwLocA8, dwLoc84, out s1_1297, out a0_1298, out a1_1299, out a2_1300, out a3_1301, out a4_1302, out a5_1303, out a7_1304, out s2_688, out s3_1305, out s4_1306, out s5_1307, out s6_1308, out s7_1309, out s8_1310, out s9_1311, out s10_1312, out s11_1313, out t4_1314), fp + -220, fp + -0x00B8, 0x00, s2_688, mstatus_180, dwLoc0128, dwLoc0108, dwLocE8, dwLocC8, dwLocBC, dwLoc7C, out s0_1315, out s3_1316, out mstatus_1317);
					}
					else
					{
						word32 a0_1150;
						word32 a1_1151;
						word32 a2_1152;
						word32 a4_1153;
						word32 a5_1154;
						word32 s4_1155;
						word32 s8_1156;
						puts(0x230A9A0C, out a0_1150, out a1_1151, out a2_1152, out a4_1153, out a5_1154, out s4_1155, out s8_1156);
						word32 a0_1157;
						word32 a1_1158;
						word32 a2_1159;
						word32 a4_1160;
						word32 a5_1161;
						word32 s4_1162;
						word32 s8_1163;
						puts(587897380, out a0_1157, out a1_1158, out a2_1159, out a4_1160, out a5_1161, out s4_1162, out s8_1163);
						word32 a0_1164;
						word32 a1_1165;
						word32 a2_1166;
						word32 a4_1167;
						word32 a5_1168;
						word32 s4_1169;
						word32 s8_1170;
						puts(0x230A9A70, out a0_1164, out a1_1165, out a2_1166, out a4_1167, out a5_1168, out s4_1169, out s8_1170);
						word32 a0_1171;
						word32 a1_1172;
						word32 a2_1173;
						word32 a4_1174;
						word32 a5_1175;
						word32 s4_1176;
						word32 s8_1177;
						puts(587897524, out a0_1171, out a1_1172, out a2_1173, out a4_1174, out a5_1175, out s4_1176, out s8_1177);
						word32 a0_1178;
						word32 a1_1179;
						word32 a2_1180;
						word32 a4_1181;
						word32 a5_1182;
						word32 s4_1183;
						word32 s8_1184;
						puts(587897552, out a0_1178, out a1_1179, out a2_1180, out a4_1181, out a5_1182, out s4_1183, out s8_1184);
						word32 a0_1185;
						word32 a1_1186;
						word32 a2_1187;
						word32 a4_1188;
						word32 a5_1189;
						word32 s4_1190;
						word32 s8_1191;
						puts(587897580, out a0_1185, out a1_1186, out a2_1187, out a4_1188, out a5_1189, out s4_1190, out s8_1191);
					}
				}
			}
			break;
		}
	}
	else
	{
		Eq_2 a1_32;
		word32 a4_1019;
		word32 a5_1020;
		word32 a0_1017;
		word32 a2_1018;
		aos_now_ms(a3, out a0_1017, out a1_32, out a2_1018, out a4_1019, out a5_1020);
		word32 t4_1039;
		word32 s7_1034;
		word32 s8_1035;
		word32 s10_1037;
		word32 s11_1038;
		word32 s9_1036;
		word32 s2_1029;
		word32 s3_1030;
		word32 s5_1032;
		word32 s6_1033;
		word32 s4_1031;
		word32 a2_1024;
		word32 a3_1025;
		word32 a5_1027;
		word32 a7_1028;
		word32 a4_1026;
		word32 a0_1022;
		word32 a1_1023;
		word32 s1_1021;
		printf(ra, &g_t230A9DAC, a1_32, dwLoc0138, dwLoc0118, dwLocD0, dwLocCC, dwLocA8, dwLoc84, out s1_1021, out a0_1022, out a1_1023, out a2_1024, out a3_1025, out a4_1026, out a5_1027, out a7_1028, out s2_1029, out s3_1030, out s4_1031, out s5_1032, out s6_1033, out s7_1034, out s8_1035, out s9_1036, out s10_1037, out s11_1038, out t4_1039);
	}
}

