pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0000.c
// 230009AA: void event_cb_cli(Register Eq_2 ra, Register Eq_2 s1, Register (ptr32 Eq_2092) a0, Register Eq_2 a3, Register Eq_2 s5, Register word32 s6, Register (ptr32 Eq_2096) s11, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg68, Stack Eq_2 dwArg70, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgBC, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0168)
void event_cb_cli(Eq_2 ra, Eq_2 s1, struct Eq_2092 * a0, Eq_2 a3, Eq_2 s5, word32 s6, struct Eq_2096 * s11, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg0C, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg68, Eq_2 dwArg70, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgBC, Eq_2 dwArgC8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0148, Eq_2 dwArg0158, Eq_2 dwArg0168)
{
	word32 a5_5 = (word32) a0->w0006;
	if (a5_5 == 0x01)
	{
		g_b4200F258 = (byte) (word32) (a5_5 != 0x00);
		blsync_ble_start(ra, s1, a3, s5, s6, s11, mstatus, dwArg08, dwArg0C, dwArg10, dwArg14, dwArg18, dwArg20, dwArg24, dwArg28, dwArg30, dwArg34, dwArg38, dwArg40, dwArg44, dwArg48, dwArg68, dwArg70, dwArg78, dwArg7C, dwArg88, dwArg8C, dwArg98, dwArgA8, dwArgB8, dwArgBC, dwArgC8, dwArgF8, dwArg0118, dwArg0128, dwArg0158, dwArg0168);
	}
	else
	{
		if (a5_5 != 0x02)
			return;
		Eq_2 a3_53 = blsync_ble_stop(ra, mstatus, dwArg10, dwArg14, dwArg0108, dwArg0148);
		word32 s1_173;
		word32 a0_174;
		word32 a1_175;
		word32 a2_176;
		word32 a3_177;
		word32 a4_178;
		word32 a5_179;
		word32 a7_180;
		word32 s2_181;
		word32 s3_182;
		word32 s4_183;
		word32 s5_184;
		word32 s6_185;
		word32 s7_186;
		word32 s8_187;
		word32 s9_188;
		word32 s10_189;
		word32 s11_190;
		word32 t4_191;
		printf(ra, &g_t230A9974, a3_53, dwArg08, dwArg28, dwArg70, ra, dwArg98, dwArgBC, out s1_173, out a0_174, out a1_175, out a2_176, out a3_177, out a4_178, out a5_179, out a7_180, out s2_181, out s3_182, out s4_183, out s5_184, out s6_185, out s7_186, out s8_187, out s9_188, out s10_189, out s11_190, out t4_191);
	}
}

// 230009E6: Register Eq_2 get_dts_addr.part.2(Register Eq_2 ra, Stack Eq_2 dwArg18, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg88, Stack Eq_2 dwArgAC, Register out ptr32 a0Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s6Out, Register out ptr32 s9Out, Register out ptr32 s10Out)
// Called from:
//      aos_loop_proc
Eq_2 get_dts_addr.part.2(Eq_2 ra, Eq_2 dwArg18, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg88, Eq_2 dwArgAC, ptr32 & a0Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & a5Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s6Out, ptr32 & s9Out, ptr32 & s10Out)
{
	if (g_t4200F560 != 0x00)
	{
		word32 a5_85;
		xTaskGetTickCountFromISR(out a5_85);
	}
	else
	{
		word32 a5_84;
		xTaskGetTickCount(out a5_84);
	}
	ptr32 a5_31;
	ptr32 a3_36;
	ptr32 a4_37;
	ptr32 s10_41;
	ptr32 s2_43;
	ptr32 s3_44;
	ptr32 s4_45;
	ptr32 s6_47;
	ptr32 s9_50;
	word32 s1_86;
	word32 a0_87;
	word32 a1_88;
	word32 a2_89;
	word32 s5_90;
	word32 s7_91;
	word32 s8_92;
	word32 s11_93;
	Eq_2 ra_39 = bl_printk(ra, &g_t230A9DE8, 0x230A9DD0, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_86, out a0_87, out a1_88, out a2_89, out a3_36, out a4_37, out a5_31, out s2_43, out s3_44, out s4_45, out s5_90, out s6_47, out s7_91, out s8_92, out s9_50, out s10_41, out s11_93);
	a0Out = ~0x00;
	a3Out = a3_36;
	a4Out = a4_37;
	a5Out = a5_31;
	s2Out = s2_43;
	s3Out = s3_44;
	s4Out = s4_45;
	s6Out = s6_47;
	s9Out = s9_50;
	s10Out = s10_41;
	return ra_39;
}

// 23000A30: void aos_loop_proc(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a6, Register Eq_2 s2, Register Eq_2 s3, Register ptr32 fflags, Register ptr32 frm, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg60, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg84, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack word32 dwArgBC, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0114, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Stack word32 dwArg0154, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0168, Stack Eq_2 dwArg0174, Stack Eq_2 dwArg0178)
void aos_loop_proc(Eq_2 ra, Eq_2 s1, Eq_2 a6, Eq_2 s2, Eq_2 s3, ptr32 fflags, ptr32 frm, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg2C, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg4C, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg5C, Eq_2 dwArg60, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg84, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgA8, Eq_2 dwArgB8, word32 dwArgBC, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0114, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148, word32 dwArg0154, Eq_2 dwArg0158, Eq_2 dwArg0168, Eq_2 dwArg0174, Eq_2 dwArg0178)
{
	Eq_2 s9_173;
	Eq_2 s2_177;
	Eq_2 a3_24;
	Eq_2 s0_30;
	Eq_2 s1_31;
	Eq_2 s2_34;
	Eq_2 s3_35;
	Eq_2 a5_51;
	Eq_2 a4_83;
	Eq_2 a5_84;
	Eq_2 a3_88;
	Eq_2 s6_119;
	Eq_2 s10_164;
	Eq_2 ra_114 = vfs_device_init(vfs_init(easyflash_init(looprt_start(ra, s1, 0x42010F98, a6, mstatus, dwLoc1C, dwLoc08, dwArg20, dwArg24, ra, dwArgA8, dwArgE8, dwArg0128, dwArg0174, out s0_30, out s1_31, out a3_24, out s2_34, out s3_35), s0_30, s1_31, a3_24, loopset_led_hook_on_looprt(out a5_51), a5_51, s2_34, s3_35, mstatus, s2, dwLoc08, dwArg00, dwArg04, dwArg18, dwArg1C, dwArg20, dwArg24, dwArg28, dwArg30, dwArg34, dwArg38, dwArg44, dwArg58, s1, ra, dwArg78, dwArg7C, dwArg98, dwArgB8, dwArgD8, dwArgE8, dwArg0118, out s10_164), mstatus, dwLoc1C, s3, dwArgD8, dwArgE8, dwArg0118, dwArg0158, out a3_88, out a4_83, out a5_84), a3_88, a4_83, a5_84, mstatus, dwArg44, dwArg84, dwArgB8, dwArgF8, dwArg0138, out s6_119);
	Eq_2 a0_127 = hal_board_get_factory_addr();
	Eq_2 a0_133;
	word32 s0_1063;
	word32 a5_1064;
	word32 s3_1066;
	word32 s5_1067;
	word32 s2_1065;
	Eq_2 s1_143;
	Eq_2 s4_146;
	Eq_2 s6_148;
	Eq_2 ra_141 = fdt_subnode_offset(ra_114, a0_127, a0_127, 0x230C1CB4, 0x230C2000, s6_119, s2, dwArg18, dwArgC8, out s0_1063, out s1_143, out a0_133, out a5_1064, out s2_1065, out s3_1066, out s4_146, out s5_1067, out s6_148);
	if (a0_133 == 0x00)
	{
		word32 a0_155;
		word32 a3_1068;
		word32 a4_1069;
		word32 s2_1071;
		word32 s3_1072;
		word32 a5_1070;
		ra_141 = get_dts_addr.part.2(ra_141, dwLoc08, dwArg40, dwArg44, s1, dwArg8C, out a0_155, out a3_1068, out a4_1069, out a5_1070, out s2_1071, out s3_1072, out s4_146, out s6_148, out s9_173, out s10_164);
		s2_177.u0 = 0x00;
		if (a0_155 != 0x00)
		{
l23000A94:
			Eq_2 a3_256;
			Eq_2 a4_257;
			Eq_2 a5_258;
			Eq_2 s3_265;
			Eq_2 a0_220 = hal_board_get_factory_addr();
			word32 a0_231;
			word32 s6_1077;
			word32 s4_1075;
			word32 s5_1076;
			word32 s3_1074;
			word32 a5_1073;
			Eq_2 s1_241;
			Eq_2 s2_242;
			Eq_2 s0_240;
			Eq_2 ra_239 = fdt_subnode_offset(ra_141, a0_220, a0_220, 587997776, s2_177, s6_148, s2, dwArg18, dwArgC8, out s0_240, out s1_241, out a0_231, out a5_1073, out s2_242, out s3_1074, out s4_1075, out s5_1076, out s6_1077);
			if (a0_231 == 0x00)
			{
				word32 a0_253;
				word32 s4_1078;
				word32 s6_1079;
				ra_239 = get_dts_addr.part.2(ra_239, dwLoc08, dwArg40, dwArg44, s1, dwArg8C, out a0_253, out a3_256, out a4_257, out a5_258, out s2_242, out s3_265, out s4_1078, out s6_1079, out s9_173, out s10_164);
				if (a0_253 != 0x00)
				{
l23000ABE:
					Eq_2 s2_338;
					ptr32 mstatus_362;
					Eq_2 s2_368;
					Eq_2 a0_387;
					ptr32 mstatus_411;
					word32 s2_1083;
					word32 s3_1084;
					word32 s6_1085;
					word32 a2_1082;
					word32 s1_1081;
					word32 s0_1080;
					Eq_2 a5_397;
					Eq_2 a4_396;
					Eq_2 a3_395;
					Eq_2 ra_412 = aos_open(aos_loop_init(romfs_register(ra_239, s0_240, a3_256, a4_257, a5_258, s2_242, s3_265, mstatus, dwLoc20, dwLoc10, dwLoc0C, dwArg08, dwArg18, dwArg1C, dwArg20, dwArg24, dwArg2C, dwArg3C, dwArg48, s3, ra, dwArg78, dwArg98, dwArgB8, dwArgBC, dwArgD8, dwArgF8, dwArg0108, dwArg0118, out s2_338), s2_338, mstatus, s2, dwLoc10, dwLoc0C, dwArg00, dwArg04, dwArg18, dwArg30, dwArg34, dwArg38, dwArg3C, dwArg58, dwArg7C, dwArgA8, dwArgB8, dwArgD8, dwArgE8, dwArgF8, dwArg0118, dwArg0128, dwArg0138, out s2_368, out mstatus_362), 587896572, s2_368, mstatus_362, dwLoc1C, s3, s1, dwArgD8, dwArg0118, dwArg0158, out s0_1080, out s1_1081, out a0_387, out a2_1082, out a3_395, out a4_396, out a5_397, out s2_1083, out s3_1084, out s6_1085, out mstatus_411);
					if (a0_387 >= 0x00)
					{
						Eq_2 a5_417;
						Eq_2 a3_421;
						Eq_2 a4_422;
						Eq_2 s1_425;
						Eq_2 s6_432;
						Eq_2 s3_448;
						word32 s2_1127;
						word32 a1_1126;
						word32 s10_1122;
						word32 s11_1123;
						word32 s0_1125;
						word32 t4_1124;
						word32 s9_1121;
						word32 s5_1118;
						word32 s7_1119;
						word32 s8_1120;
						word32 s4_1117;
						word32 s3_1116;
						word32 s2_1115;
						word32 a7_1114;
						word32 a2_1113;
						word32 a1_1112;
						word32 a0_1111;
						ra_412 = aos_poll_read_fd(aos_cli_init(printf(ra_412, &g_t230A9708, a3_395, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_425, out a0_1111, out a1_1112, out a2_1113, out a3_421, out a4_422, out a5_417, out a7_1114, out s2_1115, out s3_1116, out s4_1117, out s5_1118, out s6_432, out s7_1119, out s8_1120, out s9_1121, out s10_1122, out s11_1123, out t4_1124), s1_425, a3_421, a4_422, a5_417, mstatus_411, dwArg10, dwArg14, dwArg5C, dwArg0108, dwArg0148, out s3_448), a0_387, aos_cli_event_cb_read_get(), 305419896, s3_448, s6_432, mstatus_411, dwLoc10, dwLoc0C, dwArg20, dwArg24, dwArg48, ra, dwArgE8, dwArg0108, dwArg0128, dwArg0148, out s0_1125, out a1_1126, out a3_395, out a4_396, out a5_397, out s2_1127);
						codex_debug_cli_init();
						easyflash_cli_init();
						network_netutils_iperf_cli_register();
						sntp_cli_init();
						bl_sys_time_cli_init();
						bl_sys_ota_cli_init();
						blfdt_cli_init();
						wifi_mgmr_cli_init();
						bl_wdt_cli_init();
						bl_gpio_cli_init();
						looprt_test_cli_init();
					}
					Eq_2 a3_514;
					Eq_2 a4_515;
					Eq_2 a5_516;
					word32 s2_1086;
					word32 s3_1087;
					aos_register_event_filter(ra_412, 0x230004AE, 0x00, a3_395, a4_396, a5_397, mstatus_411, dwArg10, dwArg14, dwArg18, dwArg5C, dwArg0108, dwArg0148, out a3_514, out a4_515, out a5_516, out s2_1086, out s3_1087);
					Eq_2 s2_537;
					ptr32 mstatus_551;
					word32 a5_1090;
					word32 s3_1091;
					word32 a4_1089;
					word32 a3_1088;
					Eq_2 ra_552 = at_server_init(ra_412, aos_register_event_filter(ra_412, 0x230009AA, 0x00, a3_514, a4_515, a5_516, mstatus_411, dwArg10, dwArg14, dwArg18, dwArg5C, dwArg0108, dwArg0148, out a3_1088, out a4_1089, out a5_1090, out s2_537, out s3_1091), s2_537, mstatus_411, dwLoc20, dwLoc1C, s2, dwLoc08, dwArg08, dwArg10, dwArg14, dwArg20, dwArg24, dwArg28, dwArg30, dwArg34, dwArg38, dwArg54, dwArg58, dwArg5C, s1, ra, dwArg78, dwArg7C, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0138, dwArg0148, dwArg0158, out mstatus_551);
					usr_at_cmd_register();
					word32 s0_589;
					Eq_2 s1_590;
					Eq_2 s2_591;
					struct Eq_326 * s3_592;
					Eq_2 s6_595;
					Eq_2 s7_596;
					Eq_2 a0_614;
					Eq_2 a1_615;
					ptr32 mstatus_628;
					ptr32 mstatus_665;
					Eq_2 a3_652 = aos_loop_run(ble_stack_start(cmd_stack_wifi(ra_552, mstatus_551, dwLoc1C, dwArg04, dwArgA8, dwArg0174, out s0_589, out s1_590, out s2_591, out s3_592, out s6_595, out s7_596), s0_589, s1_590, s2_591, s3_592, s6_595, s7_596, fflags, frm, dwLoc20, dwLoc1C, s2, dwLoc10, dwLoc0C, dwLoc08, dwLoc04, dwArg00, dwArg04, dwArg08, dwArg14, dwArg18, dwArg1C, dwArg20, dwArg24, dwArg28, dwArg30, dwArg34, dwArg38, dwArg48, dwArg4C, dwArg58, s1, ra, dwArg78, dwArg7C, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0138, out a0_614, out a1_615, out mstatus_628), a0_614, a1_615, mstatus_628, s2, dwArg08, dwArg50, dwArg54, s1, dwArg78, dwArg88, dwArg9C, dwArgA8, dwArgD8, dwArg0118, dwArg0158, out mstatus_665);
					word32 s8_1098;
					word32 s4_1097;
					word32 a5_1096;
					word32 a4_1095;
					word32 a1_1093;
					word32 a2_1094;
					word32 a0_1092;
					puts(588001708, out a0_1092, out a1_1093, out a2_1094, out a4_1095, out a5_1096, out s4_1097, out s8_1098);
					word32 s8_1105;
					word32 s4_1104;
					word32 a5_1103;
					word32 a4_1102;
					word32 a2_1101;
					word32 a1_1100;
					word32 a0_1099;
					puts(587896616, out a0_1099, out a1_1100, out a2_1101, out a4_1102, out a5_1103, out s4_1104, out s8_1105);
					Eq_2 a5_704;
					Eq_2 a4_707;
					word32 a2_1108;
					word32 s4_1109;
					word32 s8_1110;
					word32 a1_1107;
					word32 a0_1106;
					puts(587896664, out a0_1106, out a1_1107, out a2_1108, out a4_707, out a5_704, out s4_1109, out s8_1110);
					word32 s2_1132;
					word32 a5_1131;
					word32 a4_1130;
					word32 a3_1129;
					word32 a0_1128;
					vTaskDelete(0x00, dwArg48, a3_652, a4_707, a5_704, mstatus_665, dwArg0128, dwArg0138, dwArg0168, dwArg0178, out a0_1128, out a3_1129, out a4_1130, out a5_1131, out s2_1132);
					return;
				}
				s1_241 = s0_240;
			}
			ra_239 = hal_gpio_init_from_dts(ra_239, s1_241, s2_242, s9_173, s10_164, mstatus, dwLoc20, dwLoc1C, dwLoc0C, dwLoc04, dwArg2C, dwArg38, dwArg44, dwArg48, dwArg60, s3, s1, dwArg78, dwArg88, dwArgB8, dwArg0154, out s0_240, out a3_256, out a4_257, out a5_258, out s2_242, out s3_265);
			goto l23000ABE;
		}
		s1_143.u0 = 0x00;
	}
	ra_141 = vfs_uart_init(ra_141, s1_143, s1_143, a0_133, a0_133, s4_146, s6_148, s10_164, mstatus, dwArg08, dwArg28, dwArg38, dwArg48, dwArg78, dwArg88, dwArgF8, dwArg0114, out s2_177, out s6_148, out s9_173, out s10_164);
	goto l23000A94;
}

// 23000B9A: void vApplicationStackOverflowHook()
// Called from:
//      vTaskSwitchContext
void vApplicationStackOverflowHook()
{
	word32 a0_19;
	word32 a1_20;
	word32 a2_21;
	word32 a4_22;
	word32 a5_23;
	word32 s4_24;
	word32 s8_25;
	puts(587898508, out a0_19, out a1_20, out a2_21, out a4_22, out a5_23, out s4_24, out s8_25);
	while (true)
		;
}

// 23000BAC: void vApplicationMallocFailedHook(Register Eq_2 ra, Register Eq_2 a3, Stack Eq_2 dwArg18, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg88, Stack Eq_2 dwArgAC)
// Called from:
//      pvPortMalloc
void vApplicationMallocFailedHook(Eq_2 ra, Eq_2 a3, Eq_2 dwArg18, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg88, Eq_2 dwArgAC)
{
	xPortGetFreeHeapSize();
	word32 s1_41;
	word32 a0_42;
	word32 a1_43;
	word32 a2_44;
	word32 a3_45;
	word32 a4_46;
	word32 a5_47;
	word32 a7_48;
	word32 s2_49;
	word32 s3_50;
	word32 s4_51;
	word32 s5_52;
	word32 s6_53;
	word32 s7_54;
	word32 s8_55;
	word32 s9_56;
	word32 s10_57;
	word32 s11_58;
	word32 t4_59;
	printf(ra, &g_t230A9E54, a3, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_41, out a0_42, out a1_43, out a2_44, out a3_45, out a4_46, out a5_47, out a7_48, out s2_49, out s3_50, out s4_51, out s5_52, out s6_53, out s7_54, out s8_55, out s9_56, out s10_57, out s11_58, out t4_59);
	while (true)
		;
}

// 23000BC4: void vApplicationIdleHook()
// Called from:
//      prvIdleTask
void vApplicationIdleHook()
{
	__wait_for_interrupt();
}

// 23000BCA: Register int32 vApplicationGetIdleTaskMemory(Register ptr32 a0, Register ptr32 a1, Register ptr32 a2)
// Called from:
//      vTaskStartScheduler
int32 vApplicationGetIdleTaskMemory(ptr32 a0, ptr32 a1, ptr32 a2)
{
	g_ptr420117B8 = a0;
	g_ptr42010FF8 = a1;
	*(ptr32 *) 96 = a2;
	return 96;
}

// 23000BE6: Register int32 vApplicationGetTimerTaskMemory(Register ptr32 a0, Register ptr32 a1, Register ptr32 a2)
// Called from:
//      xTimerCreateTimerTask
int32 vApplicationGetTimerTaskMemory(ptr32 a0, ptr32 a1, ptr32 a2)
{
	g_ptr42011818 = a0;
	g_ptr42011178 = a1;
	*(ptr32 *) 400 = a2;
	return 400;
}

// 23000C02: Register word32 user_vAssertCalled(Register Eq_2 a4, Register ptr32 mstatus, Register out (ptr32 Eq_3261) a5Out)
// Called from:
//      k_queue_init
//      k_queue_prepend
//      k_timer_init
//      k_timer_stop
//      k_timer_delete
//      k_timer_start
//      k_delayed_work_submit
//      work_timeout
//      bt_conn_process_tx
//      set_ad
//      hci_tx_thread
//      bt_recv
//      bt_recv_prio
//      xEventGroupCreateStatic
//      xEventGroupWaitBits
//      xEventGroupSetBits
//      vEventGroupDelete
//      xQueueGenericReset
//      xQueueGenericCreateStatic
//      xQueueGenericCreate
//      xQueueCreateCountingSemaphore
//      xQueueGenericSend
//      xQueueGiveMutexRecursive
//      xQueueGenericSendFromISR
//      xQueueGiveFromISR
//      xQueueReceive
//      xQueueSemaphoreTake
//      xQueueTakeMutexRecursive
//      uxQueueMessagesWaiting
//      vQueueDelete
//      prvInitialiseNewStreamBuffer
//      prvWriteBytesToBuffer
//      prvReadBytesFromBuffer
//      xStreamBufferGenericCreate
//      xStreamBufferGenericCreateStatic
//      vStreamBufferDelete
//      xStreamBufferSpacesAvailable
//      xStreamBufferSend
//      xStreamBufferSendFromISR
//      xStreamBufferReceive
//      xStreamBufferReceiveFromISR
//      xStreamBufferIsEmpty
//      prvDeleteTCB
//      xTaskCreateStatic
//      vTaskDelete
//      eTaskGetState
//      vTaskStartScheduler
//      xTaskIncrementTick
//      xTaskResumeAll
//      vTaskDelay
//      vTaskSwitchContext
//      vTaskPlaceOnEventList
//      vTaskPlaceOnUnorderedEventList
//      vTaskPlaceOnEventListRestricted
//      xTaskRemoveFromEventList
//      vTaskRemoveFromUnorderedEventList
//      vTaskSetTimeOutState
//      xTaskCheckForTimeOut
//      xTaskPriorityDisinherit
//      vTaskPriorityDisinheritAfterTimeout
//      xTaskGenericNotify
//      xTaskGenericNotifyFromISR
//      vTaskNotifyGiveFromISR
//      xTimerCreateTimerTask
//      xTimerCreate
//      xTimerCreateStatic
//      xTimerGenericCommand
//      prvSwitchTimerLists
//      prvTimerTask
//      pvTimerGetTimerID
//      xPortStartScheduler
//      pvPortMalloc
//      vPortFree
//      vPortDefineHeapRegions
//      iperf_server_udp
word32 user_vAssertCalled(Eq_2 a4, ptr32 mstatus, struct Eq_3261 & a5Out)
{
	__csrrc(mstatus, 0x08);
	do
		;
	while (a4 != 0x01);
	a5Out = (struct Eq_3261 *) 0x01;
	return dwArgB4;
}

