pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0000.c
// 23000C1A: void bfl_main(Register ptr32 t0, Register Eq_2 s0, Register (ptr32 Eq_23) a5, Register Eq_2 s2, Register Eq_2 s3, Register ptr32 fcsr, Register ptr32 mstatus, Register ptr32 misa, Register ptr32 mie, Register ptr32 mtvec, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg78, Stack Eq_2 dwArg84, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA4, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0124, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0144, Stack Eq_2 dwArg0164)
// Called from:
//      bl602_start
void bfl_main(ptr32 t0, Eq_2 s0, struct Eq_23 * a5, Eq_2 s2, Eq_2 s3, ptr32 fcsr, ptr32 mstatus, ptr32 misa, ptr32 mie, ptr32 mtvec, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg2C, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg5C, Eq_2 dwArg6C, Eq_2 dwArg78, Eq_2 dwArg84, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA4, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0124, Eq_2 dwArg0128, Eq_2 dwArg0144, Eq_2 dwArg0164)
{
	bl_sys_early_init(t0, a5, mtvec);
	word32 s8_868;
	word32 s2_867;
	word32 a1_866;
	word32 s1_865;
	Eq_2 ra_36 = bl_uart_init(0x00, 0x10, 0x07, 2000000, out s1_865, out a1_866, out s2_867, out s8_868);
	word32 s8_875;
	word32 s4_874;
	word32 a5_873;
	word32 a4_872;
	word32 a2_871;
	word32 a1_870;
	word32 a0_869;
	puts(587896712, out a0_869, out a1_870, out a2_871, out a4_872, out a5_873, out s4_874, out s8_875);
	bl_sys_init();
	word32 s8_882;
	word32 s4_881;
	word32 a5_880;
	word32 a4_879;
	word32 a2_878;
	word32 a1_877;
	word32 a0_876;
	puts(587896740, out a0_876, out a1_877, out a2_878, out a4_879, out a5_880, out s4_881, out s8_882);
	Eq_2 a0_79 = bl_chip_banner(fp + -76);
	if (a0_79 == 0x00)
	{
		word32 a0_1117;
		word32 a1_1118;
		word32 a2_1119;
		word32 a4_1120;
		word32 a5_1121;
		word32 s4_1122;
		word32 s8_1123;
		puts(a0_79, out a0_1117, out a1_1118, out a2_1119, out a4_1120, out a5_1121, out s4_1122, out s8_1123);
	}
	word32 s8_889;
	word32 s4_888;
	word32 a5_887;
	word32 a4_886;
	word32 a2_885;
	word32 a1_884;
	word32 a0_883;
	puts(0x230C6900, out a0_883, out a1_884, out a2_885, out a4_886, out a5_887, out s4_888, out s8_889);
	word32 s8_896;
	word32 s4_895;
	word32 a5_894;
	word32 a4_893;
	word32 a2_892;
	word32 a1_891;
	word32 a0_890;
	puts(0x230C6900, out a0_890, out a1_891, out a2_892, out a4_893, out a5_894, out s4_895, out s8_896);
	word32 s8_903;
	word32 s4_902;
	word32 a5_901;
	word32 a4_900;
	word32 a2_899;
	word32 a1_898;
	word32 a0_897;
	puts(0x230B4414, out a0_897, out a1_898, out a2_899, out a4_900, out a5_901, out s4_902, out s8_903);
	word32 s8_910;
	word32 s4_909;
	word32 a5_908;
	word32 a4_907;
	word32 a2_906;
	word32 a1_905;
	word32 a0_904;
	int32 s0_152 = bl_chip_info(ra_36, puts(587896764, out a0_904, out a1_905, out a2_906, out a4_907, out a5_908, out s4_909, out s8_910), fp + -72, misa);
	word32 a4_914;
	word32 a2_913;
	word32 a1_912;
	word32 a0_911;
	word32 a5_915;
	word32 s4_916;
	word32 s8_917;
	puts(fp + -72, out a0_911, out a1_912, out a2_913, out a4_914, out a5_915, out s4_916, out s8_917);
	word32 a0_918;
	word32 a1_919;
	word32 a2_920;
	word32 a4_921;
	word32 a5_922;
	word32 s4_923;
	word32 s8_924;
	puts(s0_152 + -0x0700, out a0_918, out a1_919, out a2_920, out a4_921, out a5_922, out s4_923, out s8_924);
	word32 a0_925;
	word32 a1_926;
	word32 a2_927;
	word32 a4_928;
	word32 a5_929;
	word32 s4_930;
	word32 s8_931;
	puts(587896788, out a0_925, out a1_926, out a2_927, out a4_928, out a5_929, out s4_930, out s8_931);
	word32 a0_932;
	word32 a1_933;
	word32 a2_934;
	word32 a4_935;
	word32 a5_936;
	word32 s4_937;
	word32 s8_938;
	puts(587896804, out a0_932, out a1_933, out a2_934, out a4_935, out a5_936, out s4_937, out s8_938);
	word32 a0_939;
	word32 a1_940;
	word32 a2_941;
	word32 a4_942;
	word32 a5_943;
	word32 s4_944;
	word32 s8_945;
	puts(s0_152 + -0x0700, out a0_939, out a1_940, out a2_941, out a4_942, out a5_943, out s4_944, out s8_945);
	word32 a0_946;
	word32 a1_947;
	word32 a2_948;
	word32 a4_949;
	word32 a5_950;
	word32 s4_951;
	word32 s8_952;
	puts(587896788, out a0_946, out a1_947, out a2_948, out a4_949, out a5_950, out s4_951, out s8_952);
	word32 a0_953;
	word32 a1_954;
	word32 a2_955;
	word32 a4_956;
	word32 a5_957;
	word32 s4_958;
	word32 s8_959;
	puts(587896804, out a0_953, out a1_954, out a2_955, out a4_956, out a5_957, out s4_958, out s8_959);
	word32 a0_960;
	word32 a1_961;
	word32 a2_962;
	word32 a4_963;
	word32 a5_964;
	word32 s4_965;
	word32 s8_966;
	puts(s0_152 + -0x0700, out a0_960, out a1_961, out a2_962, out a4_963, out a5_964, out s4_965, out s8_966);
	word32 a0_967;
	word32 a1_968;
	word32 a2_969;
	word32 a4_970;
	word32 a5_971;
	word32 s4_972;
	word32 s8_973;
	puts(587896848, out a0_967, out a1_968, out a2_969, out a4_970, out a5_971, out s4_972, out s8_973);
	word32 a0_974;
	word32 a1_975;
	word32 a2_976;
	word32 a4_977;
	word32 a5_978;
	word32 s4_979;
	word32 s8_980;
	puts(587896864, out a0_974, out a1_975, out a2_976, out a4_977, out a5_978, out s4_979, out s8_980);
	word32 a0_981;
	word32 a1_982;
	word32 a2_983;
	word32 a4_984;
	word32 a5_985;
	word32 s4_986;
	word32 s8_987;
	puts(s0_152 + -0x0700, out a0_981, out a1_982, out a2_983, out a4_984, out a5_985, out s4_986, out s8_987);
	word32 a0_988;
	word32 a1_989;
	word32 a2_990;
	word32 a4_991;
	word32 a5_992;
	word32 s4_993;
	word32 s8_994;
	puts(587896888, out a0_988, out a1_989, out a2_990, out a4_991, out a5_992, out s4_993, out s8_994);
	word32 a0_995;
	word32 a1_996;
	word32 a2_997;
	word32 a4_998;
	word32 a5_999;
	word32 s4_1000;
	word32 s8_1001;
	puts(587896904, out a0_995, out a1_996, out a2_997, out a4_998, out a5_999, out s4_1000, out s8_1001);
	word32 a0_1002;
	word32 a1_1003;
	word32 a2_1004;
	word32 a4_1005;
	word32 a5_1006;
	word32 s4_1007;
	word32 s8_1008;
	puts(s0_152 + -0x0700, out a0_1002, out a1_1003, out a2_1004, out a4_1005, out a5_1006, out s4_1007, out s8_1008);
	word32 a0_1009;
	word32 a1_1010;
	word32 a2_1011;
	word32 a4_1012;
	word32 a5_1013;
	word32 s4_1014;
	word32 s8_1015;
	puts(0x230A9850, out a0_1009, out a1_1010, out a2_1011, out a4_1012, out a5_1013, out s4_1014, out s8_1015);
	word32 a0_1016;
	word32 a1_1017;
	word32 a2_1018;
	word32 a4_1019;
	word32 a5_1020;
	word32 s4_1021;
	word32 s8_1022;
	puts(587896928, out a0_1016, out a1_1017, out a2_1018, out a4_1019, out a5_1020, out s4_1021, out s8_1022);
	word32 a0_1023;
	word32 a1_1024;
	word32 a2_1025;
	word32 a4_1026;
	word32 a5_1027;
	word32 s4_1028;
	word32 s8_1029;
	puts(s0_152 + -0x0700, out a0_1023, out a1_1024, out a2_1025, out a4_1026, out a5_1027, out s4_1028, out s8_1029);
	word32 a0_1030;
	word32 a1_1031;
	word32 a2_1032;
	word32 a4_1033;
	word32 a5_1034;
	word32 s4_1035;
	word32 s8_1036;
	puts(587896940, out a0_1030, out a1_1031, out a2_1032, out a4_1033, out a5_1034, out s4_1035, out s8_1036);
	word32 a0_1037;
	word32 a1_1038;
	word32 a2_1039;
	word32 a4_1040;
	word32 a5_1041;
	word32 s4_1042;
	word32 s8_1043;
	puts(587896956, out a0_1037, out a1_1038, out a2_1039, out a4_1040, out a5_1041, out s4_1042, out s8_1043);
	Eq_2 a4_397;
	word32 a0_1044;
	word32 a1_1045;
	word32 a2_1046;
	word32 a4_1047;
	word32 a5_1048;
	word32 s4_1049;
	word32 s8_1050;
	word32 a0_1051;
	word32 a1_1052;
	word32 a2_1053;
	word32 a5_1054;
	word32 s4_1055;
	word32 s8_1056;
	puts((word32) puts(s0_152 + -0x0700, out a0_1044, out a1_1045, out a2_1046, out a4_1047, out a5_1048, out s4_1049, out s8_1050) + 0x0414, out a0_1051, out a1_1052, out a2_1053, out a4_397, out a5_1054, out s4_1055, out s8_1056);
	vPortDefineHeapRegions(s0_152, &g_t4200CEDC, a4_397, mstatus, dwArgD8);
	word32 s1_1057;
	word32 a0_1058;
	word32 a1_1059;
	word32 a2_1060;
	word32 a3_1061;
	word32 a4_1062;
	word32 a5_1063;
	word32 a7_1064;
	word32 s2_1065;
	word32 s3_1066;
	word32 s4_1067;
	word32 s5_1068;
	word32 s6_1069;
	word32 s7_1070;
	word32 s8_1071;
	word32 s9_1072;
	word32 s10_1073;
	word32 s11_1074;
	word32 t4_1075;
	Eq_2 ra_462 = blog_init(printf(ra_36, &g_t230A9888, 0x00FFF860, dwLoc48, dwLoc28, dwArg20, dwArg24, dwArg48, dwArg6C, out s1_1057, out a0_1058, out a1_1059, out a2_1060, out a3_1061, out a4_1062, out a5_1063, out a7_1064, out s2_1065, out s3_1066, out s4_1067, out s5_1068, out s6_1069, out s7_1070, out s8_1071, out s9_1072, out s10_1073, out s11_1074, out t4_1075), dwLoc38, dwArg10, dwArg14, dwArg38, dwArg5C);
	bl_irq_init();
	Eq_2 a3_490;
	Eq_2 a3_518;
	Eq_2 a4_519;
	Eq_2 a5_520;
	Eq_2 s1_523;
	Eq_2 s0_547;
	Eq_2 s6_555;
	Eq_2 s1_572;
	Eq_2 s10_573;
	Eq_2 s2_575;
	Eq_2 s4_577;
	Eq_2 s6_579;
	Eq_2 s8_581;
	Eq_2 s9_582;
	ptr32 gp_596;
	Eq_2 ra_597 = hal_board_cfg(hal_boot2_init(bl_dma_init(bl_sec_test(bl_sec_init(ra_462, mstatus, dwLoc4C, dwLoc48, dwLoc38, dwLoc20, dwLoc1C, dwLoc10, dwLoc0C, dwArg00, dwArg04, dwArg10, dwArg14, dwArg18, dwArg28, dwArg2C, dwArg34, dwArg38, dwArg3C, s3, dwArg5C, dwArgA8, dwArgB8, dwArgE8, dwArg0128, out a3_490), a3_490, dwLoc38, dwArg10, dwArg14, dwArg38, dwArg5C, out s1_523, out a3_518, out a4_519, out a5_520), s1_523, a3_518, a4_519, a5_520, mstatus, dwLoc50, dwLoc4C, dwLoc48, s2, s0, dwLoc28, dwLoc20, dwLoc1C, dwLoc08, dwLoc04, dwArg00, dwArg04, dwArg08, dwArg28, dwArg2C, s3, dwArg98, dwArgB8, dwArgC8, dwArgD8, dwArg0108, out s0_547, out s6_555), s6_555, dwLoc44, dwLoc38, dwLoc20, dwLoc1C, dwLoc10, dwLoc0C, dwArg08, dwArg10, dwArg14, dwArg18, dwArg2C, dwArg38, dwArg3C, dwArg5C, dwArgC8, out s1_572, out s2_575, out s4_577, out s6_579, out s8_581, out s9_582, out s10_573), s0_547, s1_572, s2_575, s4_577, s6_579, s8_581, s9_582, s10_573, mstatus, dwLoc48, dwLoc44, dwLoc38, dwLoc28, dwArg44, dwArg84, dwArgA4, out gp_596);
	word32 a0_1076;
	word32 a1_1077;
	word32 a2_1078;
	word32 a4_1079;
	word32 a5_1080;
	word32 s4_1081;
	word32 s8_1082;
	puts(587896988, out a0_1076, out a1_1077, out a2_1078, out a4_1079, out a5_1080, out s4_1081, out s8_1082);
	word32 a0_1083;
	word32 a1_1084;
	word32 a2_1085;
	word32 a4_1086;
	word32 a5_1087;
	word32 s4_1088;
	word32 s8_1089;
	puts(587897032, out a0_1083, out a1_1084, out a2_1085, out a4_1086, out a5_1087, out s4_1088, out s8_1089);
	word32 tp_1090;
	word32 t0_1091;
	word32 s0_1092;
	word32 s1_1093;
	word32 a0_1094;
	word32 a2_1095;
	word32 a3_1096;
	word32 a4_1097;
	word32 a5_1098;
	word32 s2_1099;
	word32 s3_1100;
	word32 s6_1101;
	word32 s7_1102;
	Eq_2 ra_665 = xTaskCreateStatic(ra_597, &g_ptr23000A30, 587897072, 0x0400, 0x00, 0x0F, 0x4200F738, 0x42010738, mstatus, dwLoc4C, s0, dwArg98, dwArg0164, out tp_1090, out t0_1091, out s0_1092, out s1_1093, out a0_1094, out a2_1095, out a3_1096, out a4_1097, out a5_1098, out s2_1099, out s3_1100, out s6_1101, out s7_1102);
	word32 a0_1103;
	word32 a1_1104;
	word32 a2_1105;
	word32 a4_1106;
	word32 a5_1107;
	word32 s4_1108;
	word32 s8_1109;
	puts(587897084, out a0_1103, out a1_1104, out a2_1105, out a4_1106, out a5_1107, out s4_1108, out s8_1109);
	Eq_2 a6_694;
	Eq_2 ra_696 = tcpip_init(ra_665, mstatus, dwLoc3C, dwLoc38, dwLoc10, dwArg18, dwArg3C, dwArg78, dwArg88, dwArg98, dwArgB8, dwArgD8, dwArgF8, out a6_694);
	word32 a0_1110;
	word32 a1_1111;
	word32 a2_1112;
	word32 a4_1113;
	word32 a5_1114;
	word32 s4_1115;
	word32 s8_1116;
	puts(587897116, out a0_1110, out a1_1111, out a2_1112, out a4_1113, out a5_1114, out s4_1115, out s8_1116);
	vTaskStartScheduler(ra_696, gp_596, a6_694, fcsr, mstatus, mie, mtvec, dwLoc4C, dwLoc0C, dwArg14, dwArg58, dwArg78, dwArg88, dwArg0124, dwArg0144);
}

// 23000E36: void __usr_at_cmd_demo(Register Eq_2 ra, Register Eq_2 s3, Register ptr32 mstatus, Stack ptr32 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack word32 dwArg64, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack word32 dwArg80, Stack ptr32 dwArg84, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128)
void __usr_at_cmd_demo(Eq_2 ra, Eq_2 s3, ptr32 mstatus, ptr32 dwArg34, Eq_2 dwArg38, Eq_2 dwArg3C, word32 dwArg64, Eq_2 dwArg68, Eq_2 dwArg78, word32 dwArg80, ptr32 dwArg84, Eq_2 dwArgA8, Eq_2 dwArgC8, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0128)
{
	Eq_2 a0_18;
	Eq_2 a2_20;
	word32 t1_343;
	word32 a1_344;
	word32 a3_345;
	word32 a4_346;
	word32 a5_347;
	Eq_2 ra_24 = memset(ra, fp + -84, 0x00, 0x0044, out t1_343, out a0_18, out a1_344, out a2_20, out a3_345, out a4_346, out a5_347);
	Eq_2 s1_33 = *(union Eq_2 *) 0x00FFFC40;
	Eq_2 a4_39 = (word32) *(union Eq_2 *) 0x00FFFC40;
	Eq_2 dwLoc60_295 = SEQ(nLoc5F, 0x00);
	if (a4_39 == 63)
	{
		Eq_2 a2_170;
		Eq_2 a3_171;
		Eq_2 a4_172;
		ptr32 mstatus_176;
		Eq_2 s1_179;
		Eq_2 s3_183;
		Eq_2 a2_201;
		Eq_2 a3_202;
		Eq_2 a4_203;
		ptr32 mstatus_207;
		word32 s0_209;
		Eq_2 s1_210;
		Eq_2 s3_214;
		word32 s0_348;
		word32 a0_349;
		word32 a1_350;
		word32 a5_351;
		word32 s2_352;
		word32 s4_353;
		word32 s5_354;
		word32 s6_355;
		word32 s7_356;
		word32 s8_357;
		word32 s9_358;
		word32 s10_359;
		word32 s11_360;
		word32 a0_361;
		word32 a1_362;
		word32 a5_363;
		word32 s2_364;
		word32 s4_365;
		word32 s5_366;
		word32 s6_367;
		word32 s7_368;
		word32 s8_369;
		word32 s9_370;
		word32 s10_371;
		word32 s11_372;
		word32 s0_373;
		word32 s1_374;
		word32 a0_375;
		word32 a1_376;
		word32 a2_377;
		word32 a3_378;
		word32 a4_379;
		word32 a5_380;
		word32 s2_381;
		word32 s3_382;
		word32 s4_383;
		word32 s5_384;
		word32 s6_385;
		word32 s7_386;
		word32 s8_387;
		word32 s9_388;
		word32 s10_389;
		word32 s11_390;
		word32 mstatus_391;
		at_dump_noend(at_dump_noend(at_dump_noend(ra_24, s1_33, 0x230C6900, a2_20, 63, a4_39, s3, mstatus, a0_18, dwLoc60_295, dwLoc5C, dwLoc58, dwLoc14, dwLoc10, dwLoc0C, fp + -80, dwArg38, dwArg3C, dwArg68, dwArg78, dwArgA8, out s0_348, out s1_179, out a0_349, out a1_350, out a2_170, out a3_171, out a4_172, out a5_351, out s2_352, out s3_183, out s4_353, out s5_354, out s6_355, out s7_356, out s8_357, out s9_358, out s10_359, out s11_360, out mstatus_176), s1_179, 587898572, a2_170, a3_171, a4_172, s3_183, mstatus_176, a0_18, dwLoc60_295, dwLoc5C, dwLoc58, dwLoc14, dwLoc10, dwLoc0C, fp + -80, dwArg38, dwArg3C, dwArg68, dwArg78, dwArgA8, out s0_209, out s1_210, out a0_361, out a1_362, out a2_201, out a3_202, out a4_203, out a5_363, out s2_364, out s3_214, out s4_365, out s5_366, out s6_367, out s7_368, out s8_369, out s9_370, out s10_371, out s11_372, out mstatus_207), s1_210, s0_209 + -0x0700, a2_201, a3_202, a4_203, s3_214, mstatus_207, a0_18, dwLoc60_295, dwLoc5C, dwLoc58, dwLoc14, dwLoc10, dwLoc0C, fp + -80, dwArg38, dwArg3C, dwArg68, dwArg78, dwArgA8, out s0_373, out s1_374, out a0_375, out a1_376, out a2_377, out a3_378, out a4_379, out a5_380, out s2_381, out s3_382, out s4_383, out s5_384, out s6_385, out s7_386, out s8_387, out s9_388, out s10_389, out s11_390, out mstatus_391);
	}
	else if (a4_39 == 61)
	{
		*(union Eq_2 *) 0x00FFFC41 = s1_33;
		word32 a0_49;
		Eq_2 a2_51;
		Eq_2 a4_52;
		Eq_2 s3_63;
		Eq_2 a3_66;
		word32 s0_392;
		word32 s1_393;
		word32 a5_394;
		word32 s2_395;
		word32 s4_396;
		word32 s5_397;
		Eq_2 ra_67 = at_get_parameters(ra_24, s1_33, fp + -0x006C, 0x02, fp + -112, 0x00FFFC41, dwArg34, dwArg38, dwArg64, dwArg80, dwArg84, dwArgA8, dwArgC8, dwArgE8, dwArg0108, dwArg0128, out s0_392, out s1_393, out a0_49, out a2_51, out a3_66, out a4_52, out a5_394, out s2_395, out s3_63, out s4_396, out s5_397);
		if (a0_49 == 0x00)
		{
			Eq_2 a3_76;
			Eq_2 a4_77;
			ptr32 mstatus_81;
			Eq_2 s1_84;
			Eq_2 s2_87;
			Eq_2 s3_88;
			Eq_2 a2_108;
			Eq_2 a3_109;
			Eq_2 a4_110;
			ptr32 mstatus_114;
			Eq_2 s1_117;
			Eq_2 s3_121;
			word32 s0_398;
			word32 a0_399;
			word32 a1_400;
			word32 a2_401;
			word32 a5_402;
			word32 s4_403;
			word32 s5_404;
			word32 s6_405;
			word32 s7_406;
			word32 s8_407;
			word32 s9_408;
			word32 s10_409;
			word32 s11_410;
			word32 s0_411;
			word32 a0_412;
			word32 a1_413;
			word32 a5_414;
			word32 s2_415;
			word32 s4_416;
			word32 s5_417;
			word32 s6_418;
			word32 s7_419;
			word32 s8_420;
			word32 s9_421;
			word32 s10_422;
			word32 s11_423;
			word32 s0_424;
			word32 s1_425;
			word32 a0_426;
			word32 a1_427;
			word32 a2_428;
			word32 a3_429;
			word32 a4_430;
			word32 a5_431;
			word32 s2_432;
			word32 s3_433;
			word32 s4_434;
			word32 s5_435;
			word32 s6_436;
			word32 s7_437;
			word32 s8_438;
			word32 s9_439;
			word32 s10_440;
			word32 s11_441;
			word32 mstatus_442;
			at_dump_noend(at_dump_noend(at_dump_noend(ra_67, 0x230C7000, 0x230C6900, a2_51, a3_66, a4_52, s3_63, mstatus, a0_18, dwLoc60_295, dwLoc5C, dwLoc58, dwLoc14, dwLoc10, dwLoc0C, fp + -80, dwArg38, dwArg3C, dwArg68, dwArg78, dwArgA8, out s0_398, out s1_84, out a0_399, out a1_400, out a2_401, out a3_76, out a4_77, out a5_402, out s2_87, out s3_88, out s4_403, out s5_404, out s6_405, out s7_406, out s8_407, out s9_408, out s10_409, out s11_410, out mstatus_81), s1_84, 587898596, s2_87, a3_76, a4_77, s3_88, mstatus_81, a0_18, dwLoc60_295, dwLoc5C, dwLoc58, dwLoc14, dwLoc10, dwLoc0C, fp + -80, dwArg38, dwArg3C, dwArg68, dwArg78, dwArgA8, out s0_411, out s1_117, out a0_412, out a1_413, out a2_108, out a3_109, out a4_110, out a5_414, out s2_415, out s3_121, out s4_416, out s5_417, out s6_418, out s7_419, out s8_420, out s9_421, out s10_422, out s11_423, out mstatus_114), s1_117, (word32) s1_117 - 0x0700, a2_108, a3_109, a4_110, s3_121, mstatus_114, a0_18, dwLoc60_295, dwLoc5C, dwLoc58, dwLoc14, dwLoc10, dwLoc0C, fp + -80, dwArg38, dwArg3C, dwArg68, dwArg78, dwArgA8, out s0_424, out s1_425, out a0_426, out a1_427, out a2_428, out a3_429, out a4_430, out a5_431, out s2_432, out s3_433, out s4_434, out s5_435, out s6_436, out s7_437, out s8_438, out s9_439, out s10_440, out s11_441, out mstatus_442);
		}
	}
}

// 23000EF6: void usr_at_cmd_register()
// Called from:
//      aos_loop_proc
void usr_at_cmd_register()
{
	at_command_register(0x230A9F00, 0x01);
}

// 23000F04: void bt_enable_cb(Register Eq_2 ra, Register Eq_2 s0, Register word32 a0, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s4, Register Eq_2 s5, Register word32 s6, Register (ptr32 Eq_2096) s11, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg68, Stack Eq_2 dwArg70, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0128)
void bt_enable_cb(Eq_2 ra, Eq_2 s0, word32 a0, Eq_2 a3, Eq_2 a4, Eq_2 s4, Eq_2 s5, word32 s6, struct Eq_2096 * s11, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg68, Eq_2 dwArg70, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0128)
{
	if (a0 != 0x00)
		return;
	ble_cli_register();
	blemesh_cli_register();
	ble_tp_init(ra, s0, a3, a4, s4, s5, s6, s11, mstatus, dwArg04, dwArg14, dwArg18, dwArg1C, dwArg28, dwArg38, dwArg3C, dwArg40, dwArg44, dwArg48, dwArg68, dwArg70, dwArg78, dwArg88, dwArg8C, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0128);
}

