pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0000.c
// 23000F1C: Register Eq_2 ble_stack_start(Register Eq_2 ra, Register word32 s0, Register Eq_2 s1, Register Eq_2 s2, Register (ptr32 Eq_326) s3, Register Eq_2 s6, Register Eq_2 s7, Register ptr32 fflags, Register ptr32 frm, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0158, Register out ptr32 a0Out, Register out ptr32 a1Out, Register out ptr32 mstatusOut)
// Called from:
//      cmd_stack_ble
//      aos_loop_proc
Eq_2 ble_stack_start(Eq_2 ra, word32 s0, Eq_2 s1, Eq_2 s2, struct Eq_326 * s3, Eq_2 s6, Eq_2 s7, ptr32 fflags, ptr32 frm, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg6C, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0158, ptr32 & a0Out, ptr32 & a1Out, ptr32 & mstatusOut)
{
	Eq_2 a3_18;
	ptr32 mstatus_29;
	Eq_2 s1_32;
	Eq_2 s2_35;
	Eq_2 ra_30 = ble_controller_init(ra, s0, s1, (struct Eq_326 *) 0x1F, s2, s3, s6, s7, fflags, frm, dwLoc10, dwLoc0C, dwLoc08, dwArg00, dwArg04, dwArg10, dwArg14, dwArg20, dwArg24, dwArg28, dwArg34, dwArg38, dwArg40, dwArg44, dwArg48, dwArg58, dwArg68, dwArg6C, dwArg88, dwArg8C, dwArg98, dwArgA8, dwArgB8, dwArgD8, dwArgE8, dwArgF8, dwArg0118, dwArg0128, dwArg0138, dwArg0158, out s1_32, out a3_18, out s2_35, out mstatus_29);
	Eq_2 a4_53 = hci_driver_init(a3_18);
	bt_enable(ra_30, s1_32, a3_18, a4_53, s2_35, mstatus_29, dwArg00, dwArg04, dwArg08, dwArg14, dwArg18, dwArg1C, dwArg28, dwArg34, dwArg38, dwArg3C, dwArg40, dwArg44, dwArg50, dwArg54, dwArg58, dwArg78, dwArg88, dwArg8C, dwArg98, dwArg9C, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgE8, dwArgF8, dwArg0108, dwArg0118, dwArg0128, dwArg0138);
	a0Out = a0_59;
	a1Out = a1_60;
	mstatusOut = mstatus_73;
	return ra_74;
}

// 23000F3A: void blesync_complete_cb()
void blesync_complete_cb()
{
}

// 23000F3C: void app_delayed_action_bleadv(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s6, Register ptr32 s10, Register ptr32 mstatus, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg28, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg44, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg54, Stack Eq_2 dwArg64, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8)
void app_delayed_action_bleadv(Eq_2 ra, Eq_2 s0, Eq_2 s6, ptr32 s10, ptr32 mstatus, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg0C, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg28, Eq_2 dwArg3C, Eq_2 dwArg44, Eq_2 dwArg4C, Eq_2 dwArg54, Eq_2 dwArg64, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8)
{
	int32 a5_13;
	word32 a1_113;
	word32 a2_114;
	word32 a3_115;
	word32 a4_116;
	strlen(587898700, out a1_113, out a2_114, out a3_115, out a4_116, out a5_13);
	ptr32 mstatus_29;
	ptr32 s10_33;
	Eq_2 s6_38;
	word32 s1_117;
	word32 a0_118;
	word32 s2_119;
	Eq_2 ra_30 = aos_cli_input_direct(ra, 0x230AA000, 587898700, a5_13, s6, s10, mstatus, dwLoc10, s0, dwArg0C, dwArg18, dwArg3C, dwArg44, dwArg64, dwArg88, dwArgA8, dwArgC8, out s1_117, out a0_118, out s2_119, out s6_38, out s10_33, out mstatus_29);
	int32 a5_55;
	word32 a1_120;
	word32 a2_121;
	word32 a3_122;
	word32 a4_123;
	strlen(587898712, out a1_120, out a2_121, out a3_122, out a4_123, out a5_55);
	word32 s1_124;
	word32 a0_125;
	word32 s2_126;
	word32 s6_127;
	word32 s10_128;
	word32 mstatus_129;
	aos_cli_input_direct(ra_30, s0, 587898712, a5_55, s6_38, s10_33, mstatus_29, dwArg00, dwArg04, dwArg1C, dwArg28, dwArg4C, dwArg54, ra, dwArg98, dwArgB8, dwArgD8, out s1_124, out a0_125, out s2_126, out s6_127, out s10_128, out mstatus_129);
}

// 23000F74: void wifiprov_api_state_get(Register Eq_2 ra, Register Eq_2 a3, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg88, Stack Eq_2 dwArgAC)
void wifiprov_api_state_get(Eq_2 ra, Eq_2 a3, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg88, Eq_2 dwArgAC)
{
	struct Eq_446 * a4_19;
	word32 s1_63;
	word32 a0_64;
	word32 a1_65;
	word32 a2_66;
	word32 a3_67;
	word32 a5_68;
	word32 a7_69;
	word32 s2_70;
	word32 s3_71;
	word32 s4_72;
	word32 s5_73;
	word32 s6_74;
	word32 s7_75;
	word32 s8_76;
	word32 s9_77;
	word32 s10_78;
	word32 s11_79;
	word32 t4_80;
	Eq_2 ra_21 = printf(ra, &g_t230A9FC0, a3, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_63, out a0_64, out a1_65, out a2_66, out a3_67, out a4_19, out a5_68, out a7_69, out s2_70, out s3_71, out s4_72, out s5_73, out s6_74, out s7_75, out s8_76, out s9_77, out s10_78, out s11_79, out t4_80);
	wifi_prov_api_event_state_get(ra_21, a4_19, dwArg14);
}

// 23000F92: void wifiprov_wifi_scan(Register Eq_2 ra, Register Eq_2 a3, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg88, Stack Eq_2 dwArgAC)
void wifiprov_wifi_scan(Eq_2 ra, Eq_2 a3, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg88, Eq_2 dwArgAC)
{
	struct Eq_446 * a4_19;
	word32 s1_63;
	word32 a0_64;
	word32 a1_65;
	word32 a2_66;
	word32 a3_67;
	word32 a5_68;
	word32 a7_69;
	word32 s2_70;
	word32 s3_71;
	word32 s4_72;
	word32 s5_73;
	word32 s6_74;
	word32 s7_75;
	word32 s8_76;
	word32 s9_77;
	word32 s10_78;
	word32 s11_79;
	word32 t4_80;
	Eq_2 ra_21 = printf(ra, &g_t230AA03C, a3, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_63, out a0_64, out a1_65, out a2_66, out a3_67, out a4_19, out a5_68, out a7_69, out s2_70, out s3_71, out s4_72, out s5_73, out s6_74, out s7_75, out s8_76, out s9_77, out s10_78, out s11_79, out t4_80);
	wifi_prov_api_event_trigger_scan(ra_21, a4_19, dwArg14);
}

