pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0000.c
// 23000FB0: void wifiprov_disc_from_ap_ind(Register Eq_2 ra, Register Eq_2 a3, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg88, Stack Eq_2 dwArgAC)
void wifiprov_disc_from_ap_ind(Eq_2 ra, Eq_2 a3, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg88, Eq_2 dwArgAC)
{
	struct Eq_446 * a4_15;
	word32 s1_56;
	word32 a0_57;
	word32 a1_58;
	word32 a2_59;
	word32 a3_60;
	word32 a5_61;
	word32 a7_62;
	word32 s2_63;
	word32 s3_64;
	word32 s4_65;
	word32 s5_66;
	word32 s6_67;
	word32 s7_68;
	word32 s8_69;
	word32 s9_70;
	word32 s10_71;
	word32 s11_72;
	word32 t4_73;
	Eq_2 ra_17 = printf(ra, &g_t230AA010, a3, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_56, out a0_57, out a1_58, out a2_59, out a3_60, out a4_15, out a5_61, out a7_62, out s2_63, out s3_64, out s4_65, out s5_66, out s6_67, out s7_68, out s8_69, out s9_70, out s10_71, out s11_72, out t4_73);
	wifi_prov_api_event_trigger_disconnect(ra_17, a4_15, dwArg14);
}

// 23000FC6: void wifiprov_connect_ap_ind(Register Eq_2 ra, Register Eq_2 a3, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg88, Stack Eq_2 dwArgAC)
void wifiprov_connect_ap_ind(Eq_2 ra, Eq_2 a3, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg88, Eq_2 dwArgAC)
{
	wifi_mgmr_status_code_clean_internal();
	struct Eq_446 * a4_21;
	word32 s1_65;
	word32 a0_66;
	word32 a1_67;
	word32 a2_68;
	word32 a3_69;
	word32 a5_70;
	word32 a7_71;
	word32 s2_72;
	word32 s3_73;
	word32 s4_74;
	word32 s5_75;
	word32 s6_76;
	word32 s7_77;
	word32 s8_78;
	word32 s9_79;
	word32 s10_80;
	word32 s11_81;
	word32 t4_82;
	Eq_2 ra_23 = printf(ra, &g_t230A9FE8, a3, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_65, out a0_66, out a1_67, out a2_68, out a3_69, out a4_21, out a5_70, out a7_71, out s2_72, out s3_73, out s4_74, out s5_75, out s6_76, out s7_77, out s8_78, out s9_79, out s10_80, out s11_81, out t4_82);
	wifi_prov_api_event_trigger_connect(ra_23, a4_21, dwArg14);
}

// 23000FE8: void blsync_disconnected(Register Eq_2 ra, Register Eq_2 a3, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg88, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0168)
void blsync_disconnected(Eq_2 ra, Eq_2 a3, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg88, Eq_2 dwArgAC, Eq_2 dwArgE8, Eq_2 dwArg0128, Eq_2 dwArg0168)
{
	word32 s1_72;
	word32 a0_73;
	word32 a1_74;
	word32 a2_75;
	word32 a3_76;
	word32 a4_77;
	word32 a5_78;
	word32 a7_79;
	word32 s2_80;
	word32 s3_81;
	word32 s4_82;
	word32 s5_83;
	word32 s6_84;
	word32 s7_85;
	word32 s8_86;
	word32 s9_87;
	word32 s10_88;
	word32 s11_89;
	word32 t4_90;
	Eq_2 ra_17 = printf(ra, &g_t230A9FA4, a3, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_72, out a0_73, out a1_74, out a2_75, out a3_76, out a4_77, out a5_78, out a7_79, out s2_80, out s3_81, out s4_82, out s5_83, out s6_84, out s7_85, out s8_86, out s9_87, out s10_88, out s11_89, out t4_90);
	word32 a3_91;
	at_server_notify_with_ctx(ra_17, 0x00, 0x00, mstatus, ra, dwArgE8, dwArg0128, dwArg0168, out a3_91);
}

// 23001006: void blsync_connected(Register Eq_2 ra, Register word32 a0, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg28, Stack Eq_2 dwArg64, Stack Eq_2 dwArg70, Stack Eq_2 dwArg98, Stack Eq_2 dwArgBC, Stack Eq_2 dwArgD8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0158)
void blsync_connected(Eq_2 ra, word32 a0, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg28, Eq_2 dwArg64, Eq_2 dwArg70, Eq_2 dwArg98, Eq_2 dwArgBC, Eq_2 dwArgD8, Eq_2 dwArg0118, Eq_2 dwArg0158)
{
	Eq_2 a3_15;
	Eq_2 ra_18 = at_server_notify_with_ctx(ra, bt_conn_get_dst(a0) + 1, 0x06, mstatus, dwArg64, dwArgD8, dwArg0118, dwArg0158, out a3_15);
	word32 s1_75;
	word32 a0_76;
	word32 a1_77;
	word32 a2_78;
	word32 a3_79;
	word32 a4_80;
	word32 a5_81;
	word32 a7_82;
	word32 s2_83;
	word32 s3_84;
	word32 s4_85;
	word32 s5_86;
	word32 s6_87;
	word32 s7_88;
	word32 s8_89;
	word32 s9_90;
	word32 s10_91;
	word32 s11_92;
	word32 t4_93;
	printf(ra_18, &g_t230ABB4C, a3_15, dwArg08, dwArg28, dwArg70, ra, dwArg98, dwArgBC, out s1_75, out a0_76, out a1_77, out a2_78, out a3_79, out a4_80, out a5_81, out a7_82, out s2_83, out s3_84, out s4_85, out s5_86, out s6_87, out s7_88, out s8_89, out s9_90, out s10_91, out s11_92, out t4_93);
}

// 23001032: void app_delayed_action_bleadvstop(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 s6, Register ptr32 s10, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg64, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0188)
void app_delayed_action_bleadvstop(Eq_2 ra, Eq_2 s0, Eq_2 s6, ptr32 s10, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg0C, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg3C, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg64, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0148, Eq_2 dwArg0158, Eq_2 dwArg0188)
{
	int32 a5_13;
	word32 a1_118;
	word32 a2_119;
	word32 a3_120;
	word32 a4_121;
	strlen(587898744, out a1_118, out a2_119, out a3_120, out a4_121, out a5_13);
	Eq_2 a0_22;
	ptr32 mstatus_30;
	Eq_2 s1_33;
	Eq_2 s2_36;
	word32 s6_122;
	word32 s10_123;
	aos_cli_input_direct(ra, 0x4200F000, 587898744, a5_13, s6, s10, mstatus, dwLoc10, s0, dwArg0C, dwArg18, dwArg3C, dwArg44, dwArg64, dwArg88, dwArgA8, dwArgC8, out s1_33, out a0_22, out s2_36, out s6_122, out s10_123, out mstatus_30);
	Eq_2 a2_54;
	Eq_2 a5_57;
	word32 * s0_84;
	word32 s1_124;
	word32 a0_125;
	word32 a1_126;
	word32 a2_127;
	word32 a3_128;
	word32 a4_129;
	word32 a5_130;
	word32 a6_131;
	word32 s4_132;
	word32 t3_133;
	vPortFree(bl_ble_sync_stop(s1_33, a0_22, s2_36, mstatus_30, dwArg04, dwArg08, dwArg28, dwArg48, dwArg58, dwArg68, dwArg78, dwArg88, dwArgA8, dwArgB8, dwArgC8, dwArgD8, dwArgF8, dwArg0108, dwArg0118, dwArg0148, dwArg0158, out a2_54, out a5_57), a2_54, a5_57, mstatus_30, dwArg0148, dwArg0188, out s0_84, out s1_124, out a0_125, out a1_126, out a2_127, out a3_128, out a4_129, out a5_130, out a6_131, out s4_132, out t3_133);
	*s0_84 = 0x00;
}

// 2300106E: void blsync_ble_start(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a3, Register Eq_2 s5, Register word32 s6, Register (ptr32 Eq_2096) s11, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg0C, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg68, Stack Eq_2 dwArg70, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgBC, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0168)
// Called from:
//      event_cb_cli
void blsync_ble_start(Eq_2 ra, Eq_2 s1, Eq_2 a3, Eq_2 s5, word32 s6, struct Eq_2096 * s11, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg0C, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg68, Eq_2 dwArg70, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgBC, Eq_2 dwArgC8, Eq_2 dwArgF8, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0158, Eq_2 dwArg0168)
{
	Eq_2 a5_15 = 0x4200F264;
	Eq_2 a4_10 = (word32) g_b4200F264;
	if (a4_10 == 0x00)
	{
		g_b4200F264 = 0x01;
		a4_10.u0 = 0x01;
		a5_15 = bt_conn_cb_register(&g_dw4200CF0C, 0x01);
	}
	if (a5_15 == 0x00)
	{
		word32 s3_263;
		Eq_2 a0_31;
		Eq_2 s1_39;
		Eq_2 s2_40;
		Eq_2 s4_42;
		word32 s8_264;
		word32 a6_262;
		word32 a5_261;
		word32 a4_260;
		word32 a3_259;
		word32 a2_258;
		word32 a1_257;
		*a0_31 = pvPortMalloc(ra, s1, 0x01FFF908, a3, a4_10, a5_15, mstatus, dwArg30, dwArg34, dwArg7C, dwArg0128, dwArg0168, out s1_39, out a0_31, out a1_257, out a2_258, out a3_259, out a4_260, out a5_261, out a6_262, out s2_40, out s3_263, out s4_42, out s8_264);
		if (a0_31 == 0x00)
			return;
		ptr32 mstatus_84;
		Eq_2 ra_72 = bl_ble_sync_start(ra, s1_39, a0_31, 0x4200CEFC, 0x23000F3A, s2_40, s4_42, s5, s6, s11, mstatus, dwLoc08, dwArg08, dwArg0C, dwArg10, dwArg14, dwArg18, dwArg38, dwArg40, dwArg44, dwArg48, dwArg68, dwArg78, dwArg88, dwArg8C, dwArg98, dwArgA8, dwArgB8, dwArgC8, dwArgF8, out mstatus_84);
		aos_post_delayed_action(ra_72, 500, 0x23000F3C, mstatus_84, dwArg20, dwArg24, dwArg0118, dwArg0158);
	}
	else
	{
		word32 s1_265;
		word32 a0_266;
		word32 a1_267;
		word32 a2_268;
		word32 a3_269;
		word32 a4_270;
		word32 a5_271;
		word32 a7_272;
		word32 s2_273;
		word32 s3_274;
		word32 s4_275;
		word32 s5_276;
		word32 s6_277;
		word32 s7_278;
		word32 s8_279;
		word32 s9_280;
		word32 s10_281;
		word32 s11_282;
		word32 t4_283;
		printf(ra, &g_t230A9F88, a3, dwArg08, dwArg28, dwArg70, ra, dwArg98, dwArgBC, out s1_265, out a0_266, out a1_267, out a2_268, out a3_269, out a4_270, out a5_271, out a7_272, out s2_273, out s3_274, out s4_275, out s5_276, out s6_277, out s7_278, out s8_279, out s9_280, out s10_281, out s11_282, out t4_283);
	}
}

// 230010F6: Register word32 blsync_ble_stop(Register Eq_2 ra, Register ptr32 mstatus, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0158)
// Called from:
//      event_cb_cli
word32 blsync_ble_stop(Eq_2 ra, ptr32 mstatus, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg0118, Eq_2 dwArg0158)
{
	return aos_post_delayed_action(ra, 100, 0x23001032, mstatus, dwArg20, dwArg24, dwArg0118, dwArg0158);
}

// 23001108: void cmd_coex_dump(Register Eq_2 ra, Register Eq_2 a3, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg70, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgBC)
void cmd_coex_dump(Eq_2 ra, Eq_2 a3, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg70, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgAC, Eq_2 dwArgBC)
{
	coex_dump_pta();
	coex_dump_wifi();
	coex_dump_ble(ra, a3, dwArg08, dwArg18, dwArg28, dwArg60, dwArg64, dwArg70, dwArg88, dwArg98, dwArgAC, dwArgBC);
}

// 23001118: void codex_debug_cli_init()
// Called from:
//      aos_loop_proc
void codex_debug_cli_init()
{
}

// 2300111C: void wifi_prov_api_event_trigger_connect(Register Eq_2 ra, Register (ptr32 Eq_446) a4, Stack Eq_2 dwArg14)
// Called from:
//      wifiprov_connect_ap_ind
void wifi_prov_api_event_trigger_connect(Eq_2 ra, struct Eq_446 * a4, Eq_2 dwArg14)
{
	int32 a0_11;
	word32 a3_69;
	word32 s0_68;
	aos_post_event(ra, 0x02, a4, dwArg14, out s0_68, out a0_11, out a3_69);
	if (a0_11 >= 0x00)
	{
		word32 a0_77;
		word32 a1_78;
		word32 a2_79;
		word32 a4_80;
		word32 a5_81;
		word32 s4_82;
		word32 s8_83;
		puts(587899000, out a0_77, out a1_78, out a2_79, out a4_80, out a5_81, out s4_82, out s8_83);
	}
	else
	{
		word32 a1_71;
		word32 a0_70;
		word32 a2_72;
		word32 a4_73;
		word32 a5_74;
		word32 s4_75;
		word32 s8_76;
		puts(0x230AA0A0, out a0_70, out a1_71, out a2_72, out a4_73, out a5_74, out s4_75, out s8_76);
	}
}

// 23001152: void wifi_prov_api_event_trigger_disconnect(Register Eq_2 ra, Register (ptr32 Eq_446) a4, Stack Eq_2 dwArg14)
// Called from:
//      wifiprov_disc_from_ap_ind
void wifi_prov_api_event_trigger_disconnect(Eq_2 ra, struct Eq_446 * a4, Eq_2 dwArg14)
{
	int32 a0_10;
	word32 a3_68;
	word32 s0_67;
	aos_post_event(ra, 0x02, a4, dwArg14, out s0_67, out a0_10, out a3_68);
	if (a0_10 >= 0x00)
	{
		word32 a0_76;
		word32 a1_77;
		word32 a2_78;
		word32 a4_79;
		word32 a5_80;
		word32 s4_81;
		word32 s8_82;
		puts(0x230AA0CC, out a0_76, out a1_77, out a2_78, out a4_79, out a5_80, out s4_81, out s8_82);
	}
	else
	{
		word32 a1_70;
		word32 a0_69;
		word32 a2_71;
		word32 a4_72;
		word32 a5_73;
		word32 s4_74;
		word32 s8_75;
		puts(587899128, out a0_69, out a1_70, out a2_71, out a4_72, out a5_73, out s4_74, out s8_75);
	}
}

