pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0000.c
// 23001188: void wifi_prov_api_event_trigger_scan(Register Eq_2 ra, Register (ptr32 Eq_446) a4, Stack Eq_2 dwArg14)
// Called from:
//      wifiprov_wifi_scan
void wifi_prov_api_event_trigger_scan(Eq_2 ra, struct Eq_446 * a4, Eq_2 dwArg14)
{
	int32 a0_11;
	word32 a3_69;
	word32 s0_68;
	aos_post_event(ra, 0x02, a4, dwArg14, out s0_68, out a0_11, out a3_69);
	if (a0_11 >= 0x00)
	{
		word32 a0_77;
		word32 a1_78;
		word32 a2_79;
		word32 a4_80;
		word32 a5_81;
		word32 s4_82;
		word32 s8_83;
		puts(587899176, out a0_77, out a1_78, out a2_79, out a4_80, out a5_81, out s4_82, out s8_83);
	}
	else
	{
		word32 a1_71;
		word32 a0_70;
		word32 a2_72;
		word32 a4_73;
		word32 a5_74;
		word32 s4_75;
		word32 s8_76;
		puts(0x230AA150, out a0_70, out a1_71, out a2_72, out a4_73, out a5_74, out s4_75, out s8_76);
	}
}

// 230011BE: void wifi_prov_api_event_state_get(Register Eq_2 ra, Register (ptr32 Eq_446) a4, Stack Eq_2 dwArg14)
// Called from:
//      wifiprov_api_state_get
void wifi_prov_api_event_state_get(Eq_2 ra, struct Eq_446 * a4, Eq_2 dwArg14)
{
	int32 a0_11;
	word32 a3_69;
	word32 s0_68;
	aos_post_event(ra, 0x02, a4, dwArg14, out s0_68, out a0_11, out a3_69);
	if (a0_11 >= 0x00)
	{
		word32 a0_77;
		word32 a1_78;
		word32 a2_79;
		word32 a4_80;
		word32 a5_81;
		word32 s4_82;
		word32 s8_83;
		puts(587899176, out a0_77, out a1_78, out a2_79, out a4_80, out a5_81, out s4_82, out s8_83);
	}
	else
	{
		word32 a1_71;
		word32 a0_70;
		word32 a2_72;
		word32 a4_73;
		word32 a5_74;
		word32 s4_75;
		word32 s8_76;
		puts(0x230AA150, out a0_70, out a1_71, out a2_72, out a4_73, out a5_74, out s4_75, out s8_76);
	}
}

// 230011F4: Register word32 assert_rec(Register Eq_2 a3, Register ptr32 mstatus, Register out ptr32 a2Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out (ptr32 Eq_5817) a5Out)
// Called from:
//      hal_machw_idle_req
//      hal_machw_gen_handler
//      hal_machw_rx_duration
//      rxl_mpdu_transfer
//      rxl_timer_int_handler
//      rxl_cntrl_evt
//      txl_payload_handle_backup
//      txl_frame_get
//      rxu_cntrl_frame_handle
//      my_pbuf_free_custom
word32 assert_rec(Eq_2 a3, ptr32 mstatus, ptr32 & a2Out, union Eq_2 & a3Out, union Eq_2 & a4Out, struct Eq_5817 & a5Out)
{
	Eq_2 a4_5 = (word32) g_b4200F324;
	if (a4_5 != 0x01)
	{
		a2Out = a2;
		a3Out = a3;
		a4Out = a4_5;
		a5Out = (struct Eq_5817 *) 0x01;
		return a0;
	}
	else
	{
		__csrrc(mstatus, 0x08);
		struct Eq_5817 * a5_9 = g_ptr420217C8;
		if (a5_9 < null)
		{
			__csrrs(mstatus, 0x08);
			a2Out = a2;
			a3Out = a3;
			a4Out = a4_5;
			a5Out = a5_9;
			return a0;
		}
		else
		{
			Eq_2 a4_15;
			Eq_2 a3_14 = hal_machw_disable_int(a3, out a4_15);
			struct Eq_5817 * a5_19;
			Eq_2 a4_18 = ke_evt_set(0x80000000, a4_15, mstatus, out a5_19);
			__csrrs(mstatus, 0x08);
			a2Out = dwArg10;
			a3Out = a3_14;
			a4Out = a4_18;
			a5Out = a5_19;
			return 0x80000000;
		}
	}
}

// 23001234: void assert_err()
// Called from:
//      ipc_emb_init
//      ipc_emb_msg_evt
//      mdm_txcbwmax_setf
//      phy_hw_set_channel
//      phy_init
//      intc_spurious
//      mac_irq
//      bl_irq_handler
//      blmac_soft_reset_getf
//      hal_machw_init
//      hal_machw_sleep_check
//      blmac_encr_cntrl_pack.constprop.8
//      hal_machw_rx_duration
//      mm_tbtt_evt
//      mm_sec_machwkey_wr
//      mm_bcn_transmit
//      mm_bcn_transmitted
//      mm_timer_schedule
//      rxl_frame_release
//      rxl_pd_append
//      txl_cfm_evt
//      blmac_abs_timer_set
//      txl_cntrl_halt_ac
//      txl_transmit_trigger
//      txl_frame_push
//      txl_frame_push_force
//      txl_frame_send_eapol_frame
//      me_mic_end
//      me_init_bcmc_rate
//      me_check_rc
//      me_beacon_check
//      me_sta_bw_nss_max_upd
//      rc_update_counters
//      rc_update_bw_nss_max
//      rc_init
//      sm_send_next_bss_param
//      txu_cntrl_cfm
//      apm_send_next_bss_param
//      apm_tx_int_ps_postpone
//      apm_bcn_set
//      co_list_push_back
//      co_list_remove
//      ke_evt_schedule
//      ke_malloc
//      ke_msg_alloc
//      ke_task_local
//      ke_handler_search
//      ke_state_get
//      ke_task_schedule
//      ke_timer_set
//      ke_timer_clear
//      add_key_to_mac
//      blmac_pwr_mgt_setf
//      chan_get_next_chan
//      chan_tbtt_insert
//      chan_upd_ctxt_status
//      chan_conn_less_delay_evt
//      chan_tx_cfm
//      chan_ctxt_op_evt
//      chan_scan_req
//      chan_ctxt_del
//      chan_bcn_detect_start
//      chan_ctxt_link
//      chan_ctxt_unlink
//      mm_cfg_rssi_req_handler
//      mm_set_ps_options_req_handler
//      mm_key_del_req_handler
//      mm_key_add_req_handler
//      mm_set_idle_req_handler
//      mm_start_req_handler
//      mm_force_idle_req_handler
//      mm_hw_config_handler
//      scan_start_req_handler
//      mm_scan_channel_end_ind_handler
//      mm_scan_channel_start_ind_handler
//      me_extract_rate_set
//      me_rc_set_rate_req_handler
//      mm_set_ps_mode_cfm_handler
//      mm_set_idle_cfm_handler
//      scanu_join_req_handler
//      me_set_ps_disable_cfm_handler
//      mm_bss_param_setting_handler
//      scanu_start_cfm_handler
//      scanu_join_cfm_handler
//      sm_connect_req_handler
//      me_set_active_cfm_handler
//      mm_sta_add_cfm_handler
//      me_set_ps_disable_cfm_handler
//      mm_bss_param_setting_handler
//      mm_bcn_change_cfm_handler
//      apm_start_req_handler
//      me_set_active_cfm_handler
//      dbg_test_print
void assert_err()
{
	while (true)
		;
}

// 23001236: void assert_warn()
// Called from:
//      me_legacy_rate_bitfield_build
//      rxu_mpdu_upload_and_indicate.constprop.11
//      rxu_mgt_frame_check
//      sm_auth_handler
//      apm_tx_int_ps_get_postpone
//      chan_cde_evt
//      bam_send_air_action_frame
void assert_warn()
{
}

// 23001238: void coex_dump_pta()
// Called from:
//      cmd_coex_dump
void coex_dump_pta()
{
}

