pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0000.c
// 23001240: void coex_dump_wifi()
// Called from:
//      cmd_coex_dump
void coex_dump_wifi()
{
}

// 23001252: void coex_wifi_rf_forece_enable(Register word32 a0)
// Called from:
//      cmd_wifi_coex_rf_force_off
//      cmd_wifi_coex_rf_force_on
void coex_wifi_rf_forece_enable(word32 a0)
{
	rfc_coex_force_to(a0, a1, a5);
}

// 2300125C: void coex_wifi_pti_forece_enable(Register word32 a0)
// Called from:
//      cmd_wifi_coex_pti_force_off
//      cmd_wifi_coex_pti_force_on
void coex_wifi_pti_forece_enable(word32 a0)
{
	int32 a4_12;
	int32 a4_5 = *(int32 *) 0x44B00400;
	if (a0 != 0x00)
	{
		*(int32 *) 0x44B00400 = a4_5 | 0xF0000000;
		a4_12 = *(int32 *) 0x44B00400 | 16;
	}
	else
		a4_12 = a4_5 & ~0x10;
	int32 a4_23;
	*(int32 *) 0x44B00400 = a4_12;
	if (*(int32 *) 0x44B00400 << 0x04 < 0x00)
		a4_23 = *(int32 *) 0x44B00400 & ~0x04000000;
	else
		a4_23 = *(int32 *) 0x44B00400 & ~0x04000000 | 0x04000000;
	*(int32 *) 0x44B00400 = a4_23;
}

// 230012AE: Register word32 coex_wifi_pta_forece_enable(Register Eq_2 a0, Register (ptr32 word32) a3, Register ptr32 mstatus, Register out (ptr32 Eq_5914) s0Out, Register out Eq_2 a0Out, Register out ptr32 a2Out, Register out (ptr32 word32) a3Out, Register out Eq_2 s2Out, Register out (ptr32 Eq_5919) s3Out, Register out ptr32 mstatusOut)
// Called from:
//      wifi_main
//      cmd_wifi_coex_pta_force_off
//      cmd_wifi_coex_pta_force_on
word32 coex_wifi_pta_forece_enable(Eq_2 a0, word32 * a3, ptr32 mstatus, struct Eq_5914 & s0Out, union Eq_2 & a0Out, ptr32 & a2Out, word32 & a3Out, union Eq_2 & s2Out, struct Eq_5919 & s3Out, ptr32 & mstatusOut)
{
	Eq_2 a5_7 = g_t4200EAF4;
	if (a5_7 != a0)
	{
		union Eq_2 * s1_20 = &g_t4200EAF4;
		s2 = a0;
		word32 s0_101 = 0x4200F274;
		if (a5_7 == 0x00)
		{
			word32 * a5_89;
			Eq_2 a0_88 = xTaskGetTickCount(out a5_89);
			s0_101 = *a3;
			Mem95[a5_89 - a3 + a0_88:word32] = Mem17[a5_89 + 0x00:word32];
		}
		else if (a5_7 == 0x01)
		{
			word32 * a5_25;
			Eq_2 a0_24 = xTaskGetTickCount(out a5_25);
			s0_101 = *a3;
			*((word32) a0_24 + (a5_25 - a3)) = *a5_25;
			__csrrc(mstatus, 0x08);
			bl_nap_calculate();
			__csrrs(mstatus, 0x08);
			s3 = (struct Eq_5919 *) 1000;
			if (a0_24 > 1000)
			{
				word32 sp_37;
				word32 a5_39;
				word32 s3_43;
				word32 s4_44;
				word32 a4_46;
				word32 a3_47;
				word32 a2_51;
				word32 mstatus_52;
				word32 a1_119;
				word32 tp_120;
				g_t4200C4E8();
				word32 a0_54;
				word32 a3_57;
				word32 s1_62;
				word32 s2_63;
				word32 s3_64;
				word32 s4_65;
				word32 a4_79;
				g_t4200C4F2();
			}
		}
		*s1_20 = (union Eq_2 *) s2;
		word32 a5_165;
		a0 = xTaskGetTickCount(out a5_165);
		*a0 = s0_101;
	}
	s0Out = s1;
	a0Out = a0;
	a2Out = dwArg48;
	a3Out = a3;
	s2Out = s2;
	s3Out = s3;
	mstatusOut = mstatus;
	return ra;
}

// 23001354: void wifi_main(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 s2, Register (ptr32 Eq_326) s3, Register Eq_2 s6, Register Eq_2 s7, Register ptr32 fflags, Register ptr32 frm, Register ptr32 mstatus, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg7C, Stack word32 dwArg88, Stack word32 dwArgC8, Stack Eq_2 dwArgD8, Stack word32 dwArgE8, Stack word32 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0158)
void wifi_main(Eq_2 ra, Eq_2 s1, Eq_2 s2, struct Eq_326 * s3, Eq_2 s6, Eq_2 s7, ptr32 fflags, ptr32 frm, ptr32 mstatus, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg5C, Eq_2 dwArg7C, word32 dwArg88, word32 dwArgC8, Eq_2 dwArgD8, word32 dwArgE8, word32 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148, Eq_2 dwArg0158)
{
	struct Eq_6042 * s0_41;
	word32 s2_354;
	word32 s1_352;
	word32 a4_353;
	Eq_2 ra_40 = rfc_init(0x44B00000, s1, 40000000, s2, s3, s6, s7, fflags, frm, dwLoc08, dwLoc04, dwArg04, dwArg08, dwArg38, dwArg44, s3, s1, out s0_41, out s1_352, out a4_353, out s2_354);
	s0_41->dw0400 |= 1;
	mpif_clk_init();
	sysctrl_init();
	intc_init();
	struct Eq_6096 * s0_92;
	struct Eq_6097 * s2_129;
	struct Eq_6098 * s3_141;
	Eq_2 a3_148;
	Eq_2 a2_150;
	Eq_2 a0_153;
	word32 ra_211 = bl_init(ipc_emb_init(ra_40), mstatus, s2, dwLoc10, dwLoc0C, dwLoc08, dwArg08, dwArg10, dwArg14, dwArg18, dwArg20, dwArg24, dwArg30, dwArg34, dwArg38, dwArg3C, dwArg48, dwArg58, dwArg5C, ra, dwArg7C, dwArgC8, dwArgD8, dwArgE8, dwArg0108, dwArg0118, dwArg0128, dwArg0138, dwArg0148, dwArg0158, out s0_92, out a0_153, out a2_150, out a3_148, out s2_129, out s3_141);
	s0_92->dw0404 = 0x0024F037;
	s0_92->dw0400 = 0x01;
	s0_92->dw0400 = 0x00;
	s0_92->dw0400 = 0x0069;
	s0_92->dw0400 &= -33;
	*(word32 *) 0x50100023 = 0x44920000;
	struct Eq_6181 * s0_125 = (struct Eq_6181 *) 0x44900000;
	struct Eq_6183 * s5_126 = (struct Eq_6183 *) 0x40007000;
	ui32 s6_128 = 0x005C2000;
	while (true)
	{
		ui32 a5_135;
		Eq_2 a5_131 = s2_129->t0120;
		ui32 a5_134 = s0_125->dw0084;
		if (a5_131 << 0x0C < 0x00)
			a5_135 = a5_134 | 1;
		else
			a5_135 = a5_134 & ~0x01;
		s0_125->dw0084 = a5_135;
		Eq_2 a5_143 = s3_141->t07C8;
		if (a5_143 == 0x00)
			a0_153 = ipc_emb_wait(a2_150, a3_148, a5_131 << 0x0C, a5_143, mstatus, s2, dwArgF8, out a5_143);
		*((word32) a5_143 + 1) = *a5_143;
		if ((a5_143 & 0x0F) == 0x00)
		{
			Eq_6245 a5_174 = s5_126->t0018;
			ui32 a4_176 = a5_174 >> 24 & 7;
			if (a4_176 != 0x00)
			{
				if (a4_176 != 0x03)
					*(union Eq_2 *) 0x00040017 = *(union Eq_2 *) 0x17;
				if (a4_176 != 0x00 && a4_176 != 0x03)
				{
					*(union Eq_2 *) 64 = *(union Eq_2 *) 0x43;
					*(struct Eq_6298 **) 0x0044 = *(struct Eq_6298 **) 0x0044;
				}
			}
			struct Eq_6256 * a5_193 = a5_174 >> 24 & 0x04;
			if (a5_193 != null)
			{
				(a5_193 | s6_128)->dw0014 = a5_193->dw0014;
				*(ui32 *) 0x4001090C = *(int32 *) 0x4000F90C & ~0x01 | 4;
			}
		}
		Eq_2 a0_255;
		s5_126 = ke_evt_schedule(ra_211, a0_153, dwArg88, out s6_128);
		word32 * a3_249;
		if (bl_sleep(dwArg08, out a3_249) != 0x00)
			a0_255.u0 = 0x00;
		else
			a0_255.u0 = 0x01;
		ra_211 = coex_wifi_pta_forece_enable(a0_255, a3_249, mstatus, out s0_125, out a0_153, out a2_150, out a3_148, out s2_129, out s3_141, out mstatus);
	}
}

// 23001482: void ipc_emb_notify(Register Eq_2 ra, Register Eq_2 a0, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArg38, Stack Eq_2 dwArgC4, Stack Eq_2 dwArgE0, Stack Eq_2 dwArgE4, Stack Eq_2 dwArg0108)
// Called from:
//      mac_irq
//      bl_irq_handler
void ipc_emb_notify(Eq_2 ra, Eq_2 a0, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArg38, Eq_2 dwArgC4, Eq_2 dwArgE0, Eq_2 dwArgE4, Eq_2 dwArg0108)
{
	Eq_2 a4_5 = g_t4200F278;
	if (a4_5 != 0x00)
	{
		Eq_2 a5_18 = g_t4200F560;
		if (a5_18 != 0x00)
		{
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			Eq_2 stackArg56 = <invalid>;
			vTaskNotifyGiveFromISR(a0, a1, a2, a4, mstatus, stackArg56);
			if (a5_18 != 0x00)
			{
				word32 a0_85;
				word32 a4_86;
				word32 a5_87;
				vTaskSwitchContext(a3, mstatus, out a0_85, out a4_86, out a5_87);
			}
		}
		else
		{
			word32 s0_88;
			word32 s1_89;
			word32 a0_90;
			word32 a1_91;
			word32 a2_92;
			word32 a3_93;
			word32 a4_94;
			word32 a5_95;
			word32 s2_96;
			word32 s3_97;
			word32 s4_98;
			word32 mstatus_99;
			xTaskGenericNotify(ra, a0, 0x00, 0x02, 0x00, a4_5, mstatus, dwLoc0C, dwArg18, dwArg38, dwArgC4, dwArgE0, dwArgE4, dwArg0108, out s0_88, out s1_89, out a0_90, out a1_91, out a2_92, out a3_93, out a4_94, out a5_95, out s2_96, out s3_97, out s4_98, out mstatus_99);
		}
	}
	else
		assert_err();
}

// 230014DA: Register word32 ipc_emb_wait(Register Eq_2 a2, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack word32 dwArg0118, Register out (ptr32 Eq_6213) a5Out)
// Called from:
//      wifi_main
word32 ipc_emb_wait(Eq_2 a2, Eq_2 a3, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg08, word32 dwArg0118, struct Eq_6213 & a5Out)
{
	word32 a2_34;
	word32 a3_35;
	word32 a4_36;
	word32 s2_37;
	word32 s3_38;
	ulTaskNotifyTake((struct Eq_6434 *) 0x01, ~0x00, a2, a3, a4, a5, mstatus, dwArg08, dwArg0118, out a2_34, out a3_35, out a4_36, out s2_37, out s3_38);
	int32 a5_24 = g_dw4201E94C;
	g_dw4201F94C = a5_24 + 0x01;
	a5Out = a5_24 + 0x01;
	return 0x01;
}

