pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0000.c
// 230014FA: Register Eq_2 ipc_emb_init(Register Eq_2 ra)
// Called from:
//      wifi_main
Eq_2 ipc_emb_init(Eq_2 ra)
{
	word32 a5_110;
	g_t4200F278 = xTaskGetCurrentTaskHandle(out a5_110);
	word32 t1_111;
	word32 a0_112;
	word32 a1_113;
	word32 a2_114;
	word32 a3_115;
	word32 a4_116;
	word32 a5_117;
	Eq_2 ra_22 = memset(ra, 1107421520, 0x00, 32, out t1_111, out a0_112, out a1_113, out a2_114, out a3_115, out a4_116, out a5_117);
	g_dw42040220 = 1107421520;
	if (*(int32 *) 0x44800140 == 0x49504332)
	{
		*(int32 *) 0x44800114 = 0x00;
		*(word32 *) 0x44800118 = 0x00;
		*(int32 *) 0x44800114 &= ~0x03;
		*(int32 *) 0x44800114 = *(int32 *) 0x44800114 & ~0x0C | 4;
		*(int32 *) 0x44800114 = *(int32 *) 0x44800114 & -769 | 0x0200;
		*(int32 *) 0x44800114 = *(int32 *) 0x44800114 & ~0x00FFFC00 | 0x00FFF800;
		*(int32 *) 0x44800114 = *(int32 *) 0x44800114 & ~0x03000000 | 0x02000000;
		*(int32 *) 0x44800114 = *(int32 *) 0x44800114 & ~0x00030000 | 0x00030000;
		*(int32 *) 0x44800114 = *(int32 *) 0x44800114 & ~0x000C0000 | 0x000C0000;
		*(int32 *) 0x44800114 = *(int32 *) 0x44800114 & ~0x00300000 | 0x00300000;
		*(int32 *) 0x44800114 = *(int32 *) 0x44800114 & ~0x00C00000 | 0x00C00000;
		*(int32 *) 0x44800114 = *(int32 *) 0x44800114 & ~0x03000000 | 0x03000000;
		*(int32 *) 0x4480010C = 0x01FFFF03;
		return ra_22;
	}
	else
		assert_err();
}

// 23001632: void ipc_emb_tx_irq(Register Eq_2 a4, Register ptr32 mstatus)
void ipc_emb_tx_irq(Eq_2 a4, ptr32 mstatus)
{
	int32 s0_11 = *(int32 *) 0x4480011C;
	if ((s0_11 & 0x01FFFF00) != 0x00)
	{
		word32 a5_41;
		ke_evt_set((s0_11 & 0x01FFFF00) >> 0x01, a4, mstatus, out a5_41);
		*(int32 *) 0x44800110 = s0_11 & 0x01FFFF00;
		*(int32 *) 0x44800108 = s0_11 & 0x01FFFF00;
	}
}

// 23001666: void ipc_emb_tx_evt(Register Eq_2 ra, Register ui32 a0, Register Eq_2 a4, Register ptr32 fflags, Register ptr32 frm, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArg38, Stack Eq_2 dwArg3C, Stack Eq_2 dwArg68, Stack Eq_2 dwArg9C, Stack word32 dwArgAC, Stack word32 dwArgF8, Stack word32 dwArg0128, Stack word32 dwArg0138)
void ipc_emb_tx_evt(Eq_2 ra, ui32 a0, Eq_2 a4, ptr32 fflags, ptr32 frm, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArg38, Eq_2 dwArg3C, Eq_2 dwArg68, Eq_2 dwArg9C, word32 dwArgAC, word32 dwArgF8, word32 dwArg0128, word32 dwArg0138)
{
	Eq_5849 s2_11 = *((char *) g_a230AA17C + a0 * 0x04);
	ke_evt_clear(s2_11, a4, mstatus);
	int32 s5_138 = ~0x00;
	ui32 s1_127 = s2_11 & 0x00FFF800;
	Eq_2 s6_139 = 0x42021000;
	ui32 s3_128 = 0x00440800;
	struct Eq_6646 * s7_140 = (struct Eq_6646 *) 0x44800000;
	while (true)
	{
		struct Eq_6667 * s0_55 = *(struct Eq_6667 **) 0x0330;
		if (s5_138 != 0x0330)
			break;
		if (s1_127 == 0x00 && (*((word32) s6_139 + 1992) & s3_128) != 0x00)
		{
			0x00 = dwArg0128;
			word32 a5_343;
			ke_evt_set(s2_11, a4, mstatus, out a5_343);
			return;
		}
		s7_140->dw0108 = 0x0100;
		struct Eq_6658 * a4_78;
		word32 t1_337;
		word32 a0_338;
		word32 a1_339;
		word32 a2_340;
		word32 a3_341;
		word32 a5_342;
		Eq_2 ra_80 = memset(ra, (char *) s0_55 + 84, 0x00, 0x02CC, out t1_337, out a0_338, out a1_339, out a2_340, out a3_341, out a4_78, out a5_342);
		s0_55->dw00C4 = &s0_55->dw00F8 + 5;
		s0_55->ptr00C0 = &s0_55->dw00C4;
		do
		{
			word32 a5_90 = a4_78->dw0000;
			a4_78->dw0050 = a5_90 + 0x04;
		} while ((char *) s0_55 + 84 != a5_90 + 0x04);
		word32 * a5_95 = s0_55->ptr00C0;
		s0_55->dw00B8 = 0x00;
		*a5_95 + 16 = 0x00;
		s0_55->dw00F0 = 0x00;
		s0_55->dw00F4 = 0x00;
		s0_55->dw00F8 = 0x00;
		s0_55->dw00A8 = 0x00;
		Eq_2 s0_126;
		struct Eq_6745 * s8_141;
		ra = txu_cntrl_push(ra_80, s0_55, (char *) s0_55 + 84, 0x00, s6_139, fflags, frm, mstatus, dwLoc30, dwLoc10, dwLoc0C, dwLoc08, dwArg18, dwArg38, dwArg3C, dwArg68, dwArg9C, dwArgAC, dwArgF8, dwArg0138, out s0_126, out s1_127, out a4, out s2_11, out s3_128, out s5_138, out s6_139, out s7_140, out s8_141);
		*(union Eq_2 *) 0x01 = s0_126;
		++s8_141->dw0018;
	}
	*(int32 *) 0x4480010C = 0x0100;
	0x00 = dwArg0128;
}

// 2300179E: void ipc_emb_cfmback_irq(Register ptr32 mstatus)
void ipc_emb_cfmback_irq(ptr32 mstatus)
{
	int32 s0_9 = *(int32 *) 0x4480011C;
	if ((s0_9 & 32) != 0x00)
	{
		*(int32 *) 0x44800110 = 32;
		*(int32 *) 0x44800108 = 32;
		word32 a5_51;
		ke_evt_set(0x00040000, 32, mstatus, out a5_51);
	}
	if ((s0_9 & 0x10) == 0x00)
		return;
	*(int32 *) 0x44800110 = 0x10;
	*(int32 *) 0x44800108 = 0x10;
	word32 a5_52;
	ke_evt_set(0x00080000, 0x10, mstatus, out a5_52);
}

// 230017EE: Register word32 ipc_emb_txcfm_ind(Register Eq_6844 a0)
// Called from:
//      txl_cfm_evt
//      txl_cfm_flush
word32 ipc_emb_txcfm_ind(Eq_6844 a0)
{
	*(ui32 *) 0x44800100 = a0 << 7;
	return 0x44800000;
}

// 230017FA: void ipc_emb_msg_irq(Register Eq_2 a4, Register ptr32 mstatus)
void ipc_emb_msg_irq(Eq_2 a4, ptr32 mstatus)
{
	if ((*(int32 *) 0x4480011C & 0x02) != 0x00)
	{
		word32 a5_32;
		ke_evt_set(0x02000000, a4, mstatus, out a5_32);
		*(int32 *) 0x44800110 = 0x02;
	}
}

// 23001822: void ipc_emb_msg_evt(Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack word32 dwArg0128)
void ipc_emb_msg_evt(Eq_2 a3, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg08, word32 dwArg0128)
{
	int32 a5_114 = *(int32 *) 0x44800104;
	struct Eq_6874 * s1_106 = &g_t42040000;
	while ((a5_114 & 0x02) != 0x00)
	{
		*(int32 *) 0x44800108 = 0x02;
		struct Eq_6879 * a0_43;
		struct Eq_6880 * s2_47;
		word32 a5_177;
		Eq_2 s1_46 = ke_malloc((word32) s1_106->t000A + 0x0C, a3, 0x02, mstatus, dwArg08, out a0_43, out a5_177, out s2_47);
		if (a0_43 == null)
			assert_err();
		a0_43->dw0000 = 0x00;
		a0_43->w0004 = (word16) (word32) *((word32) s1_46 + 4);
		a0_43->w0006 = (word16) (word32) *((word32) s1_46 + 6);
		a0_43->w0008 = 0x0D;
		a0_43->w000A = (word16) (word32) *((word32) s1_46 + 0x0A);
		int32 a5_64 = 0x0C;
		while (true)
		{
			ptr32 * a3_67 = (word32) a0_43->w000A;
			if (a5_64 + -0x0C >= a3_67)
				break;
			*a3_67 = a0_43 + a5_64 / 0x0C;
			a5_64 += 0x04;
		}
		word32 a5_75 = (word32) s2_47->b0015;
		s2_47->b0015 = (byte) (a5_75 + 1);
		*((word32) s1_46 + 8) = (word16) a5_75;
		up32 a5_80 = (word32) a0_43->w0006;
		if (a5_80 > 0x0E)
			assert_err();
		if (a5_80 > 0x0C)
			assert_err();
		*(ui32 *) 0x44800100 = 0x04;
		word32 s8_185;
		word32 s3_183;
		word32 s4_184;
		word32 a5_181;
		word32 s2_182;
		word32 a1_179;
		word32 a2_180;
		word32 a0_178;
		ke_msg_send(&a0_43->w000A + 1, mstatus, out s1_106, out a0_178, out a1_179, out a2_180, out a3, out a4, out a5_181, out s2_182, out s3_183, out s4_184, out s8_185);
		a5_114 = *(int32 *) 0x44800104;
	}
	ke_evt_clear(0x02000000, a4, mstatus);
	*(int32 *) 0x4480010C = 0x02;
	0x00 = dwArg0128;
}

// 2300194C: void ipc_emb_msg_dma_int_handler()
void ipc_emb_msg_dma_int_handler()
{
}

// 2300194E: void ipc_emb_dbg_dma_int_handler()
void ipc_emb_dbg_dma_int_handler()
{
	*(word32 *) 0xA0 = 0x44A00000;
	*(ui32 *) 0x44800100 = 0x01;
}

// 23001964: void ipc_emb_dump()
// Called from:
//      bl60x_fw_dump_statistic
void ipc_emb_dump()
{
}

