pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0000.c
// 23001966: Register word32 mdm_txcbwmax_setf(Register (ptr32 Eq_7044) a0)
// Called from:
//      phy_hw_set_channel
//      phy_init
word32 mdm_txcbwmax_setf(struct Eq_7044 * a0)
{
	if ((a0 << 0x18 & 0xFC000000) == 0x00)
	{
		*(int32 *) 0x44C01824 = *(int32 *) 0x44C00824 & ~0x03000000 | a0 << 0x18;
		return ~0x03000000;
	}
	else
		assert_err();
}

// 230019B0: Register int32 phy_config_rxgain(Register (ptr32 Eq_7063) a0)
// Called from:
//      agc_config
//      phy_tcal_callback
int32 phy_config_rxgain(struct Eq_7063 * a0)
{
	int32 a4_4 = 0x4200EAFC;
	if ((int32) g_b4200EAFC != a0)
	{
		int32 a0_9 = (int32) (byte) a0;
		g_b4200EAFC = (byte) a0_9;
		*(int32 *) 0x44C0C080 = a0_9 + 0x03 & 0x00FF | *((int32 *) 0x44C0C080) & -0x0100;
		*(int32 *) 0x44C0C080 = (int32) g_b4200EAFC + 11 << 8 & 0x0FFFFFFF | *((int32 *) 0x44C0C080) & 0xF00000FF;
		*(int32 *) 0x44C0C080 = (int32) g_b4200EAFC + 0x12 << 16 & 0x00FF0000 | *((int32 *) 0x44C0C080) & ~0x00FF0000;
		*(int32 *) 0x44C0C080 = (int32) g_b4200EAFC + 0x19 << 24 | *((int32 *) 0x44C0C080) & 0x00FFFFFF;
		*(int32 *) 0x44C0C084 = (int32) g_b4200EAFC + 32 & 0x00FF | *((int32 *) 0x44C0C084) & -0x0100;
		*(int32 *) 0x44C0C084 = (int32) g_b4200EAFC + 39 << 8 & 0x0FFFFFFF | *((int32 *) 0x44C0C084) & 0xF00000FF;
		*(int32 *) 0x44C0C084 = (int32) g_b4200EAFC + 45 << 16 & 0x00FF0000 | *((int32 *) 0x44C0C084) & ~0x00FF0000;
		*(int32 *) 0x44C0C084 = (int32) g_b4200EAFC + 53 << 24 | *((int32 *) 0x44C0C084) & 0x00FFFFFF;
		a4_4 = (int32) g_b4200EAFC + 59 & 0x00FF | *((int32 *) 0x44C0C088) & -0x0100;
		*(int32 *) 0x44C0C088 = a4_4;
	}
	return a4_4;
}

// 23001ACE: Register word32 agc_config(Register out ptr32 a2Out, Register out Eq_7209 s2Out, Register out ptr32 s3Out)
// Called from:
//      phy_init
word32 agc_config(ptr32 & a2Out, union Eq_7209 & s2Out, ptr32 & s3Out)
{
	*(int32 *) 0x44C0B390 &= ~0x10000000;
	*(int32 *) 0x44C0B390 &= -0x0401;
	*(int32 *) 0x44C0B3A4 &= -0x0100;
	*(int32 *) 0x44C0B3A4 &= 0xF00000FF;
	*(int32 *) 0x44C0B394 = *(int32 *) 0x44C0B394 & ~0x00FF0000 | 0x00F80000;
	*(int32 *) 0x44C0B398 = *(int32 *) 0x44C0B398 & 0xF00000FF | 0x09FFFE00;
	*(int32 *) 0x44C0B3C4 = *(int32 *) 0x44C0B3C4 & -0x0100 | 0x00CE;
	*(int32 *) 0x44C0B364 = *(int32 *) 0x44C0B364 & ~0x1F000000 | 0x08000000;
	*(int32 *) 0x44C0B364 = *(int32 *) 0x44C0B364 & ~0x003F0000 | 0x003C0000;
	*(int32 *) 0x44C0B364 = *(int32 *) 0x44C0B364 & 0xFC0000FF | 0x03FFF800;
	*(int32 *) 0x44C0B364 = *(int32 *) 0x44C0B364 & -64 | 57;
	*(int32 *) 0x44C0B368 = *(int32 *) 0x44C0B368 & ~0x003FF000 | 0x00070000;
	*(int32 *) 0x44C0B368 = *(int32 *) 0x44C0B368 & -0x0400 | 112;
	*(int32 *) 0x44C0B36C = *(int32 *) 0x44C0B36C & -0x0100 | 18;
	*(int32 *) 0x44C0B36C = *(int32 *) 0x44C0B36C & -0x0701 | 0x0500;
	*(int32 *) 0x44C0B36C = *(int32 *) 0x44C0B36C & ~0x00FF0000 | 0x00280000;
	*(int32 *) 0x44C0B36C = *(int32 *) 0x44C0B36C & ~0x07000000 | 0x07000000;
	*(int32 *) 0x44C0B370 = *(int32 *) 0x44C0B370 & ~0x007F0000 | 0x00580000;
	*(union Eq_7209 *) 0x44C0B3C0 = (word32) *(union Eq_7209 *) 0x44C0B3C0 | 0x18000000;
	*(int32 *) 0x44C0B380 = *(int32 *) 0x44C0B380 & ~0x000FC000 | 0x000F8000;
	*(int32 *) 0x44C0B380 = *(int32 *) 0x44C0B380 & ~0x03F00000 | 0x03700000;
	*(int32 *) 0x44C0B380 = *(int32 *) 0x44C0B380 & 0x03FFFFFF | 0x04000000;
	*(int32 *) 0x44C0B380 &= ~0x02000000;
	*(int32 *) 0x44C0B380 = *(int32 *) 0x44C0B380 & ~0x01FFFC00 | 0x0400;
	*(int32 *) 0x44C0B384 = *(int32 *) 0x44C0B384 & 0x03FFFFFF | 0xE4000000;
	*(int32 *) 0x44C0B384 = *(int32 *) 0x44C0B384 & ~0x03F00000 | 0x03700000;
	*(int32 *) 0x44C0B384 = *(int32 *) 0x44C0B384 & ~0x000FC000 | 0x00050000;
	*(int32 *) 0x44C0B384 &= ~0x02000000;
	*(int32 *) 0x44C0B384 = *(int32 *) 0x44C0B384 & ~0x01FFFC00 | 0x00FFF800;
	*(int32 *) 0x44C0B388 = *(int32 *) 0x44C0B388 & 0x03FFFFFF | 0x3C000000;
	*(int32 *) 0x44C0B388 = *(int32 *) 0x44C0B388 & ~0x03F00000 | 0x01700000;
	*(int32 *) 0x44C0B388 = *(int32 *) 0x44C0B388 & ~0x000FC000 | 0x000A8000;
	*(int32 *) 0x44C0B388 &= ~0x02000000;
	*(int32 *) 0x44C0B388 = *(int32 *) 0x44C0B388 & ~0x01FFFC00 | 0x01000400;
	*(int32 *) 0x44C0B38C = *(int32 *) 0x44C0B38C & 0x03FFFFFF | 0x64000000;
	*(int32 *) 0x44C0B38C &= ~0x03F00000;
	*(int32 *) 0x44C0B38C = *(int32 *) 0x44C0B38C & ~0x000FC000 | 0x00038000;
	*(int32 *) 0x44C0B38C = *(int32 *) 0x44C0B38C & ~0x01FFFC00 | 0x00FFF800;
	*(ui32 *) 0x44C0D830 = *(struct Eq_7499 **) 0x44C0C830 & 0x03FFFFFF | 0xFC000000;
	*(ui32 *) 0x44C0D830 = *(struct Eq_7499 **) 0x44C0C830 & ~0x03F00000 | 0x00100000;
	*(ui32 *) 0x44C0D830 = *(struct Eq_7499 **) 0x44C0C830 & ~0x000FC000 | 0x000D8000;
	struct Eq_7499 * a4_230 = *(struct Eq_7499 **) 0x44C0C830;
	*(ui32 *) 0x44C0D830 = a4_230 & ~0x01FFFC00 | 0x01000400;
	*(ui32 *) 0x44C0D814 = *(int32 *) 0x44C0C814 & ~0x03;
	*(ui32 *) 0x44C0D814 = *(int32 *) 0x44C0C814 & -61 | 8;
	*(ui32 *) 0x44C0D814 = *(int32 *) 0x44C0C814 & -61 | 8;
	struct Eq_7553 * a4_250 = a4_230 & ~0x01F00000 | 0x00C00000;
	a4_250->dw0040 = a4_230->dw0040;
	struct Eq_7564 * a4_257 = a4_250 & ~0x000F8000 | 0x18000000;
	a4_257->dw0040 = a4_250->dw0040;
	struct Eq_7575 * a4_261 = a4_257 & 0xF00000FF | 0x00FFF800;
	a4_261->dw0044 = a4_257->dw0044;
	(a4_261 & -0x0100)->dw0044 = a4_261->dw0044;
	phy_config_rxgain(null);
	*(int32 *) 0x44C0B3A0 = *(int32 *) 0x44C0B3A0 & -0x0100 | 0x009E;
	*(union Eq_7209 *) 0x44C0B3C0 = *(union Eq_7209 *) 0x44C0B3C0 & -0x0100 | 0x00A4;
	Eq_7209 s2_288 = *(union Eq_7209 *) 0x44C0B3C0 & 0xF00000FF | 0x0A000300;
	*(union Eq_7209 *) 0x44C0B3C0 = s2_288;
	*(ui32 *) 0x44C0D82C = *(int32 *) 1153484844 & -0x0100 | 181;
	*(ui32 *) 0x44C0D82C = *(int32 *) 1153484844 | 0x0100;
	*(ui32 *) 0x44C0D82C = *(int32 *) 1153484844 & ~0x00FFF800 | 0x00FFF800;
	*(ui32 *) 0x44C0D838 = *(int32 *) 0x44C0C838 & 0x7FFFFFFF | 0x80000000;
	*(ui32 *) 0x44C0D838 = *(int32 *) 0x44C0C838 & 0xFFF80000 | 0x0100;
	*(ui32 *) 0x44C0D83C = *(int32 *) 0x44C0C83C & 0x7FFFFFFF | 0x80000000;
	*(ui32 *) 0x44C0D83C = *(int32 *) 0x44C0C83C & 0xFFF00000 | 380;
	*(ui32 *) 0x44C0D840 = *(int32 *) 0x44C0C840 & 0x7FFFFFFF | 0x80000000;
	*(ui32 *) 0x44C0D840 = *(int32 *) 0x44C0C840 & 0xFFC00000 | 0x0100;
	*(ui32 *) 0x44C0D82C = *(int32 *) 1153484844 & ~0x00FF8000 | 0x00200000;
	a2Out = dwArg48;
	s2Out = s2_288;
	s3Out = 0x00FFF800;
	return s1;
}

// 23001F12: void mdm_reset()
// Called from:
//      phy_hw_set_channel
//      phy_init
//      phy_rc_isr
void mdm_reset()
{
	*(word32 *) 0x44C01888 = 0x01000111;
	*(word32 *) 0x44C01888 = 0x00;
}

// 23001F26: void phy_powroffset_set(Register ptr32 a0)
// Called from:
//      hal_board_cfg
void phy_powroffset_set(ptr32 a0)
{
	struct Eq_7711 * a5_14 = null;
	do
	{
		a5_14[0x42011878] = (struct Eq_7711) (byte) (int32) a5_14[a0];
		++a5_14;
	} while (a5_14 != (struct Eq_7711 *) 0x0E);
}

// 23001F4A: Register Eq_2 phy_hw_set_channel(Register Eq_2 ra, Register up32 a0, Register Eq_7726 a2, Register (ptr32 Eq_7044) a3, Register (ptr32 Eq_7044) s3, Register ptr32 fflags, Register ptr32 frm, Stack Eq_2 dwArg24, Stack Eq_2 dwArg44, Stack (ptr32 Eq_7733) dwArg84, Stack word32 dwArg0178, Register out ptr32 s0Out, Register out ptr32 s1Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 fflagsOut, Register out ptr32 frmOut)
// Called from:
//      phy_set_channel
Eq_2 phy_hw_set_channel(Eq_2 ra, up32 a0, Eq_7726 a2, struct Eq_7044 * a3, struct Eq_7044 * s3, ptr32 fflags, ptr32 frm, Eq_2 dwArg24, Eq_2 dwArg44, struct Eq_7733 * dwArg84, word32 dwArg0178, ptr32 & s0Out, ptr32 & s1Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & fflagsOut, ptr32 & frmOut)
{
	if (a3 != null)
		assert_err();
	if (a0 != 0x00)
		assert_err();
	*(int32 *) 0x44C0B390 &= -0x0101;
	*(struct Eq_7756 **) 0x44C01820 = *(int32 *) 0x44C00820 | 1;
	*(word32 *) 0x44C01800 = 0x00;
	mdm_reset();
	*(int32 *) 0x44C01838 = 0x00B4;
	*(word32 *) 0x44C0188C = 0x01FFFC13;
	*(word32 *) 0x44C01898 = 47187000;
	*(ui32 *) 0x44C01858 = *(int32 *) 0x44C00858 & -0x0100;
	*(ui32 *) 0x44C0181C = 0x00FFFF0F;
	*(ui32 *) 0x44C0181C = *(int32 *) 0x44C0081C & -0x0080 | 7;
	*(ui32 *) 0x44C01834 = (word32) *(union Eq_7792 *) 0x44C00834 | 0x06000000;
	*(ui32 *) 0x44C01818 = 0x01880C06;
	*(word32 *) 0x44C01860 = 0x07FFFF03;
	*(word32 *) 0x44C0B340 = 0x00;
	*(word32 *) 0x44C0B344 = 0x00;
	*(word32 *) 0x44C0B348 = 0x00;
	mdm_txcbwmax_setf(a3);
	if (*(int32 *) 0x44C0B000 << 0x0A < 0x00)
		*(word32 *) 0x44C0B118 = 0x01;
	ui32 a0_128;
	word32 a0_135;
	ptr32 fflags_107;
	ptr32 frm_108;
	word32 s1_111;
	word32 s4_114;
	Eq_2 ra_109 = rf_set_channel(ra, a2, 0x44C0B000, fflags, frm, out s1_111, out s4_114, out fflags_107, out frm_108);
	if (s4_114 == 0x00)
	{
		a0_128 = 0x00;
		if ((word32) (word16) (s1_111 + 0xFF000694) > 72)
			goto l23002088;
		a0_128 = 0x0E;
		if (s1_111 == 0x00FFF9B4)
		{
l23002088:
			ptr32 s2_173;
			ptr32 s3_174;
			ptr32 s1_171 = rfc_apply_tx_power_offset(a0_128 & 0x00FF, 0x42011878, dwArg24, dwArg44, s3, dwArg84, dwArg0178, out s2_173, out s3_174);
			int32 a0_195 = (int32) (byte) s3_174;
			trpc_update_vs_channel(a0_195);
			s0Out = s1;
			s1Out = s1_171;
			s2Out = s2_173;
			s3Out = s3_174;
			fflagsOut = fflags_107;
			frmOut = frm_108;
			return ra_109;
		}
		a0_135 = 0xFF000699;
	}
	else
	{
		a0_128 = 0x00;
		if (s4_114 != 0x01 || (word32) ((word16) (s1_111 + ~0x0100038C)) > 0x0334)
			goto l23002088;
		a0_135 = ~0x01000387;
	}
	a0_128 = s1_111 + a0_135 ^ 0x05;
	goto l23002088;
}

// 230020D4: Register ui32 phy_get_channel(Register ptr32 a0, Register out Eq_7907 a4Out, Register out (ptr32 Eq_7908) a5Out)
// Called from:
//      ps_send_pspoll
//      rxl_mpdu_transfer
//      txl_frame_send_null_frame
//      txl_frame_send_qosnull_frame
//      txl_frame_send_eapol_frame
//      rxu_mgt_frame_check
//      bam_send_air_action_frame
ui32 phy_get_channel(ptr32 a0, union Eq_7907 & a4Out, struct Eq_7908 & a5Out)
{
	ui32 a3_11 = (word32) g_b4201E97A;
	*((word32) g_b4201E97B << 8 | (word32) g_w4201E974 << 16 | a3_11) = a0;
	Eq_7907 a4_15 = (word32) g_w4201E976;
	struct Eq_7908 * a5_18 = (word32) g_w4201E978 << 16 | a4_15;
	a5_18->ptr0004 = a0;
	a4Out = a4_15;
	a5Out = a5_18;
	return a3_11;
}

