pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0000.c
// 2300252A: Register uint32 phy_get_nss(Register uint32 a0)
// Called from:
//      me_config_req_handler
uint32 phy_get_nss(uint32 a0)
{
	return (a0 >> 8 & 0x0F) + ~0x00 & 0x00FF;
}

// 2300253C: Register (ptr32 Eq_8437) phy_get_ntx(Register (ptr32 Eq_8437) a0)
// Called from:
//      hal_machw_init
//      txl_frame_init
//      rc_init
//      txl_buffer_init
struct Eq_8437 * phy_get_ntx(struct Eq_8437 * a0)
{
	return (a0 >> 4 & 0x0F) + ~0x00 & 0x00FF;
}

// 2300254E: void phy_stop()
// Called from:
//      mm_reset_req_handler
void phy_stop()
{
}

// 23002550: Register uint32 phy_ldpc_tx_supported(Register uint32 a0)
// Called from:
//      rc_init
uint32 phy_ldpc_tx_supported(uint32 a0)
{
	return a0 >> 26 & 0x01;
}

// 2300255C: Register int32 phy_get_mac_freq()
// Called from:
//      hal_machw_init
int32 phy_get_mac_freq()
{
	return 40;
}

// 23002562: Register (ptr32 byte) phy_get_rf_gain_idx(Register (ptr32 byte) a0, Register (ptr32 Eq_8454) a1, Register Eq_2 a3, Register out ptr32 a3Out, Register out Eq_8457 a4Out)
// Called from:
//      tpc_update_vif_tx_power
byte * phy_get_rf_gain_idx(byte * a0, struct Eq_8454 * a1, Eq_2 a3, ptr32 & a3Out, union Eq_8457 & a4Out)
{
	ptr32 a3_19;
	Eq_8457 a4_20;
	byte * a0_16 = rfc_get_power_level(0x02, (int32) *a0 + 0x0A, a3, out a3_19, out a4_20);
	a1->b0000 = (byte) a0_16;
	a3Out = a3_19;
	a4Out = a4_20;
	return a0_16;
}

// 23002586: Register (ptr32 byte) phy_get_rf_gain_capab(Register (ptr32 byte) a0, Register (ptr32 byte) a1, Register out ptr32 s8Out)
// Called from:
//      me_build_associate_req
byte * phy_get_rf_gain_capab(byte * a0, byte * a1, ptr32 & s8Out)
{
	*a0 = (byte) trpc_get_rf_max_power();
	*a1 = (byte) trpc_get_rf_min_power();
	s8Out = dwLoc1C;
	return a0;
}

// 230025A6: void bz_phy_reset()
// Called from:
//      rf_reset
void bz_phy_reset()
{
	*(ui32 *) 0x40003808 = *(int32 *) 0x40002808 & ~0x00800000 | 0x00800000;
	*(ui32 *) 0x40003808 = *(int32 *) 0x40002808 & 0x00FFFFFF | 0x08000000;
	*(ui32 *) 0x4000380C = *(int32 *) 0x4000280C & ~0x00800000 | 0x00800000;
	*(ui32 *) 0x4000380C = *(int32 *) 0x4000280C & 0x00FFFFFF | 0x04000000;
	*(ui32 *) 0x4000380C = *(int32 *) 0x4000280C & -0x0100;
	*(ui32 *) 0x40003854 = *(int32 *) 0x40002854 & 0xF00000FF | 0x02000000;
	*(ui32 *) 0x40003854 = *(int32 *) 0x40002854 & 0x00FFFFFF | 0x1E000000;
	*(ui32 *) 0x40003854 = *(int32 *) 0x40002854 & ~0x00FF0000 | 0x000A0000;
	*(ui32 *) 0x40003854 = *(int32 *) 0x40002854 & -0x0100 | 30;
	*(ui32 *) 0x40003810 = *(int32 *) 0x40002810 & ~0x01;
	*(ui32 *) 0x40003810 = *(int32 *) 0x40002810 | 2;
	*(ui32 *) 0x40003CAC = *(int32 *) 0x40002CAC & ~0x1F | 4;
}

// 23002672: void mpif_clk_init()
// Called from:
//      wifi_main
void mpif_clk_init()
{
}

// 23002674: void phy_mdm_isr()
void phy_mdm_isr()
{
}

// 23002676: void phy_rc_isr()
void phy_rc_isr()
{
	int32 a5_5 = *(int32 *) 0x44C0B41C;
	*(int32 *) 0x44C0B420 = a5_5;
	if ((a5_5 & 0x0100) == 0x00)
		return;
	mdm_reset();
}

// 2300268E: void pa_init()
// Called from:
//      phy_init
void pa_init()
{
	union Eq_8602 * a5_26 = &g_t42011888;
	do
	{
		*((char *) a5_26 + 115) = (union Eq_8602 *) 0x00;
		*((char *) a5_26 + 0x0078) = 0x00;
		*((char *) a5_26 + 0x006C) = 0x00;
		*((char *) a5_26 + 0x0068) = (union Eq_8602 *) 0x00;
		*((char *) a5_26 + 0x0087) = (union Eq_8602 *) 0x00;
		*((char *) a5_26 + 0x0080) = 0x00;
		*((char *) a5_26 + 0x0088) = (union Eq_8602 *) 0x00;
		*((char *) a5_26 + 0x0089) = (union Eq_8602 *) 0x00;
		union Eq_8602 * a4_15 = a5_26;
		word32 a3_16;
		for (a3_16 = 0x08; a3_16 != 0x00; a3_16 += ~0x00)
		{
			*((char *) a4_15 + 16) = (union Eq_8602 *) 0x00;
			*((char *) a4_15 + 8) = (union Eq_8602 *) 0x00;
			*((char *) a4_15 + 9) = (union Eq_8602 *) 0x00;
			*((char *) a4_15 + 0x0C) = 0x00;
			a4_15 = (union Eq_8602 *) ((char *) a4_15 + 0x0C);
		}
		a5_26 = (union Eq_8602 *) ((char *) a5_26 + 0x008C);
	} while (a5_26 != &g_w42011AB8);
}

// 230026DE: Register Eq_2 pa_input(Register Eq_2 ra, Register (ptr32 Eq_8666) a0, Register ptr32 fflags, Register ptr32 frm, Stack Eq_2 dwArg38, Register out ptr32 a2Out, Register out ptr32 fa0Out, Register out ptr32 fflagsOut, Register out ptr32 frmOut)
// Called from:
//      rxl_cntrl_evt
Eq_2 pa_input(Eq_2 ra, struct Eq_8666 * a0, ptr32 fflags, ptr32 frm, Eq_2 dwArg38, ptr32 & a2Out, ptr32 & fa0Out, ptr32 & fflagsOut, ptr32 & frmOut)
{
	if (a0 > (struct Eq_8666 *) 0x03)
	{
		a2Out = 0x03;
		fa0Out = fa0;
		fflagsOut = fflags;
		frmOut = frm;
		return ra;
	}
	int32 s1_114;
	word32 s2_115;
	ptr32 s0_113;
	Eq_2 ra_112;
	ptr32 fflags_110;
	Eq_2 a0_132;
	uint32 a1_133;
	ptr32 frm_111;
	struct Eq_8686 * a1_19 = a0->ptr0020;
	int32 s2_22 = (int32) a0->b4201197C;
	a0->ptr006C = &a0->ptr006C + 276842026;
	struct Eq_8700 * a4_26 = &a0->ptr006C + 8 + (s2_22 + 0x0C) / 1107368317;
	a4_26->b42011898 = 0x01;
	int32 a4_30 = (int32) a1_19->b0033;
	a4_26->b42011890 = (byte) a4_30;
	struct Eq_8719 * a4_34 = a4_30 << 20 >> 28;
	a4_26->b42011891 = (byte) a4_34;
	struct Eq_8728 * a1_36 = a4_34->ptr002C;
	if ((a4_34 & 0x00070000) == 0x00)
	{
		a1_36 = (a4_34 & 0x00070000)->ptr0028;
		word32 a0_40 = (word32) a1_36->b003B;
		if (((a4_34 & 0x00070000) >> 0x0C & 0x0F) <= 0x03)
		{
			Eq_2 a1_126;
			word32 a3_333;
			word32 s3_334;
			word32 s4_335;
			word32 s5_336;
			word32 s6_337;
			word32 s7_338;
			word32 s8_339;
			word32 s9_340;
			ra_112 = __muldf3(ra, __floatsidf((int32) (byte) a0_40, out a1_126), a1_126, g_t230AA3B0, g_t230AA3B4, fflags, frm, out s0_113, out s1_114, out a0_132, out a1_133, out a3_333, out s2_115, out s3_334, out s4_335, out s5_336, out s6_337, out s7_338, out s8_339, out s9_340, out fflags_110, out frm_111);
l23002762:
			ptr32 fa0_172;
			word32 a2_341;
			word32 a3_342;
			word32 a4_343;
			word32 a5_344;
			__truncdfsf2(ra_112, a0_132, a1_133, fflags_110, frm_111, out a2_341, out a3_342, out a4_343, out a5_344, out fa0_172);
			*((word32) a0_132 + 0x0C) = s2_115 + 0x0C + (s0_113 + 0x008C) + s1_114;
			int32 a5_185 = 0x00;
			if (s2_115 != 0x07)
				a5_185 = (int32) (byte) (s2_115 + 0x01);
			(s0_113 + 0x008C + s1_114)->b0068 = (byte) a5_185;
			0x00 = (int8) dwArg38;
			a2Out = dwArg10;
			fa0Out = fa0_172;
			fflagsOut = fflags_110;
			frmOut = frm_111;
			return ra_112;
		}
	}
	Eq_2 a1_53;
	word32 s9_332;
	Eq_2 a0_64;
	Eq_2 a1_65;
	ptr32 fflags_79;
	ptr32 frm_80;
	word32 s7_331;
	word32 s6_330;
	word32 s5_329;
	word32 s3_328;
	word32 a3_327;
	word32 s9_326;
	word32 s8_325;
	word32 s7_324;
	word32 s6_323;
	word32 s5_322;
	word32 s4_321;
	word32 s3_320;
	word32 s2_319;
	word32 a3_318;
	word32 s1_317;
	word32 s0_316;
	ra_112 = __divdf3(__muldf3(ra, __floatsidf(0x00 - (int32) ((word16) (((word32) a1_36->b003C << 8) + (word32) a1_36->b003B)), out a1_53), a1_53, g_t230AA3B8, g_t230AA3BC, fflags, frm, out s0_316, out s1_317, out a0_64, out a1_65, out a3_318, out s2_319, out s3_320, out s4_321, out s5_322, out s6_323, out s7_324, out s8_325, out s9_326, out fflags_79, out frm_80), a0_64, a1_65, g_t230AA3C0, g_t230AA3C4, fflags_79, frm_80, out s0_113, out s1_114, out a0_132, out a1_133, out a3_327, out s2_115, out s3_328, out s5_329, out s6_330, out s7_331, out s9_332, out fflags_110, out frm_111);
	goto l23002762;
}

// 230027E0: Register Eq_2 pa_adapt(Register Eq_2 ra, Register (ptr32 Eq_8964) a0, Register (ptr32 Eq_8965) a2, Register Eq_8966 fa0, Register ptr32 fflags, Register ptr32 frm, Register ptr32 mstatus, Stack Eq_2 dwArgC8, Register out (ptr32 Eq_8964) s1Out, Register out (ptr32 Eq_8972) a4Out, Register out Eq_8973 a5Out, Register out ptr32 fflagsOut, Register out ptr32 frmOut)
// Called from:
//      rxl_cntrl_evt
Eq_2 pa_adapt(Eq_2 ra, struct Eq_8964 * a0, struct Eq_8965 * a2, Eq_8966 fa0, ptr32 fflags, ptr32 frm, ptr32 mstatus, Eq_2 dwArgC8, struct Eq_8964 & s1Out, struct Eq_8972 & a4Out, union Eq_8973 & a5Out, ptr32 & fflagsOut, ptr32 & frmOut)
{
	if (a0 > (struct Eq_8964 *) 0x03)
	{
		s1Out = s1;
		a4Out = a4;
		a5Out.u0 = 0x03;
		fflagsOut = fflags;
		frmOut = frm;
		return ra;
	}
	else
	{
		struct Eq_8972 * a4_277;
		a2->dw0001 = a2->dw0000;
		int32 s0_251 = 0x42011888;
		int32 t3_33 = (int32) a0->b4201197C;
		if (t3_33 == 0x00)
			a4_277 = (struct Eq_8972 *) ((char *) a0 + 0x42011970);
		else
			a4_277 = (struct Eq_8972 *) ((char *) a0 + 0x0094 + (t3_33 + 11) + 0x42011888);
		Eq_8973 a5_134 = (word32) a4_277->b0008;
		if (a5_134 != 0x00)
		{
			Eq_9008 s2_48 = (int32) a4_277->b0000;
			struct Eq_9013 * a1_51 = (int32) a0->b42011987;
			if (a1_51 != null)
			{
				up32 a1_111 = (word32) a0->b42011988;
				if (a1_111 > 0x04)
				{
					a0->b42011988 = 0x00;
					a0->b42011987 = 0x00;
					a0->dw4201198C = 0x00;
				}
				else if (s2_48 <= 0)
				{
					Eq_9254 a6_115 = (int32) a0->b42011984;
					Eq_9259 a3_117 = s2_48 - a6_115;
					if (a3_117 > ~0x09)
						a0->b42011988 = (byte) (a1_111 + 0x01);
					else
					{
						a0->b42011988 = 0x00;
						a0->b42011984 = (byte) ((word32) a6_115 + (a3_117 >> 2));
					}
				}
			}
			else
			{
				struct Eq_9020 * a5_52 = a1_51->ptr0078;
				if (a1_51 > (struct Eq_9013 *) 0x06)
				{
					a5_52->b0073 = 0x01;
					int32 a6_58;
					int32 a7_59 = 100;
					int32 t1_60 = -100;
					word32 a5_61 = 0x00;
					for (a6_58 = 0x01; a6_58 != 0x07; ++a6_58)
					{
						int32 a3_78 = (int32) ((char *) a0 + 0x008C + ((t3_33 - a6_58 | 0x08) + 0x0C))[1107368080];
						a5_61 += a3_78;
						if (t1_60 < a3_78)
							t1_60 = a3_78;
						if (a3_78 < a7_59)
							a7_59 = a3_78;
					}
					a0->b42011984 = (byte) (a5_61 - t1_60 - a7_59 ^ 0x04);
				}
				else
					a1_51->ptr0079 = a5_52;
			}
			a5_134.u0 = 0x0F;
			if ((&a2->dw0001 & 0x0F) == 0x0F)
			{
				s1 = a0;
				if (s2_48 - (int32) a0->b42011984 <= ~0x09)
				{
					word32 a5_161;
					if ((word32) (fa0 >= 0.0F) != 0x00)
						a5_161 = (word32) (g_t230AA390 < fa0);
					else
						a5_161 = (word32) (fa0 < g_t230AA394);
					if (a5_161 != 0x00)
					{
						Eq_2 a3_210;
						Eq_2 a2_209;
						Eq_2 a1_188;
						Eq_2 a0_187 = __extendsfdf2(ra, fa0, fflags, frm, out a1_188);
						if (s2_48 < -0x0055)
						{
							word32 a1_753;
							__extendsfdf2(ra, a0->t42011994, fflags, frm, out a1_753);
							a2_209 = g_t230AA3A0;
							a3_210 = g_t230AA3A4;
						}
						else
						{
							word32 a1_752;
							__extendsfdf2(ra, a0->t42011994, fflags, frm, out a1_752);
							a2_209 = g_t230AA3A8;
							a3_210 = g_t230AA3AC;
						}
						Eq_2 a0_233;
						Eq_2 a1_234;
						Eq_2 s6_257;
						Eq_2 s7_258;
						word32 s8_759;
						word32 s9_760;
						word32 s4_757;
						word32 s5_758;
						word32 a3_754;
						word32 s3_756;
						word32 s2_755;
						ra = __muldf3(ra, a0_187, a1_188, a2_209, a3_210, fflags, frm, out s0_251, out s1, out a0_233, out a1_234, out a3_754, out s2_755, out s3_756, out s4_757, out s5_758, out s6_257, out s7_258, out s8_759, out s9_760, out fflags, out frm);
						uint32 a1_266;
						Eq_2 a0_265 = __adddf3(ra, s6_257, s7_258, a0_233, a1_234, fflags, frm, out a1_266);
						real32 fa0_281;
						word32 a3_762;
						word32 a5_763;
						word32 a2_761;
						__truncdfsf2(ra, a0_265, a1_266, fflags, frm, out a2_761, out a3_762, out a4_277, out a5_763, out fa0_281);
						*((word32) a0_265 + 0x0200) = fa0_281;
					}
				}
				real32 fa5_291 = ((char *) s1 + 0x008C + s0_251)[0x0080];
				if ((word32) (fa5_291 >= 0.0F) != 0x00)
					a5_134 = (word32) (fa5_291 < g_r230AA398);
				else
					a5_134 = (word32) (g_r230AA39C < fa5_291);
				if (a5_134 == 0x00)
				{
					__csrrc(mstatus, 0x08);
					if ((word32) (((char *) s1 + 0x008C + s0_251)[0x0080] > 0.0F) != 0x00 && hal_get_capcode() != 0x00)
					{
						word32 a5_764;
						a4_277 = hal_set_capcode((word32) hal_get_capcode() - 1, out a5_764);
					}
					a5_134 = (word32) (((char *) s1 + 0x008C + s0_251)[0x0080] < 0.0F);
					if (a5_134 != 0x00)
					{
						a5_134.u0 = 62;
						if (hal_get_capcode() <= 62)
							a4_277 = hal_set_capcode((word32) hal_get_capcode() + 1, out a5_134);
					}
					s1 = (struct Eq_8964 *) ((char *) s1 + 0x008C);
					*((char *) (s1 + s0_251 / 0x42011998) + 0x0080) = 0x00;
					__csrrs(mstatus, 0x08);
				}
			}
		}
		0x00 = (int8) dwArgC8;
		s1Out = s1;
		a4Out = a4_277;
		a5Out = a5_134;
		fflagsOut = fflags;
		frmOut = frm;
		return ra;
	}
}

// 23002A82: Register ui32 hal_get_capcode()
// Called from:
//      pa_adapt
ui32 hal_get_capcode()
{
	return *(union Eq_9331 *) 0x4000F884 >> 22 & 63;
}

// 23002A92: Register ui32 hal_set_capcode(Register ui32 a0, Register out Eq_9217 a5Out)
// Called from:
//      pa_adapt
ui32 hal_set_capcode(ui32 a0, union Eq_9217 & a5Out)
{
	Eq_9331 a4_5 = *(union Eq_9331 *) 0x4000F884;
	Eq_9217 a5_13 = a0 << 0x10 | a0 << 22 | a4_5 & ~0x0FFF0000;
	*(union Eq_9217 *) 0x40010884 = a5_13;
	a5Out = a5_13;
	return a4_5 & ~0x0FFF0000;
}

// 23002AB2: Register (ptr32 word16) hal_get_temperature(Register (ptr32 word16) a0)
// Called from:
//      phy_tcal_callback
word16 * hal_get_temperature(word16 * a0)
{
	*a0 = (word16) (word32) g_w4200F280;
	return (word16 *) 0x01;
}

// 23002AC2: void hal_set_temperature(Register int32 a0)
// Called from:
//      phy_tcal_callback
void hal_set_temperature(int32 a0)
{
	g_w4200F280 = (word16) a0;
}

// 23002ACC: void trpc_update_power(Register ptr32 a0)
// Called from:
//      bl_tpc_update_power_table
void trpc_update_power(ptr32 a0)
{
	byte a5_24[] = g_a4200CF20;
	word32 a3_23;
	for (a3_23 = 0x00; a3_23 != 0x18; a3_23 += 0x08)
	{
		ptr32 t1_10 = a0 + a3_23;
		int32 a4_11;
		for (a4_11 = 0x00; a4_11 != 0x08; ++a4_11)
			a5_24[a4_11] = (byte) (int32) (t1_10 + a4_11);
		a5_24 = (byte (*)[]) (a5_24 + 8);
	}
}

// 23002B00: void trpc_power_get(Register Eq_2 a0)
// Called from:
//      bl_tpc_power_table_get
void trpc_power_get(Eq_2 a0)
{
	word32 a1_20;
	word32 a2_21;
	word32 a3_22;
	word32 a4_23;
	word32 a5_24;
	word32 a6_25;
	word32 a7_26;
	memcpy(a0, 0x4200CF20, 0x18, out a1_20, out a2_21, out a3_22, out a4_23, out a5_24, out a6_25, out a7_26);
}

// 23002B0E: void trpc_update_power_11b(Register ptr32 a0)
// Called from:
//      bl_tpc_update_power_rate_11b
void trpc_update_power_11b(ptr32 a0)
{
	struct Eq_9410 * a5_14 = null;
	do
	{
		a5_14[0x4200CF20] = (struct Eq_9410) (byte) (int32) a5_14[a0];
		++a5_14;
	} while (a5_14 != (struct Eq_9410 *) 0x04);
}

// 23002B32: void trpc_update_power_11g(Register ptr32 a0)
// Called from:
//      bl_tpc_update_power_rate_11g
void trpc_update_power_11g(ptr32 a0)
{
	struct Eq_9424 * a5_13 = g_a4200CF20;
	int32 a4_12;
	for (a4_12 = 0x00; a4_12 != 0x08; ++a4_12)
	{
		++a5_13;
		a5_13[7] = (struct Eq_9424) (byte) (int32) (a0 + a4_12);
	}
}

// 23002B54: void trpc_update_power_11n(Register ptr32 a0)
// Called from:
//      bl_tpc_update_power_rate_11n
void trpc_update_power_11n(ptr32 a0)
{
	struct Eq_9442 * a5_13 = g_a4200CF20;
	int32 a4_12;
	for (a4_12 = 0x00; a4_12 != 0x08; ++a4_12)
	{
		++a5_13;
		a5_13[0x0F] = (struct Eq_9442) (byte) (int32) (a0 + a4_12);
	}
}

