pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0000.c
// 23002B76: void trpc_init()
// Called from:
//      phy_init
void trpc_init()
{
	g_w4201E980 = 63882;
	g_b4201E97C = (byte) rf_pri_get_txgain_max();
	word32 a0_17 = rf_pri_get_txgain_min();
	g_b4201E97E = 0x1E;
	g_b4201E97D = (byte) a0_17;
	g_t4201E982.u1 = 0x19;
}

// 23002BB2: Register int32 trpc_get_rf_max_power()
// Called from:
//      phy_get_rf_gain_capab
int32 trpc_get_rf_max_power()
{
	return (int32) g_b4201E97C;
}

// 23002BBC: Register int32 trpc_get_rf_min_power()
// Called from:
//      phy_get_rf_gain_capab
int32 trpc_get_rf_min_power()
{
	return (int32) g_b4201E97D;
}

// 23002BC6: Register uint32 trpc_get_power_idx(Register Eq_2 ra, Register uint32 a0, Register (ptr32 Eq_9491) a1, Register int32 a2, Register ptr32 fflags, Register ptr32 frm, Register out ptr32 a1Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out Eq_9498 a5Out)
// Called from:
//      trpc_get_default_power_idx
uint32 trpc_get_power_idx(Eq_2 ra, uint32 a0, struct Eq_9491 * a1, int32 a2, ptr32 fflags, ptr32 frm, ptr32 & a1Out, ptr32 & a3Out, ptr32 & a4Out, union Eq_9498 & a5Out)
{
	ui32 a4_11 = 0x02;
	if (a0 <= 0x02)
		a4_11 = a0 & 0x00FF;
	struct Eq_9491 * a7_13 = (struct Eq_9491 *) 0x03;
	if (a0 != 0x00)
		a7_13 = (struct Eq_9491 *) 0x07;
	int32 a5_21 = (word32) g_b4201E97E;
	int32 a0_20 = (int32) g_b4201E97C;
	if (a0_20 < (int32) ((byte) a5_21))
		a5_21 = a0_20;
	if (a2 < (int32) ((byte) a5_21))
		a5_21 = a2;
	int32 a5_35 = a5_21 << 24;
	if (a7_13 < a1)
		a1 = a7_13;
	int32 a4_60 = (word32) a1->a4200CF20[a4_11].b0000;
	if (a5_35 >> 24 < (int32) ((byte) a4_60))
		a4_60 = a5_35 >> 24;
	int32 a5_70 = (word32) g_b4201E97D;
	if ((int32) (byte) a5_70 < (int32) ((byte) a4_60))
		a5_70 = a4_60;
	Eq_2 a1_91;
	word32 a4_209;
	Eq_2 a1_122;
	ptr32 a1_131;
	ptr32 a3_133;
	word32 a5_210;
	Eq_2 a0_130 = __fixdfsi(ra, __adddf3(ra, __floatsidf((int32) (byte) a5_70 + -510 + a0_20 ^ 0x0200, out a1_91), a1_91, g_t230AA3C8, g_t230AA3CC, fflags, frm, out a1_122), a1_122, fflags, frm, out a1_131, out a3_133, out a4_209, out a5_210);
	word32 a5_138 = 0x03;
	if (a0 != 0x00)
		a5_138 = 0x00;
	ui32 a5_148 = a5_138 + (a0_130 & 0x00FF);
	ui32 a0_151 = a5_148 & 0x00FF;
	if ((a5_148 & 0x00FF) > 0x0F)
		a0_151 = 0x0F;
	a1Out = a1_131;
	a3Out = a3_133;
	a4Out = 0x0F;
	a5Out = a5_148 & 0x00FF;
	return a0_151 << 2 & 252;
}

// 23002CA4: Register uint32 trpc_get_default_power_idx(Register Eq_2 ra, Register uint32 a0, Register int32 a1, Register ptr32 fflags, Register ptr32 frm, Register out ptr32 a1Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out)
// Called from:
//      tpc_update_vif_tx_power
//      tpc_get_vif_tx_power_vs_rate
uint32 trpc_get_default_power_idx(Eq_2 ra, uint32 a0, int32 a1, ptr32 fflags, ptr32 frm, ptr32 & a1Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & a5Out)
{
	uint32 a4_18 = a0 & 0x00FF;
	if (a0 > 0x02)
		a4_18 = 0x02;
	int32 a5_10 = 0x03;
	if (a0 != 0x00)
		a5_10 = 0x07;
	if (a5_10 < a1)
		a1 = a5_10;
	int32 a2_28 = (int32) (a4_18 << 0x03)->a4200CF20[a1];
	struct Eq_9491 * a1_29 = a1 & 0x00FF;
	ptr32 a1_44;
	ptr32 a3_46;
	ptr32 a4_47;
	ptr32 a5_48;
	uint32 a0_43 = trpc_get_power_idx(ra, a4_18, a1_29, a2_28, fflags, frm, out a1_44, out a3_46, out a4_47, out a5_48);
	a1Out = a1_44;
	a3Out = a3_46;
	a4Out = a4_47;
	a5Out = a5_48;
	return a0_43;
}

// 23002CD8: void trpc_update_vs_channel(Register int32 a0)
// Called from:
//      phy_hw_set_channel
void trpc_update_vs_channel(int32 a0)
{
	g_w4201E980 = (word16) a0;
	g_b4201E97C = (byte) rf_pri_get_txgain_max();
	g_b4201E97D = (byte) rf_pri_get_txgain_min();
}

// 23002D02: void trpc_update_vs_temperature(Register int32 a0)
// Called from:
//      phy_tcal_txpwr
void trpc_update_vs_temperature(int32 a0)
{
	g_t4201E982 = (byte) a0;
	g_b4201E97C = (byte) rf_pri_get_txgain_max();
	g_b4201E97D = (byte) rf_pri_get_txgain_min();
}

// 23002D2C: Register Eq_2 phy_tcal_reset(Register Eq_2 ra)
// Called from:
//      phy_init
Eq_2 phy_tcal_reset(Eq_2 ra)
{
	word32 t1_36;
	word32 a0_37;
	word32 a1_38;
	word32 a2_39;
	word32 a3_40;
	word32 a4_41;
	word32 a5_42;
	Eq_2 ra_19 = memset(ra, 0x42011AB8, 0x00, 56, out t1_36, out a0_37, out a1_38, out a2_39, out a3_40, out a4_41, out a5_42);
	((union Eq_2 *) 0x2D)->u0 = 0x42011AB8;
	((union Eq_2 *) 0x31)->u0 = 0x42011AB8;
	((union Eq_2 *) 0x35)->u0 = 0x42011AB8;
	((union Eq_2 *) 0x39)->u0 = 0x42011AB8;
	g_w42011AB8 = 0x19;
	g_b42011AEC = 0x01;
	return ra_19;
}

// 23002D64: void phy_tcal_start()
// Called from:
//      phy_init
void phy_tcal_start()
{
	g_b42012AEC = 0x01;
}

// 23002D70: void phy_tcal_txpwr(Register (ptr32 word32) a0, Register (ptr32 word32) a1, Register (ptr32 word32) a3)
// Called from:
//      phy_tcal_callback
void phy_tcal_txpwr(word32 * a0, word32 * a1, word32 * a3)
{
	rf_pri_tx_gain_comp(a0, a1, a3);
	int32 a0_23 = (int32) (byte) a0;
	trpc_update_vs_temperature(a0_23);
}

// 23002D8A: Register (ptr32 Eq_7063) phy_tcal_handle(Register (ptr32 Eq_7063) s0, Register (ptr32 word32) a1, Register (ptr32 word32) a3, Register ptr32 mstatus, Register out Eq_7597 a4Out, Register out ptr32 a5Out, Register out ptr32 s4Out)
// Called from:
//      phy_tcal_callback
struct Eq_7063 * phy_tcal_handle(struct Eq_7063 * s0, word32 * a1, word32 * a3, ptr32 mstatus, union Eq_7597 & a4Out, ptr32 & a5Out, ptr32 & s4Out)
{
	ptr32 a5_14;
	int16 wLoc12_95 = SLICE(s0, int16, 16);
	if (hal_get_temperature(fp + ~0x11) != 0x00)
	{
		phy_tcal_txpwr((int32) wLoc12_95, a1, a3);
		int32 a5_26 = (word32) wLoc12_95;
		if ((int32) (word16) a5_26 > 0x007D)
			a5_26 = 0x007D;
		int32 a4_32 = a5_26 << 0x10;
		a4 = a4_32 >> 16;
		if (a4_32 >> 16 < -40)
			a5_26 = -40;
		int32 s2_37 = a5_26 << 0x10;
		int16 wLoc12_96 = (word16) a5_26;
		int32 a5_43 = (int32) (word16) (a5_26 + ~0x18);
		if (a5_43 <= 0x00)
			s0 = a5_43 + ~0x05 >> 0x08;
		else
			s0 = (int32) (word16) (0x00 - (a5_43 + 0x06 >> 8));
		if (s0 != g_ptr42011AE4)
		{
			__csrrc(mstatus, 0x08);
			a4 = phy_config_rxgain(s0);
			__csrrs(mstatus, 0x08);
			g_dw42011AD4 = s2_37 >> 0x10;
			s0->dw002C = 0x42011AB8;
		}
		a5_14 = (word32) wLoc12_96;
		g_w42011AB8 = (word16) a5_14;
	}
	a4Out = a4;
	a5Out = a5_14;
	s4Out = dwArg04;
	return s0;
}

// 23002E38: Register (ptr32 Eq_7063) phy_tcal_callback(Register (ptr32 Eq_7063) s0, Register int32 a0, Register (ptr32 word32) a1, Register (ptr32 word32) a3, Register ptr32 mstatus, Register out ptr32 a4Out, Register out Eq_9832 a5Out, Register out ptr32 s4Out)
// Called from:
//      wifi_mgmr_start
struct Eq_7063 * phy_tcal_callback(struct Eq_7063 * s0, int32 a0, word32 * a1, word32 * a3, ptr32 mstatus, ptr32 & a4Out, union Eq_9832 & a5Out, ptr32 & s4Out)
{
	hal_set_temperature(a0);
	Eq_9832 a5_9 = (word32) g_b42011AEC;
	if (a5_9 == 0x00)
	{
		a4Out = a4;
		a5Out = a5_9;
		s4Out = s4;
		return s0;
	}
	else
	{
		Eq_9832 a5_19;
		ptr32 s4_21;
		ptr32 a4_27;
		struct Eq_7063 * s0_29 = phy_tcal_handle(s0, a1, a3, mstatus, out a4_27, out a5_19, out s4_21);
		a4Out = a4_27;
		a5Out = a5_19;
		s4Out = s4_21;
		return s0_29;
	}
}

// 23002E56: Register word32 rf_fsm_ctrl_en_setf(Register ui32 a0, Register (ptr32 Eq_5868) a5, Register out Eq_9858 a5Out)
// Called from:
//      rfc_init
//      rf_set_channel
//      cmd_wifi_coex_rf_force_on
word32 rf_fsm_ctrl_en_setf(ui32 a0, struct Eq_5868 * a5, union Eq_9858 & a5Out)
{
	word32 a4_5 = a5->dw0004;
	(a0 << 1 | a5 & ~0x02)->dw0004 = a4_5;
	a5Out = a5 & ~0x02;
	return a4_5;
}

// 23002E66: Register (ptr32 Eq_9872) rf_gc_tbb_setf(Register ui32 a0, Register (ptr32 Eq_9872) a5)
// Called from:
//      rfc_config_power_ble
struct Eq_9872 * rf_gc_tbb_setf(ui32 a0, struct Eq_9872 * a5)
{
	(a0 << 20 & 0x01F00000 | a5 & ~0x01F00000)->dw0048 = a5->dw0048;
	return a5 & ~0x01F00000;
}

