pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0000.c
// 23002E82: void rf_gc_tmx_setf(Register ui32 a0, Register (ptr32 Eq_9889) a5)
// Called from:
//      rfc_config_power_ble
void rf_gc_tmx_setf(ui32 a0, struct Eq_9889 * a5)
{
	(a0 << 16 & 0x00070000 | a5 & ~0x00070000)->dw0048 = a5->dw0048;
}

// 23002E9E: Register (ptr32 Eq_9903) rf_pa_ib_fix_setf(Register ui32 a0, Register (ptr32 Eq_9903) a5)
// Called from:
//      rfc_config_power_ble
struct Eq_9903 * rf_pa_ib_fix_setf(ui32 a0, struct Eq_9903 * a5)
{
	(a0 << 16 | a5 & ~0x10000000)->dw0064 = a5->dw0064;
	return a5 & ~0x10000000;
}

// 23002EB2: Register (ptr32 Eq_9917) rf_pa_vbcas_setf(Register ui32 a0, Register (ptr32 Eq_9917) a5)
// Called from:
//      rfc_config_power_ble
struct Eq_9917 * rf_pa_vbcas_setf(ui32 a0, struct Eq_9917 * a5)
{
	(a0 << 0x0C | a5 & ~0x07000000)->dw0064 = a5->dw0064;
	return a5 & ~0x07000000;
}

// 23002EC6: Register (ptr32 Eq_9931) rf_pa_vbcore_setf(Register ui32 a0, Register (ptr32 Eq_9931) a5)
// Called from:
//      rfc_config_power_ble
struct Eq_9931 * rf_pa_vbcore_setf(ui32 a0, struct Eq_9931 * a5)
{
	(a0 << 8 | a5 & 0xFF0000FF)->dw0064 = a5->dw0064;
	return a5 & 0xFF0000FF;
}

// 23002EDC: Register (ptr32 Eq_9945) rf_tmx_cs_setf(Register ui32 a0, Register (ptr32 Eq_9945) a5)
// Called from:
//      rfc_config_power_ble
struct Eq_9945 * rf_tmx_cs_setf(ui32 a0, struct Eq_9945 * a5)
{
	(a0 | a5 & ~0x07)->dw006C = a5->dw006C;
	return a5 & ~0x07;
}

// 23002EEA: Register ui32 rf_fsm_st_dbg_en_setf(Register ui32 a0)
// Called from:
//      rfc_init
//      rf_set_channel
ui32 rf_fsm_st_dbg_en_setf(ui32 a0)
{
	int32 a5_5 = *(int32 *) 0x4000126C;
	*(int32 *) 0x4000126C = a0 << 3 | a5_5 & ~0x08;
	return a5_5 & ~0x08;
}

// 23002EFE: void rf_tx_dvga_gain_qdb_gc3_setf(Register int32 a0)
// Called from:
//      rfc_init
//      rfc_apply_tx_power_offset
//      rf_pri_tx_gain_comp
void rf_tx_dvga_gain_qdb_gc3_setf(int32 a0)
{
	*(int32 *) 0x40001630 = a0 << 24 & 0x7F000000 | *((int32 *) 0x40001630) & ~0x7F000000;
}

// 23002F1E: void rf_tx_dvga_gain_qdb_gc2_setf(Register int32 a0)
// Called from:
//      rfc_init
//      rfc_apply_tx_power_offset
//      rf_pri_tx_gain_comp
void rf_tx_dvga_gain_qdb_gc2_setf(int32 a0)
{
	*(int32 *) 0x40001630 = a0 << 16 & 0x007F0000 | *((int32 *) 0x40001630) & ~0x007F0000;
}

// 23002F3E: void rf_tx_dvga_gain_qdb_gc1_setf(Register int32 a0)
// Called from:
//      rfc_init
//      rfc_apply_tx_power_offset
//      rf_pri_tx_gain_comp
void rf_tx_dvga_gain_qdb_gc1_setf(int32 a0)
{
	*(int32 *) 0x40001630 = a0 << 8 & 0x07FFFF00 | *((int32 *) 0x40001630) & 0xF80000FF;
}

// 23002F60: void rf_tx_dvga_gain_qdb_gc0_setf(Register int32 a0)
// Called from:
//      rfc_init
//      rfc_apply_tx_power_offset
//      rf_pri_tx_gain_comp
void rf_tx_dvga_gain_qdb_gc0_setf(int32 a0)
{
	*(int32 *) 0x40001630 = a0 & 0x007F | *((int32 *) 0x40001630) & -0x0080;
}

// 23002F78: void rf_tx_dvga_gain_qdb_gc7_setf(Register int32 a0)
// Called from:
//      rfc_init
//      rfc_apply_tx_power_offset
//      rf_pri_tx_gain_comp
void rf_tx_dvga_gain_qdb_gc7_setf(int32 a0)
{
	*(int32 *) 0x40001634 = a0 << 24 & 0x7F000000 | *((int32 *) 0x40001634) & ~0x7F000000;
}

// 23002F98: void rf_tx_dvga_gain_qdb_gc6_setf(Register int32 a0)
// Called from:
//      rfc_init
//      rfc_apply_tx_power_offset
//      rf_pri_tx_gain_comp
void rf_tx_dvga_gain_qdb_gc6_setf(int32 a0)
{
	*(int32 *) 0x40001634 = a0 << 16 & 0x007F0000 | *((int32 *) 0x40001634) & ~0x007F0000;
}

// 23002FB8: void rf_tx_dvga_gain_qdb_gc5_setf(Register int32 a0)
// Called from:
//      rfc_init
//      rfc_apply_tx_power_offset
//      rf_pri_tx_gain_comp
void rf_tx_dvga_gain_qdb_gc5_setf(int32 a0)
{
	*(int32 *) 0x40001634 = a0 << 8 & 0x07FFFF00 | *((int32 *) 0x40001634) & 0xF80000FF;
}

// 23002FDA: void rf_tx_dvga_gain_qdb_gc4_setf(Register int32 a0)
// Called from:
//      rfc_init
//      rfc_apply_tx_power_offset
//      rf_pri_tx_gain_comp
void rf_tx_dvga_gain_qdb_gc4_setf(int32 a0)
{
	*(int32 *) 0x40001634 = a0 & 0x007F | *((int32 *) 0x40001634) & -0x0080;
}

// 23002FF2: void rf_tx_dvga_gain_qdb_gc11_setf(Register int32 a0)
// Called from:
//      rfc_init
//      rfc_apply_tx_power_offset
//      rf_pri_tx_gain_comp
void rf_tx_dvga_gain_qdb_gc11_setf(int32 a0)
{
	*(int32 *) 0x40001638 = a0 << 24 & 0x7F000000 | *((int32 *) 0x40001638) & ~0x7F000000;
}

// 23003012: void rf_tx_dvga_gain_qdb_gc10_setf(Register int32 a0)
// Called from:
//      rfc_init
//      rfc_apply_tx_power_offset
//      rf_pri_tx_gain_comp
void rf_tx_dvga_gain_qdb_gc10_setf(int32 a0)
{
	*(int32 *) 0x40001638 = a0 << 16 & 0x007F0000 | *((int32 *) 0x40001638) & ~0x007F0000;
}

// 23003032: void rf_tx_dvga_gain_qdb_gc9_setf(Register int32 a0)
// Called from:
//      rfc_init
//      rfc_apply_tx_power_offset
//      rf_pri_tx_gain_comp
void rf_tx_dvga_gain_qdb_gc9_setf(int32 a0)
{
	*(int32 *) 0x40001638 = a0 << 8 & 0x07FFFF00 | *((int32 *) 0x40001638) & 0xF80000FF;
}

// 23003054: void rf_tx_dvga_gain_qdb_gc8_setf(Register int32 a0)
// Called from:
//      rfc_init
//      rfc_apply_tx_power_offset
//      rf_pri_tx_gain_comp
void rf_tx_dvga_gain_qdb_gc8_setf(int32 a0)
{
	*(int32 *) 0x40001638 = a0 & 0x007F | *((int32 *) 0x40001638) & -0x0080;
}

// 2300306C: Register ui32 rf_tx_dvga_gain_qdb_gc15_setf(Register int32 a0)
// Called from:
//      rfc_init
//      rfc_apply_tx_power_offset
//      rf_pri_tx_gain_comp
ui32 rf_tx_dvga_gain_qdb_gc15_setf(int32 a0)
{
	int32 a5_5 = *(int32 *) 0x4000163C;
	*(int32 *) 0x4000163C = a0 << 24 & 0x7F000000 | a5_5 & ~0x7F000000;
	return a5_5 & ~0x7F000000;
}

// 2300308C: void rf_tx_dvga_gain_qdb_gc14_setf(Register int32 a0)
// Called from:
//      rfc_init
//      rfc_apply_tx_power_offset
//      rf_pri_tx_gain_comp
void rf_tx_dvga_gain_qdb_gc14_setf(int32 a0)
{
	*(int32 *) 0x4000163C = a0 << 16 & 0x007F0000 | *((int32 *) 0x4000163C) & ~0x007F0000;
}

// 230030AC: void rf_tx_dvga_gain_qdb_gc13_setf(Register int32 a0)
// Called from:
//      rfc_init
//      rfc_apply_tx_power_offset
//      rf_pri_tx_gain_comp
void rf_tx_dvga_gain_qdb_gc13_setf(int32 a0)
{
	*(int32 *) 0x4000163C = a0 << 8 & 0x07FFFF00 | *((int32 *) 0x4000163C) & 0xF80000FF;
}

// 230030CE: void rf_tx_dvga_gain_qdb_gc12_setf(Register int32 a0)
// Called from:
//      rfc_init
//      rfc_apply_tx_power_offset
//      rf_pri_tx_gain_comp
void rf_tx_dvga_gain_qdb_gc12_setf(int32 a0)
{
	*(int32 *) 0x4000163C = a0 & 0x007F | *((int32 *) 0x4000163C) & -0x0080;
}

// 230030E6: Register word32 wait_us(Register (ptr32 Eq_5868) a5)
// Called from:
//      _print_channel_info
//      rfc_init
//      rf_set_channel
//      cmd_wifi_coex_rf_force_on
word32 wait_us(struct Eq_5868 * a5)
{
	do
		;
	while (a5 != null);
	return (char *) a5 - 1;
}

// 230030FA: Register (ptr32 Eq_10163) rf_pa_etb_en_setf.constprop.16(Register (ptr32 Eq_10163) a5)
// Called from:
//      rfc_config_power_ble
struct Eq_10163 * rf_pa_etb_en_setf.constprop.16(struct Eq_10163 * a5)
{
	(a5 & ~0x08)->dw0064 = a5->dw0064;
	return a5 & ~0x08;
}

