pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0000.c
// 23003106: Register (ptr32 Eq_10173) rf_pa_half_on_setf.constprop.17(Register (ptr32 Eq_10173) a5)
// Called from:
//      rfc_config_power_ble
struct Eq_10173 * rf_pa_half_on_setf.constprop.17(struct Eq_10173 * a5)
{
	struct Eq_10173 * a5_10 = a5 & ~0x08000000 | 0x08000000;
	a5_10->dw0064 = a5->dw0064;
	return a5_10;
}

// 2300311A: void _print_channel_info(Register (ptr32 Eq_5868) a5)
// Called from:
//      rf_set_channel
void _print_channel_info(struct Eq_5868 * a5)
{
	word32 s0_10;
	for (s0_10 = 0x08; s0_10 != 0x00; s0_10 += ~0x00)
		wait_us(a5);
	word32 s0_16;
	for (s0_16 = 0x08; s0_16 != 0x00; s0_16 += ~0x00)
		wait_us(a5);
}

// 23003140: Register word32 rfc_init(Register word32 s0, Register Eq_2 s1, Register up32 a0, Register Eq_2 s2, Register (ptr32 Eq_326) s3, Register Eq_2 s6, Register Eq_2 s7, Register ptr32 fflags, Register ptr32 frm, Stack Eq_2 dwArg18, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg58, Stack Eq_2 dwArg64, Stack (ptr32 Eq_326) dwArg84, Stack Eq_2 dwArg88, Register out ptr32 s0Out, Register out Eq_2 s1Out, Register out ptr32 a4Out, Register out Eq_6069 s2Out)
// Called from:
//      wifi_main
//      ble_controller_init
word32 rfc_init(word32 s0, Eq_2 s1, up32 a0, Eq_2 s2, struct Eq_326 * s3, Eq_2 s6, Eq_2 s7, ptr32 fflags, ptr32 frm, Eq_2 dwArg18, Eq_2 dwArg1C, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg58, Eq_2 dwArg64, struct Eq_326 * dwArg84, Eq_2 dwArg88, ptr32 & s0Out, union Eq_2 & s1Out, ptr32 & a4Out, union Eq_6069 & s2Out)
{
	Eq_2 dwLoc58 = (word32) qwLoc58;
	Eq_2 dwLoc14 = SLICE(qwLoc18, word32, 32);
	struct Eq_10210 * a0_49;
	*(struct Eq_10212 **) 0x40001220 &= ~0x04000000;
	*(struct Eq_10212 **) 0x40001220 = *(struct Eq_10212 **) 0x40001220 & ~0x08000000 | 0x08000000;
	Eq_2 dwLoc44_824 = SLICE(s1, word32, 32);
	if (a0 == 32000000)
	{
		a0_49 = (struct Eq_10210 *) 0x02;
		goto l230031E4;
	}
	if (a0 <= 32000000)
	{
		a0_49 = null;
		if (a0 == 24000000)
			goto l230031E4;
		a0_49 = (struct Eq_10210 *) 0x01;
		if (a0 != 26000000)
		{
l230031B8:
			a0_49 = (struct Eq_10210 *) 0x04;
			goto l230031E4;
		}
	}
	else
	{
		if (a0 == 40000000)
			goto l230031B8;
		a0_49 = (struct Eq_10210 *) 0x05;
		if (a0 != 52000000)
		{
			if (a0 != 38400000)
				goto l230031B8;
			a0_49 = (struct Eq_10210 *) 0x03;
		}
	}
l230031E4:
	real32 fa0_136;
	rf_pri_xtalfreq(a0_49);
	ptr32 fflags_97;
	ptr32 frm_98;
	uint32 s1_100;
	struct Eq_10245 * s2_103;
	byte * s0_119;
	Eq_2 ra_99 = rf_pri_init(a0, (word32) ((word32) g_b4200F284 < 1), 0x01, 0x4200F000, s6, fflags, frm, dwLoc60, dwLoc5C, dwLoc58, dwLoc44_824, s2, dwLoc30, dwLoc2C, dwLoc28, dwLoc14, dwLoc10, dwLoc0C, dwLoc08, dwArg18, dwArg1C, dwArg28, s7, dwArg58, dwArg88, s0, out s0_119, out s1_100, out s2_103, out fflags_97, out frm_98);
	*s0_119 = 0x01;
	word32 a1_126;
	s2_103->t0B00 = __floatunsidf(s1_100 >> 1000000, out a1_126);
	s2_103->dw0B04 = a1_126;
	if (s1_100 != 40000000)
		fa0_136 = g_r230ABBE4;
	else
		fa0_136 = g_r230ABBE0;
	*(int32 *) 0x400011C0 = (uint32) fa0_136 & 0x00FFFFFF | *((int32 *) 0x400011C0) & 0xFF000000;
	real32 fs0_140 = (real32) (s1_100 >> 1000000);
	real32 fs1_161 = g_r230ABBF0;
	int32 a0_157 = *(int32 *) 0x400011C4;
	Eq_2 a1_175;
	uint32 a1_181;
	word32 a4_1020;
	Eq_2 a0_189 = __fixunsdfsi(ra_99, __adddf3(ra_99, __extendsfdf2(ra_99, fa0_136 * g_r230ABBE8 / g_r230ABBEC / fs0_140 * fs1_161, fflags_97, frm_98, out a1_175), a1_175, g_t230AA3C8, g_t230AA3CC, fflags_97, frm_98, out a1_181), a1_181, fflags_97, frm_98, out a4_1020);
	real32 fa0_199 = g_r230ABBF4 / fs0_140;
	*(int32 *) 0x400011C4 = (word32) (word29) a0_189 | a0_157 & 0xE0000000;
	int32 a0_202 = *(int32 *) 0x400011C8;
	Eq_2 a1_208;
	uint32 a1_214;
	word32 a4_1021;
	Eq_2 a0_222 = __fixunsdfsi(ra_99, __adddf3(ra_99, __extendsfdf2(ra_99, fa0_199 * fs1_161, fflags_97, frm_98, out a1_208), a1_208, g_t230AA3C8, g_t230AA3CC, fflags_97, frm_98, out a1_214), a1_214, fflags_97, frm_98, out a4_1021);
	real32 fa0_232 = g_r230ABBF8 / fs0_140;
	*(int32 *) 0x400011C8 = a0_222 & 0x000FFFFF | a0_202 & 0xFFF00000;
	Eq_2 a1_239;
	uint32 a1_246;
	word32 a4_1022;
	*(int32 *) 0x400011CC = __fixunsdfsi(ra_99, __adddf3(ra_99, __extendsfdf2(ra_99, fa0_232 * fs1_161, fflags_97, frm_98, out a1_239), a1_239, g_t230AA3C8, g_t230AA3CC, fflags_97, frm_98, out a1_246), a1_246, fflags_97, frm_98, out a4_1022) & 0x000FFFFF | *((int32 *) 0x400011CC) & 0xFFF00000;
	ui32 s1_166;
	ui32 s5_235 = 0x00;
	int32 s4_244 = 0x00;
	for (s1_166 = 0x00FFF964; s1_166 != 0x00FFF9B8; s1_166 += 0x04)
	{
		ui32 a0_271 = rf_pri_get_vco_freq_cw(ra_99, s1_166, fflags_97, frm_98);
		ui32 s2_281 = a0_271;
		ui32 a0_283 = rf_pri_get_vco_idac_cw(ra_99, s1_166, fflags_97, frm_98);
		if (s1_166 == 0x00FFF964)
			s2_281 = a0_271 + 0x01;
		ui32 a0_301 = s2_281 << 8 | a0_283;
		if ((s4_244 & 1) != 0x00)
		{
			s5_235 |= a0_301 << 16;
			((ui32[]) 0x4000113C)[s4_244 >> 0x01] = s5_235;
		}
		else
			s5_235 = a0_301;
		if (s1_166 == 0x00FFF9B4)
			((ui32[]) 0x4000113C)[s4_244 >> 0x01] = s5_235;
		++s4_244;
	}
	word32 a5_1023;
	int32 a0_342 = rf_pri_query_txgain_table(0x00, fp + -88, fp + -84, out a5_1023);
	int32 a5_349 = *(int32 *) 0x40001640;
	dwArg84->dw0640 = a5_349 & 0x07 | a5_349 & -8;
	rf_tx_dvga_gain_qdb_gc0_setf(a0_342);
	word32 a5_1024;
	int32 a0_368 = rf_pri_query_txgain_table(0x01, fp + -88, fp + -84, out a5_1024);
	ui32 a5_371 = dwArg84->dw0640;
	dwArg84->dw0640 = a5_371 << 4 & 112 | a5_371 & -113;
	rf_tx_dvga_gain_qdb_gc1_setf(a0_368);
	word32 a5_1025;
	int32 a0_392 = rf_pri_query_txgain_table(0x02, fp + -88, fp + -84, out a5_1025);
	ui32 a5_395 = dwArg84->dw0640;
	dwArg84->dw0640 = a5_395 << 8 & 0x0700 | a5_395 & -0x0701;
	rf_tx_dvga_gain_qdb_gc2_setf(a0_392);
	word32 a5_1026;
	int32 a0_418 = rf_pri_query_txgain_table(0x03, fp + -88, fp + -84, out a5_1026);
	ui32 a5_421 = dwArg84->dw0640;
	dwArg84->dw0640 = a5_421 << 0x0C & 0x07000000 | a5_421 & ~0x07000000;
	rf_tx_dvga_gain_qdb_gc3_setf(a0_418);
	word32 a5_1027;
	int32 a0_436 = rf_pri_query_txgain_table(0x04, fp + -88, fp + -84, out a5_1027);
	ui32 a5_439 = dwArg84->dw0640;
	dwArg84->dw0640 = a5_439 << 16 & 0x00070000 | a5_439 & ~0x00070000;
	rf_tx_dvga_gain_qdb_gc4_setf(a0_436);
	word32 a5_1028;
	int32 a0_453 = rf_pri_query_txgain_table(0x05, fp + -88, fp + -84, out a5_1028);
	ui32 a5_456 = dwArg84->dw0640;
	dwArg84->dw0640 = a5_456 << 20 & 0x00700000 | a5_456 & ~0x00700000;
	rf_tx_dvga_gain_qdb_gc5_setf(a0_453);
	word32 a5_1029;
	int32 a0_471 = rf_pri_query_txgain_table(0x06, fp + -88, fp + -84, out a5_1029);
	ui32 a5_474 = dwArg84->dw0640;
	dwArg84->dw0640 = a5_474 << 24 & 0x07000000 | a5_474 & ~0x07000000;
	rf_tx_dvga_gain_qdb_gc6_setf(a0_471);
	ui32 a5_491;
	int32 a0_489 = rf_pri_query_txgain_table(0x07, fp + -88, fp + -84, out a5_491);
	dwArg84->dw0640 = a5_491 << 28 & 0x70000000 | dwArg84->dw0640 & ~0x70000000;
	rf_tx_dvga_gain_qdb_gc7_setf(a0_489);
	word32 a5_1030;
	int32 a0_507 = rf_pri_query_txgain_table(0x08, fp + -88, fp + -84, out a5_1030);
	int32 a5_510 = dwArg84->dw0644;
	dwArg84->dw0644 = a5_510 & 0x07 | a5_510 & -8;
	rf_tx_dvga_gain_qdb_gc8_setf(a0_507);
	word32 a5_1031;
	int32 a0_523 = rf_pri_query_txgain_table(0x09, fp + -88, fp + -84, out a5_1031);
	int32 a5_526 = dwArg84->dw0644;
	dwArg84->dw0644 = a5_526 << 4 & 112 | a5_526 & -113;
	rf_tx_dvga_gain_qdb_gc9_setf(a0_523);
	word32 a5_1032;
	int32 a0_541 = rf_pri_query_txgain_table(0x0A, fp + -88, fp + -84, out a5_1032);
	int32 a2_544 = dwArg84->dw0644;
	*((word32) dwArg24 + 0x0644) = a2_544 << 8 & 0x0700 | a2_544 & -0x0701;
	rf_tx_dvga_gain_qdb_gc10_setf(a0_541);
	word32 a5_1033;
	int32 a0_559 = rf_pri_query_txgain_table(11, fp + -88, fp + -84, out a5_1033);
	ui32 a2_562 = *((word32) dwArg24 + 0x0644);
	*((word32) dwArg24 + 0x0644) = a2_562 << 0x0C & 0x07000000 | a2_562 & ~0x07000000;
	rf_tx_dvga_gain_qdb_gc11_setf(a0_559);
	word32 a5_1034;
	int32 a0_577 = rf_pri_query_txgain_table(0x0C, fp + -88, fp + -84, out a5_1034);
	ui32 a2_580 = *((word32) dwArg24 + 0x0644);
	*((word32) dwArg24 + 0x0644) = a2_580 << 16 & 0x00070000 | a2_580 & ~0x00070000;
	rf_tx_dvga_gain_qdb_gc12_setf(a0_577);
	word32 a5_1035;
	int32 a0_594 = rf_pri_query_txgain_table(0x0D, fp + -88, fp + -84, out a5_1035);
	ui32 a3_597 = *((word32) dwArg24 + 0x0644);
	s3->dw0644 = a3_597 << 20 & 0x00700000 | a3_597 & ~0x00700000;
	rf_tx_dvga_gain_qdb_gc13_setf(a0_594);
	word32 a5_1036;
	int32 a0_612 = rf_pri_query_txgain_table(0x0E, fp + -88, fp + -84, out a5_1036);
	int32 a4_615 = s3->dw0644;
	*((word32) dwArg64 + 0x0644) = a4_615 << 24 & 0x07000000 | a4_615 & ~0x07000000;
	rf_tx_dvga_gain_qdb_gc14_setf(a0_612);
	word32 a5_1037;
	int32 a0_630 = rf_pri_query_txgain_table(0x0F, fp + -88, fp + -84, out a5_1037);
	ui32 a5_633 = *((word32) dwArg64 + 0x0644);
	dwArg84->dw0644 = a5_633 << 28 & 0x70000000 | a5_633 & ~0x70000000;
	struct Eq_10943 * a5_645 = rf_tx_dvga_gain_qdb_gc15_setf(a0_630);
	struct Eq_10947 * s0_646 = a5_645->ptr0004;
	(a5_645 & ~0x00FFF800)->ptr0004 = s0_646;
	rf_fsm_st_dbg_en_setf(0x00);
	int32 a5_655 = s0_646->dw0268;
	s0_646->dw0268 = a5_655 & 0xF0000000 | 0x01000040;
	word32 a5_1038;
	struct Eq_10972 * a4_661 = rf_fsm_ctrl_en_setf(0x01, a5_655 & 0xF0000000, out a5_1038);
	struct Eq_10979 * s0_663 = a4_661->ptr000C;
	(a4_661 | 4)->ptr000C = s0_663;
	s0_663->dw0600 |= 0x80000000;
	int32 a4_673 = s0_663->dw0600;
	s0_663->dw0600 = a4_673 & ~0x7F000000;
	struct Eq_11005 * a4_677 = a4_673 & ~0x7F000000 | 32;
	a4_677->ptr000C = (a4_673 & ~0x7F000000)->ptr000C;
	struct Eq_11012 * s0_679 = a4_677->ptr000C;
	(a4_677 | 2)->ptr000C = s0_679;
	*(int32 *) 0x44C0C218 &= 0xF0000000;
	*(word32 *) 0x44C03030 = 0x00;
	*(word32 *) 0x0A027FB3 = 0x44C03000;
	*(word32 *) 589833039 = 0x44C03000;
	*(word32 *) 0x7F020A53 = 0x44C03000;
	*(word32 *) 191 = 0x44C03000;
	int32 a5_699 = s0_679->dw0220;
	s0_679->dw0220 = a5_699 & ~0x08000000;
	(a5_699 & ~0x08000000 & ~0x0C)->dw0004 = (a5_699 & ~0x08000000)->dw0004;
	int32 a5_708 = *(int32 *) 0x4000E41C;
	*(int32 *) 0x4000E41C = a5_708 & -65;
	wait_us(a5_708 & -65);
	ptr32 s0_714 = (a5_708 & -65)->ptr0004;
	ui32 a5_716 = a5_708 & -65 & ~0x0C;
	(a5_716 | 4)->ptr0004 = s0_714;
	ptr32 a4_721 = wait_us(a5_716 | 4);
	*(int32 *) 0x4000E41C |= 64;
	s0Out = s0_714;
	s1Out = dwArg28;
	a4Out = a4_721;
	s2Out = a5_633 & ~0x70000000;
	return dwArg68;
}

// 23003732: void rfc_rxdfe_set_notch0(Register ui32 a0, Register ui32 a1, Register int32 a2)
// Called from:
//      rf_set_channel
void rfc_rxdfe_set_notch0(ui32 a0, ui32 a1, int32 a2)
{
	*(int32 *) 0x40001700 = a1 & 0x07 | *((int32 *) 0x40001700) & ~0x07;
	*(int32 *) 0x40001700 = a2 << 8 & 0x0FFFFFFF | *((int32 *) 0x40001700) & 0xF00000FF;
	*(int32 *) 0x40001700 = a0 << 6 & 64 | *((int32 *) 0x40001700) & -65;
}

// 23003774: Register Eq_2 rfc_config_channel(Register Eq_2 ra, Register Eq_7726 a0, Register word32 s2, Register ptr32 fflags, Register ptr32 frm, Register out ptr32 s1Out, Register out ptr32 s4Out, Register out ptr32 fflagsOut, Register out ptr32 frmOut)
// Called from:
//      rf_set_channel
Eq_2 rfc_config_channel(Eq_2 ra, Eq_7726 a0, word32 s2, ptr32 fflags, ptr32 frm, ptr32 & s1Out, ptr32 & s4Out, ptr32 & fflagsOut, ptr32 & frmOut)
{
	int32 a5_13 = *(int32 *) 0x40001228;
	*(int32 *) 0x40001228 = a5_13 | 8;
	struct Eq_11153 * a5_22 = a5_13 | 8 | 64;
	a5_22->dw000C = (a5_13 | 8)->dw000C;
	(a5_22 | 0x0200)->dw000C = a5_22->dw000C;
	struct Eq_11172 * s0_27 = (a5_22 | 0x0200)->ptr000C;
	(a5_22 | 0x0200 | 1)->ptr000C = s0_27;
	s0_27->dw0264 = (word32) (word12) a0 | s0_27->dw0264 & 0xFF000000;
	struct Eq_5868 * a5_40 = s0_27->ptr0268 & ~0x20000000 | 0x00020000;
	s0_27->ptr0268 = a5_40;
	wait_us(a5_40);
	struct Eq_5868 * a5_45 = s0_27->ptr0268;
	s0_27->ptr0268 = a5_45 & ~0x20000000;
	wait_us(a5_45);
	struct Eq_5868 * a5_55;
	rf_fsm_ctrl_en_setf(0x00, a5_45, out a5_55);
	wait_us(a5_55);
	struct Eq_5868 * a5_63;
	rf_fsm_ctrl_en_setf(0x01, a5_55, out a5_63);
	wait_us(a5_63);
	struct Eq_5868 * a5_71 = s0_27->ptr026C & ~0x07 | 1;
	s0_27->ptr026C = a5_71;
	wait_us(a5_71);
	wait_us(rf_fsm_st_dbg_en_setf(0x01));
	struct Eq_5868 * a5_87 = s0_27->ptr026C & ~0x07 | 2;
	s0_27->ptr026C = a5_87;
	wait_us(a5_87);
	struct Eq_5868 * a5_95 = rf_fsm_st_dbg_en_setf(0x00);
	wait_us(a5_95);
	_print_channel_info(a5_95);
	rf_pri_update_param(a0);
	Eq_2 a1_122;
	Eq_2 a0_130;
	Eq_2 a1_131;
	ptr32 fflags_145;
	ptr32 frm_146;
	Eq_2 a0_161;
	Eq_2 a1_162;
	ptr32 fflags_176;
	ptr32 frm_177;
	struct Eq_11285 * s0_179;
	ptr32 s1_180;
	word32 s0_240;
	word32 s1_241;
	word32 a3_242;
	word32 s2_243;
	word32 s3_244;
	word32 s5_245;
	word32 s6_246;
	word32 s7_247;
	word32 s9_248;
	word32 a3_249;
	word32 s2_250;
	word32 s3_251;
	word32 s4_252;
	word32 s5_253;
	word32 s6_254;
	word32 s7_255;
	word32 s8_256;
	word32 s9_257;
	Eq_2 ra_178 = __muldf3(__divdf3(ra, __floatsidf(rf_pri_get_notch_param(a0, fp + ~0x14, fp + ~0x13), out a1_122), a1_122, g_t230AABD0, g_t230AABD4, fflags, frm, out s0_240, out s1_241, out a0_130, out a1_131, out a3_242, out s2_243, out s3_244, out s5_245, out s6_246, out s7_247, out s9_248, out fflags_145, out frm_146), a0_130, a1_131, g_t230AABD8, g_t230AABDC, fflags_145, frm_146, out s0_179, out s1_180, out a0_161, out a1_162, out a3_249, out s2_250, out s3_251, out s4_252, out s5_253, out s6_254, out s7_255, out s8_256, out s9_257, out fflags_176, out frm_177);
	Eq_2 a1_193;
	word32 a1_258;
	word32 a3_259;
	word32 a4_260;
	word32 a5_261;
	rfc_rxdfe_set_notch0((word32) SLICE(s2, byte, 24), 0x01, (int32) (byte) __fixdfsi(ra_178, __adddf3(ra_178, a0_161, a1_162, g_t230AA3C8, g_t230AA3CC, fflags_176, frm_177, out a1_193), a1_193, fflags_176, frm_177, out a1_258, out a3_259, out a4_260, out a5_261));
	s0_179->dw0228 &= ~0x08;
	s1Out = s1_180;
	s4Out = dwArg04;
	fflagsOut = fflags_176;
	frmOut = frm_177;
	return ra_178;
}

// 230038B6: void rfc_coex_force_to(Register word32 a0, Register ui32 a1, Register (ptr32 Eq_5868) a5)
// Called from:
//      cmd_wifi_coex_rf_force_on
void rfc_coex_force_to(word32 a0, ui32 a1, struct Eq_5868 * a5)
{
	struct Eq_5868 * a5_16;
	rf_fsm_ctrl_en_setf(0x00, a5, out a5_16);
	wait_us(a5_16);
	*(struct Eq_10212 **) 0x40001220 = a1 << 26 & 0x04000000 | *((struct Eq_10212 **) 0x40001220) & ~0x04000000;
	*(struct Eq_10212 **) 0x40001220 = (word32) (a0 != 0x00) << 27 | *((struct Eq_10212 **) 0x40001220) & ~0x08000000;
	wait_us((struct Eq_5868 *) 0x40001000);
	word32 a5_57;
	rf_fsm_ctrl_en_setf(0x01, (struct Eq_5868 *) 0x40001000, out a5_57);
}

// 23003916: Register Eq_11434 rfc_config_power_ble(Register Eq_11434 a0)
// Called from:
//      rf_txpwr_dec
//      rf_txpwr_inc
//      rf_reset
//      ble_controller_set_tx_pwr
Eq_11434 rfc_config_power_ble(Eq_11434 a0)
{
	if (a0 > 0x0F)
		return 0x00;
	ui32 s0_121;
	if (a0 <= 0x03)
	{
		rf_gc_tmx_setf(0x05, rf_gc_tbb_setf(0x02, rf_tmx_cs_setf(0x05, rf_pa_etb_en_setf.constprop.16(rf_pa_vbcore_setf(0x09, rf_pa_vbcas_setf(0x04, rf_pa_half_on_setf.constprop.17(rf_pa_ib_fix_setf(0x01, (struct Eq_9903 *) 0x03))))))));
		s0_121 = (a0 << 2) + ~0x11;
	}
	else if (a0 <= 0x06)
	{
		rf_gc_tmx_setf(0x07, rf_gc_tbb_setf(0x02, rf_tmx_cs_setf(0x05, rf_pa_etb_en_setf.constprop.16(rf_pa_vbcore_setf(0x09, rf_pa_vbcas_setf(0x04, rf_pa_half_on_setf.constprop.17(rf_pa_ib_fix_setf(0x01, (struct Eq_9903 *) 0x06))))))));
		s0_121 = (a0 << 2) + ~0x1D;
	}
	else
	{
		Eq_11478 s0_119;
		if (a0 <= 0x09)
		{
			rf_gc_tmx_setf(0x07, rf_gc_tbb_setf(0x03, rf_tmx_cs_setf(0x05, rf_pa_etb_en_setf.constprop.16(rf_pa_vbcore_setf(0x09, rf_pa_vbcas_setf(0x04, rf_pa_half_on_setf.constprop.17(rf_pa_ib_fix_setf(0x01, (struct Eq_9903 *) 0x09))))))));
			s0_119 = (word32) a0 - 0x0A;
		}
		else if (a0 <= 11)
		{
			rf_gc_tmx_setf(0x07, rf_gc_tbb_setf(0x04, rf_tmx_cs_setf(0x05, rf_pa_etb_en_setf.constprop.16(rf_pa_vbcore_setf(0x09, rf_pa_vbcas_setf(0x04, rf_pa_half_on_setf.constprop.17(rf_pa_ib_fix_setf(0x01, (struct Eq_9903 *) 11))))))));
			s0_119 = (word32) a0 - 0x0C;
		}
		else
		{
			rf_gc_tmx_setf(0x07, rf_gc_tbb_setf(0x06, rf_tmx_cs_setf(0x05, rf_pa_etb_en_setf.constprop.16(rf_pa_vbcore_setf(0x09, rf_pa_vbcas_setf(0x04, rf_pa_half_on_setf.constprop.17(rf_pa_ib_fix_setf(0x01, (struct Eq_9903 *) 11))))))));
			s0_119 = (word32) a0 - 0x0F;
		}
		s0_121 = s0_119 << 2;
	}
	ui32 s0_199 = s0_121 + ~0x00;
	*(int32 *) 0x40001648 = s0_199 & 0x007F | *((int32 *) 0x40001648) & -0x0080;
	*(int32 *) 0x40001648 = s0_199 << 0x08 & 0x07FFFF00 | *((int32 *) 0x40001648) & 0xF80000FF;
	*(int32 *) 0x40001648 = s0_199 << 16 & 0x007F0000 | *((int32 *) 0x40001648) & ~0x007F0000;
	return 0x01;
}

// 23003A8C: Register ui32 rfc_get_power_level(Register ui32 a0, Register Eq_2 a1, Register Eq_2 a3, Register out ptr32 a3Out, Register out ptr32 a4Out)
// Called from:
//      phy_get_rf_gain_idx
ui32 rfc_get_power_level(ui32 a0, Eq_2 a1, Eq_2 a3, ptr32 & a3Out, ptr32 & a4Out)
{
	word32 a1_10 = 0x00;
	if (a0 != 0x00)
	{
		a1_10 = 0x01;
		if (a0 != 0x01)
			a1_10 = 0x02;
	}
	ptr32 a3_21;
	ptr32 a4_22;
	ui32 a0_28 = rf_pri_get_txgain_index(a1, a1_10, a3, out a3_21, out a4_22) << 2;
	a3Out = a3_21;
	a4Out = a4_22;
	return a0_28;
}

// 23003AAE: void rfc_apply_tx_dvga(Register (ptr32 Eq_11645) a0)
// Called from:
//      rf_pri_tx_gain_comp
void rfc_apply_tx_dvga(struct Eq_11645 * a0)
{
	rf_tx_dvga_gain_qdb_gc0_setf((int32) a0->b0000);
	rf_tx_dvga_gain_qdb_gc1_setf((int32) a0->b0001);
	rf_tx_dvga_gain_qdb_gc2_setf((int32) a0->b0002);
	rf_tx_dvga_gain_qdb_gc3_setf((int32) a0->b0003);
	rf_tx_dvga_gain_qdb_gc4_setf((int32) a0->b0004);
	rf_tx_dvga_gain_qdb_gc5_setf((int32) a0->b0005);
	rf_tx_dvga_gain_qdb_gc6_setf((int32) a0->b0006);
	rf_tx_dvga_gain_qdb_gc7_setf((int32) a0->b0007);
	rf_tx_dvga_gain_qdb_gc8_setf((int32) a0->b0008);
	rf_tx_dvga_gain_qdb_gc9_setf((int32) a0->b0009);
	rf_tx_dvga_gain_qdb_gc10_setf((int32) a0->b000A);
	rf_tx_dvga_gain_qdb_gc11_setf((int32) a0->b000B);
	rf_tx_dvga_gain_qdb_gc12_setf((int32) a0->b000C);
	rf_tx_dvga_gain_qdb_gc13_setf((int32) a0->b000D);
	rf_tx_dvga_gain_qdb_gc14_setf((int32) a0->b000E);
	int32 a0_81 = (int32) a0->b000F;
	rf_tx_dvga_gain_qdb_gc15_setf(a0_81);
}

// 23003B3C: Register word32 rfc_apply_tx_power_offset(Register int32 a0, Register ptr32 a1, Stack Eq_2 dwArg44, Stack Eq_2 dwArg64, Stack (ptr32 Eq_7044) dwArg84, Stack (ptr32 Eq_7733) dwArgA4, Stack word32 dwArg0198, Register out Eq_7875 s2Out, Register out ptr32 s3Out)
// Called from:
//      phy_hw_set_channel
word32 rfc_apply_tx_power_offset(int32 a0, ptr32 a1, Eq_2 dwArg44, Eq_2 dwArg64, struct Eq_7044 * dwArg84, struct Eq_7733 * dwArgA4, word32 dwArg0198, union Eq_7875 & s2Out, ptr32 & s3Out)
{
	rf_pri_update_tx_power_offset(a0, a1);
	word32 a5_390;
	int32 a0_54 = rf_pri_query_txgain_table(0x00, fp + -56, fp + -52, out a5_390);
	int32 a5_57 = *(int32 *) 0x40001640;
	dwArgA4->dw0640 = a5_57 & 0x07 | a5_57 & -8;
	rf_tx_dvga_gain_qdb_gc0_setf(a0_54);
	word32 a5_391;
	int32 a0_76 = rf_pri_query_txgain_table(0x01, fp + -56, fp + -52, out a5_391);
	ui32 a5_79 = dwArgA4->dw0640;
	dwArgA4->dw0640 = a5_79 << 4 & 112 | a5_79 & -113;
	rf_tx_dvga_gain_qdb_gc1_setf(a0_76);
	word32 a5_392;
	int32 a0_100 = rf_pri_query_txgain_table(0x02, fp + -56, fp + -52, out a5_392);
	ui32 a5_103 = dwArgA4->dw0640;
	dwArgA4->dw0640 = a5_103 << 8 & 0x0700 | a5_103 & -0x0701;
	rf_tx_dvga_gain_qdb_gc2_setf(a0_100);
	word32 a5_393;
	int32 a0_121 = rf_pri_query_txgain_table(0x03, fp + -56, fp + -52, out a5_393);
	ui32 a5_124 = dwArgA4->dw0640;
	dwArgA4->dw0640 = a5_124 << 0x0C & 0x07000000 | a5_124 & ~0x07000000;
	rf_tx_dvga_gain_qdb_gc3_setf(a0_121);
	word32 a5_394;
	int32 a0_139 = rf_pri_query_txgain_table(0x04, fp + -56, fp + -52, out a5_394);
	ui32 a5_142 = dwArgA4->dw0640;
	dwArgA4->dw0640 = a5_142 << 16 & 0x00070000 | a5_142 & ~0x00070000;
	rf_tx_dvga_gain_qdb_gc4_setf(a0_139);
	word32 a5_395;
	int32 a0_156 = rf_pri_query_txgain_table(0x05, fp + -56, fp + -52, out a5_395);
	ui32 a5_159 = dwArgA4->dw0640;
	dwArgA4->dw0640 = a5_159 << 20 & 0x00700000 | a5_159 & ~0x00700000;
	rf_tx_dvga_gain_qdb_gc5_setf(a0_156);
	word32 a5_396;
	int32 a0_174 = rf_pri_query_txgain_table(0x06, fp + -56, fp + -52, out a5_396);
	ui32 a5_177 = dwArgA4->dw0640;
	dwArgA4->dw0640 = a5_177 << 24 & 0x07000000 | a5_177 & ~0x07000000;
	rf_tx_dvga_gain_qdb_gc6_setf(a0_174);
	ui32 a5_194;
	int32 a0_192 = rf_pri_query_txgain_table(0x07, fp + -56, fp + -52, out a5_194);
	dwArgA4->dw0640 = a5_194 << 28 & 0x70000000 | dwArgA4->dw0640 & ~0x70000000;
	rf_tx_dvga_gain_qdb_gc7_setf(a0_192);
	word32 a5_397;
	int32 a0_210 = rf_pri_query_txgain_table(0x08, fp + -56, fp + -52, out a5_397);
	int32 a5_213 = dwArgA4->dw0644;
	dwArgA4->dw0644 = a5_213 & 0x07 | a5_213 & -8;
	rf_tx_dvga_gain_qdb_gc8_setf(a0_210);
	word32 a5_398;
	int32 a0_226 = rf_pri_query_txgain_table(0x09, fp + -56, fp + -52, out a5_398);
	int32 a2_229 = dwArgA4->dw0644;
	*((word32) dwArg44 + 0x0644) = a2_229 << 4 & 112 | a2_229 & -113;
	rf_tx_dvga_gain_qdb_gc9_setf(a0_226);
	word32 a5_399;
	int32 a0_244 = rf_pri_query_txgain_table(0x0A, fp + -56, fp + -52, out a5_399);
	ui32 a2_247 = *((word32) dwArg44 + 0x0644);
	*((word32) dwArg44 + 0x0644) = a2_247 << 8 & 0x0700 | a2_247 & -0x0701;
	rf_tx_dvga_gain_qdb_gc10_setf(a0_244);
	word32 a5_400;
	int32 a0_262 = rf_pri_query_txgain_table(11, fp + -56, fp + -52, out a5_400);
	ui32 a2_265 = *((word32) dwArg44 + 0x0644);
	*((word32) dwArg44 + 0x0644) = a2_265 << 0x0C & 0x07000000 | a2_265 & ~0x07000000;
	rf_tx_dvga_gain_qdb_gc11_setf(a0_262);
	word32 a5_401;
	int32 a0_280 = rf_pri_query_txgain_table(0x0C, fp + -56, fp + -52, out a5_401);
	ui32 a2_283 = *((word32) dwArg44 + 0x0644);
	*((word32) dwArg44 + 0x0644) = a2_283 << 16 & 0x00070000 | a2_283 & ~0x00070000;
	rf_tx_dvga_gain_qdb_gc12_setf(a0_280);
	word32 a5_402;
	int32 a0_297 = rf_pri_query_txgain_table(0x0D, fp + -56, fp + -52, out a5_402);
	ui32 a3_300 = *((word32) dwArg44 + 0x0644);
	*((word32) dwArg64 + 0x0644) = a3_300 << 20 & 0x00700000 | a3_300 & ~0x00700000;
	rf_tx_dvga_gain_qdb_gc13_setf(a0_297);
	word32 a5_403;
	int32 a0_315 = rf_pri_query_txgain_table(0x0E, fp + -56, fp + -52, out a5_403);
	ui32 a4_318 = *((word32) dwArg64 + 0x0644);
	dwArg84->dw0644 = a4_318 << 24 & 0x07000000 | a4_318 & ~0x07000000;
	rf_tx_dvga_gain_qdb_gc14_setf(a0_315);
	word32 a5_404;
	int32 a0_333 = rf_pri_query_txgain_table(0x0F, fp + -56, fp + -52, out a5_404);
	ui32 a5_336 = dwArg84->dw0644;
	dwArgA4->dw0644 = a5_336 << 28 & 0x70000000 | a5_336 & ~0x70000000;
	rf_tx_dvga_gain_qdb_gc15_setf(a0_333);
	0x00 = dwArg0198;
	s2Out = a5_336 & ~0x70000000;
	s3Out = 0x07000000;
	return 0x70000000;
}

