pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0000.c
// 23003E06: Register int32 rf_pri_set_gain_table_regs()
// Called from:
//      rf_pri_update_tx_power_offset
//      rf_pri_init
int32 rf_pri_set_gain_table_regs()
{
	*(int32 *) 0x40001118 = ((g_dw42011D68 << 24 | (g_dw42011D6C << 16 | (g_dw42011D98 << 0x0E | (g_dw42011D9C << 0x0C | (g_dw42011DA0 << 8 | (*((int32 *) 0x40001118) & ~0x1F | g_dw42011DA4) & -0x0701) & ~0x03000000) & ~0x0C000000) & ~0x001F0000) & ~0x07000000) & ~0x30000000 | g_dw42011D64 << 28) & 0x3FFFFFFF | g_dw42011D60 << 30;
	struct Eq_12223 * a3_83 = (g_dw42011CF4 << 28 | (g_dw42011CF8 << 24 | (g_dw42011CFC << 16 | (g_dw42011D28 << 0x0E | (g_dw42011D2C << 0x0C | (g_dw42011D30 << 8 | (*((struct Eq_12223 **) 0x4000111C) & ~0x1F | g_dw42011D34) & -0x0701) & ~0x03000000) & ~0x0C000000) & ~0x001F0000) & ~0x07000000) & ~0x30000000) & 0x3FFFFFFF | g_dw42011CF0 << 30;
	*(struct Eq_12223 **) 0x4000111C = a3_83;
	struct Eq_12282 * a5_87 = a3_83->ptr0070;
	struct Eq_12286 * a2_102 = a5_87->dw00A8 << 0x0E | (a5_87->dw00AC << 0x0C | (a5_87->dw00B0 << 8 | (*((int32 *) 0x40001120) & ~0x1F | g_dw42011CC4) & -0x0701) & ~0x03000000) & ~0x0C000000;
	struct Eq_12318 * a5_104 = a2_102->ptr007C;
	ui32 a6_110 = a5_104->dw0078 << 24 | (a2_102 << 16 | a2_102 & ~0x001F0000) & ~0x07000000;
	*(int32 *) 0x40001120 = a3_83 << 30 | (a5_104->dw0074 << 28 | a6_110 & ~0x30000000) & 0x3FFFFFFF;
	ui32 a1_126 = (*(int32 *) 0x40001124 & -32 | 0xFFE10000) & -0x0701 | 0xE1000000;
	struct Eq_12362 * a3_141 = (a3_83 << 46 | ((a1_126 & ~0x03000000) << 0x0E | (a1_126 & ~0x03000000) & ~0x0C000000) & ~0x001F0000) & ~0x07000000 | (a6_110 & ~0x30000000) << 24;
	int32 a3_149 = (a3_141 << 28 | a3_141 & ~0x30000000) & 0x3FFFFFFF | *a3_141->ptr0004 << 30;
	*(int32 *) 0x40001124 = a3_149;
	return a3_149;
}

// 23003FD0: Register Eq_2 rf_pri_manu_pu(Register up32 a0, Register (ptr32 Eq_12403) a4, Register out Eq_2 a5Out)
// Called from:
//      rf_pri_txcal
//      rf_pri_roscal
//      rf_pri_rccal
//      rf_pri_lo_acal
//      rf_pri_fcal
Eq_2 rf_pri_manu_pu(up32 a0, struct Eq_12403 * a4, union Eq_2 & a5Out)
{
	Eq_2 a5_11;
	Eq_2 a3_21;
	ui32 a4_14;
	word32 a3_15;
	struct Eq_12409 * a5_5 = a4->ptr0004;
	(a4 & ~0x02)->ptr0004 = a5_5;
	a5_5->dw000C = 0x00;
	if (a0 != 0x05)
	{
		if (a0 > 0x05)
		{
			if (a0 > 0x07)
				goto l23003FEE;
			a5_11 = *(union Eq_2 *) 55;
			a4_14 = 0x07;
			a3_21.u0 = 0x00F00000;
l23004022:
			(a4_14 | a3_21)->t0030 = a5_11;
			a5Out = a5_11;
			return a3_21;
		}
		if (a0 != 0x04)
		{
l23003FEE:
			Eq_2 a3_39 = a5_5->t0030;
			Eq_2 a5_45 = a5_5 & 0x2DF0FEFF | 0x25F06E00;
			*((word32) a5_45 + 48) = a3_39;
			a5Out = a5_45;
			return a3_39;
		}
		a5_11 = *(union Eq_2 *) 0x34;
		a4_14 = 0x04;
		a3_15 = 0x24F87000;
	}
	else
	{
		a5_11 = *(union Eq_2 *) 0x35;
		a4_14 = 0x05;
		a3_15 = 0xC6FF7000;
	}
	a3_21 = a3_15 + -0x0800;
	goto l23004022;
}

// 23004050: Register int32 rf_pri_save_state_for_cal(Register (ptr32 Eq_12461) a3)
// Called from:
//      rf_pri_txcal
//      rf_pri_roscal
//      rf_pri_rccal
//      rf_pri_lo_acal
//      rf_pri_fcal
int32 rf_pri_save_state_for_cal(struct Eq_12461 * a3)
{
	g_ptr4200F2C0 = a3;
	g_ptr4200F2CC = a3;
	g_ptr4200F2C8 = a3;
	struct Eq_12468 * a5_14 = a3->ptr0030;
	g_ptr4200F2B8 = a3;
	g_dw4200F2B0 = a5_14->dw00B8;
	g_dw4200F2D4 = a5_14->dw00C0;
	g_dw4200F2D8 = a5_14->dw00C4;
	g_dw4200F2BC = a5_14->dw0084;
	g_dw4200F29C = a5_14->dw008C;
	g_dw4200F2A0 = a5_14->dw0600;
	g_dw4200F2A4 = a5_14->dw060C;
	g_ptr4200F2A8 = a5_14->ptr0618;
	Eq_12514 a3_41 = a5_14->t061C;
	g_t4200F2AC = a3_41;
	struct Eq_12520 * a5_44 = *((word32) a3_41 + 72);
	g_t4200F2FC = a3_41;
	g_dw4200F2DC = a5_44->dw020C;
	g_dw4200F2E0 = a5_44->dw0214;
	g_t4200F2E4 = a5_44->t0218;
	g_dw4200F2E8 = a5_44->dw023C;
	g_dw4200F2EC = a5_44->dw0240;
	g_dw4200F2F0 = a5_44->dw0244;
	struct Eq_12556 * a3_65 = a5_44->ptr00F0;
	g_ptr4200F2C4 = a3_65;
	g_ptr4200F2B4 = a3_65;
	struct Eq_12564 * a5_71 = a3_65->ptr0058;
	g_ptr4200F2F8 = a3_65;
	struct Eq_10212 * a3_74 = a5_71->ptr0220;
	g_ptr4200F2D0 = a3_74;
	struct Eq_12576 * a5_77 = a3_74->ptr0070;
	g_ptr4200F2F4 = a3_74;
	int32 a4_80 = a5_77->dw00A4;
	g_dw4200F300 = a4_80;
	return a4_80;
}

// 2300417E: Register word32 rf_pri_restore_state_for_cal()
// Called from:
//      rf_pri_txcal
//      rf_pri_roscal
//      rf_pri_rccal
//      rf_pri_lo_acal
//      rf_pri_fcal
word32 rf_pri_restore_state_for_cal()
{
	g_ptr4200F2C0->dw0004 = 0x40001000;
	g_ptr4200F2CC->dw000C = 0x40001000;
	g_ptr4200F2C8->dw001C = 0x40001000;
	g_ptr4200F2B8->ptr0030 = (struct Eq_12468 *) 0x40001000;
	*(int32 *) 0x400010B8 = g_dw4200F2B0;
	*(int32 *) 0x400010C0 = g_dw4200F2D4;
	*(int32 *) 0x400010C4 = g_dw4200F2D8;
	*(int32 *) 0x40001084 = g_dw4200F2BC;
	*(int32 *) 0x4000108C = g_dw4200F29C;
	*(int32 *) 0x40001600 = g_dw4200F2A0;
	*(int32 *) 0x4000160C = g_dw4200F2A4;
	*(ptr32 **) 0x40001618 = g_ptr4200F2A8;
	*(union Eq_12514 *) 0x4000161C = g_t4200F2AC;
	*((word32) g_t4200F2FC + 72) = (struct Eq_12520 *) 0x40001000;
	*(int32 *) 0x4000120C = g_dw4200F2DC;
	*(int32 *) 0x40001214 = g_dw4200F2E0;
	*(union Eq_12538 *) 0x40001218 = g_t4200F2E4;
	*(int32 *) 0x4000123C = g_dw4200F2E8;
	*(int32 *) 0x40001240 = g_dw4200F2EC;
	*(int32 *) 0x40001244 = g_dw4200F2F0;
	*(struct Eq_12556 **) 0x400010F0 = g_ptr4200F2C4;
	g_ptr4200F2B4->dw0064 = 0x40001000;
	g_ptr4200F2F8->ptr0058 = (struct Eq_12564 *) 0x40001000;
	*(struct Eq_10212 **) 0x40001220 = g_ptr4200F2D0;
	g_ptr4200F2F4->ptr0070 = (struct Eq_12576 *) 0x40001000;
	*(int32 *) 0x400010A4 = g_dw4200F300;
	return 0x40001000;
}

// 230042AC: void rf_pri_singen_start()
// Called from:
//      rf_pri_rccal_iq
//      rf_pri_txcal
void rf_pri_singen_start()
{
	*(int32 *) 0x4000120C &= 0x7FFFFFFF;
	*(int32 *) 0x4000120C |= 0x80000000;
}

// 230042CE: Register ui32 rf_pri_pm_pwr(Register out ptr32 a2Out, Register out ptr32 a3Out, Register out Eq_12725 a5Out)
// Called from:
//      rf_pri_txcal_search_core
//      rf_pri_rccal_iq
ui32 rf_pri_pm_pwr(ptr32 & a2Out, ptr32 & a3Out, union Eq_12725 & a5Out)
{
	*(ptr32 **) 0x40001618 &= ~0x20100000;
	*(ptr32 **) 0x40001618 |= 0x20100000;
	do
	{
		ptr32 * a4_16 = *(ptr32 **) 0x40001618;
	} while (a4_16 << 0x03 >= 0x00);
	int32 a5_25 = *(int32 *) 0x40001624 << 7 >> 16;
	ptr32 a2_21 = *a4_16;
	int32 a0_24 = *(int32 *) 0x40001620 << 7 >> 16;
	*(a4_16 & ~0x20100000) = a2_21;
	a2Out = a2_21;
	a3Out = ~0x20100000;
	a5Out = a5_25 * 0x02;
	return a0_24 * 0x02 + a5_25 * 0x02;
}

// 23004328: Register word32 rf_pri_start_txdfe(Register out ptr32 a5Out)
// Called from:
//      rf_pri_rccal_iq
//      rf_pri_txcal
//      rf_pri_init
word32 rf_pri_start_txdfe(ptr32 & a5Out)
{
	*(struct Eq_10212 **) 0x40001220 &= -0x0181;
	*(struct Eq_10212 **) 0x40001220 = *(struct Eq_10212 **) 0x40001220 & ~0x01FFF800 | 0x01000082;
	*(struct Eq_10212 **) 0x40001220 |= 0x0100;
	a5Out = 0x40001000;
	return 0x01000082;
}

