pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0000.c
// 2300435E: Register int32 rf_pri_pm_pwr_avg(Register int32 a0, Register int32 a1, Register out ptr32 a3Out, Register out (ptr32 Eq_12802) a5Out)
// Called from:
//      rf_pri_rccal_iq
//      rf_pri_roscal_iq.isra.3
//      rf_pri_txcal
int32 rf_pri_pm_pwr_avg(int32 a0, int32 a1, ptr32 & a3Out, struct Eq_12802 & a5Out)
{
	*(ptr32 **) 0x40001618 &= ~0x20100000;
	*(union Eq_12514 *) 0x4000161C = a1 << 16 | (word32) (*((union Eq_12514 *) 0x4000161C));
	*(ptr32 **) 0x40001618 |= 0x20000000;
	do
		;
	while (*(ptr32 **) 0x40001618 << 0x03 >= 0x00);
	int32 a0_27;
	if (a0 != 0x00)
		a0_27 = *(int32 *) 0x40001620;
	else
		a0_27 = *(int32 *) 0x40001624;
	ptr32 * a5_31 = *(ptr32 **) 0x40001618;
	*(ptr32 **) 0x40001618 = a5_31 & ~0x20100000;
	a3Out = 0x40001000;
	a5Out = a5_31 & ~0x20100000;
	return (int32) (word25) a0_27;
}

// 230043C2: Register int32 rf_pri_txcal_config_hw(Register ui32 a2, Register out ptr32 a5Out)
// Called from:
//      rf_pri_txcal
//      rf_pri_init
int32 rf_pri_txcal_config_hw(ui32 a2, ptr32 & a5Out)
{
	uint32 a2_14 = a2 & 63 | *((int32 *) 0x40001180) & -64;
	ui32 a2_22 = (a2_14 >> 6 & 63) << 8 | a2_14 & 0xFC0000FF;
	int32 a2_35 = ((a2_22 & ~0x003F0000) >> 6 & 63) << 24 | (a2_22 & ~0x003F0000) & ~0x3F000000;
	*(int32 *) 0x40001180 = a2_35;
	struct Eq_12883 * a2_42 = a2_35 & 63 | *((int32 *) 0x40001184) & -64;
	struct Eq_12891 * a1_44 = a2_42->ptr0078;
	*(int32 *) 0x40001184 = (a1_44->t0080 >> 6 & 63) << 24 | (((a2_42 >> 6 & 63) << 8 | a2_42 & 0xFC0000FF) & ~0x003F0000 | (a1_44->t0080 & 63) << 16) & ~0x3F000000;
	struct Eq_12928 * t1_61 = g_ptr4200EB1C;
	*(int32 *) 0x40001188 = (t1_61->t0090 >> 6 & 63) << 24 | (((t1_61->t0088 >> 6 & 63) << 8 | (t1_61->t0088 & 63 | *((int32 *) 0x40001188) & -64) & 0xFC0000FF) & ~0x003F0000 | (t1_61->t0090 & 63) << 16) & ~0x3F000000;
	struct Eq_12928 * a1_86 = g_ptr4200EB1C;
	*(int32 *) 0x4000118C = (a1_86->t00A0 >> 6 & 63) << 24 | (((a1_86->t0098 >> 6 & 63) << 8 | (a1_86->t0098 & 63 | *((int32 *) 0x4000118C) & -64) & 0xFC0000FF) & ~0x003F0000 | (a1_86->t00A0 & 63) << 16) & ~0x3F000000;
	Eq_13026 a3_110 = *(union Eq_13026 *) 0x40001190;
	*(union Eq_13026 *) 0x40001190 = ((a3_110 >> 0x0C & 0x07FF) << 16 | a3_110 & ~0x07FF0000) & -0x0400 | (a3_110 & ~0x07FF0000) & 0x03FF;
	Eq_13046 a3_124 = *(union Eq_13046 *) 0x40001194;
	*(union Eq_13046 *) 0x40001194 = ((a3_124 >> 0x0C & 0x07FF) << 16 | a3_124 & ~0x07FF0000) & -0x0400 | (a3_124 & ~0x07FF0000) & 0x03FF;
	Eq_13066 a3_137 = *(union Eq_13066 *) 0x40001198;
	*(union Eq_13066 *) 0x40001198 = ((a3_137 >> 0x0C & 0x07FF) << 16 | a3_137 & ~0x07FF0000) & -0x0400 | (a3_137 & ~0x07FF0000) & 0x03FF;
	struct Eq_12928 * a0_151 = g_ptr4200EB1C;
	*(int32 *) 0x4000119C = ((a0_151->t0080 >> 0x0C & 0x07FF) << 16 | *((int32 *) 0x4000119C) & ~0x07FF0000) & -0x0400 | a0_151->dw0084 & 0x03FF;
	struct Eq_12928 * a0_164 = g_ptr4200EB1C;
	*(int32 *) 0x400011A0 = ((a0_164->t0088 >> 0x0C & 0x07FF) << 16 | *((int32 *) 0x400011A0) & ~0x07FF0000) & -0x0400 | a0_164->dw008C & 0x03FF;
	struct Eq_12928 * a0_177 = g_ptr4200EB1C;
	*(int32 *) 0x400011A4 = ((a0_177->t0090 >> 0x0C & 0x07FF) << 16 | *((int32 *) 0x400011A4) & ~0x07FF0000) & -0x0400 | a0_177->dw0094 & 0x03FF;
	struct Eq_12928 * a0_190 = g_ptr4200EB1C;
	*(int32 *) 0x400011A8 = ((a0_190->t0098 >> 0x0C & 0x07FF) << 16 | *((int32 *) 0x400011A8) & ~0x07FF0000) & -0x0400 | a0_190->dw009C & 0x03FF;
	struct Eq_12928 * a3_204 = g_ptr4200EB1C;
	int32 a4_213 = ((a3_204->t00A0 >> 0x0C & 0x07FF) << 16 | *((int32 *) 0x400011AC) & ~0x07FF0000) & -0x0400 | a3_204->dw00A4 & 0x03FF;
	*(int32 *) 0x400011AC = a4_213;
	a5Out = 0x40001000;
	return a4_213;
}

// 23004664: Register Eq_2 rf_pri_fcal_meas(Register Eq_2 ra, Register Eq_13224 s0, Register Eq_13224 a0, Register out Eq_13226 a0Out, Register out Eq_13227 a3Out)
// Called from:
//      rf_pri_fcal
Eq_2 rf_pri_fcal_meas(Eq_2 ra, Eq_13224 s0, Eq_13224 a0, union Eq_13226 & a0Out, union Eq_13227 & a3Out)
{
	int32 a5_9 = *(int32 *) 0x400010A0;
	*(int32 *) 0x400010A0 = a0 | a5_9 & -0x0100;
	struct Eq_13236 * s0_17;
	Eq_2 ra_18;
	g_t4200C506();
	s0_17->dw00AC |= 16;
	do
	{
		Eq_13227 a3_30 = *(union Eq_13227 *) 0x400010AC;
	} while (a3_30 << 11 >= 0x00);
	Eq_13226 a0_35 = *(union Eq_13256 *) 0x400010A8 >> 16;
	*(*(union Eq_13227 *) 0x400010AC & ~0x10) = 0x400010AC;
	a0Out = a0_35;
	a3Out = a3_30;
	return ra_18;
}

// 230046BE: Register word32 rf_pri_rccal_config.part.0(Register Eq_13268 a0)
// Called from:
//      rf_pri_rccal_config
//      rf_pri_rccal
word32 rf_pri_rccal_config.part.0(Eq_13268 a0)
{
	*(int32 *) 0x40001080 = a0 << 8 | (a0 << 0x18 | *((int32 *) 0x40001080) & ~0x3F000000) & 0xFC0000FF;
	return 0x40001000;
}

// 230046E6: Register word32 rf_pri_rccal_config(Register ptr32 a0, Register Eq_13268 a1)
// Called from:
//      rf_pri_rccal_iq
//      rf_pri_rccal
word32 rf_pri_rccal_config(ptr32 a0, Eq_13268 a1)
{
	if (a0 != 0x00)
		return rf_pri_rccal_config.part.0(a1);
	*(int32 *) 0x40001080 = (a1 << 0x10 | *((int32 *) 0x40001080) & ~0x003F0000) & -64 | a1;
	return 0x40001000;
}

// 23004710: Register Eq_2 rf_pri_txcal_config(Register word32 a0, Register Eq_2 a1, Register out Eq_2 a3Out, Register out ptr32 a4Out)
// Called from:
//      rf_pri_txcal_search_core
//      rf_pri_txcal
Eq_2 rf_pri_txcal_config(word32 a0, Eq_2 a1, union Eq_2 & a3Out, ptr32 & a4Out)
{
	if (a0 == 0x02)
	{
		ui32 a1_39 = a1 << 0x0C | *((int32 *) 0x40001600) & ~0x007FF000;
		*(int32 *) 0x40001600 = a1_39 | 0x00800000;
		a3Out.u0 = 0x40001000;
		a4Out = ~0x007FF000;
		return a1_39 | 0x00800000;
	}
	if (a0 == 0x03)
	{
		if (a1 < 0x00)
			a1 = (word32) a1 + 0x0400;
		ui32 a1_30 = a1 | *((int32 *) 0x40001600) & -0x0400;
		*(int32 *) 0x40001600 = a1_30 | 0x0400;
		a3Out = a3;
		a4Out = 0x40001000;
		return a1_30 | 0x0400;
	}
	ui32 a5_11;
	ui32 a1_13;
	if (a0 == 0x00)
	{
		a3 = *(union Eq_2 *) 115;
		a4 = ~0x3F000000;
		a5_11 = 0x03;
		a1_13 = a1 << 24;
	}
	else
	{
		if (a0 != 0x01)
			goto l23004772;
		a3 = *(union Eq_2 *) 113;
		a4 = ~0x003F0000;
		a5_11 = 0x01;
		a1_13 = a1 << 16;
	}
	a1 = a1_13 | a5_11;
	*((word32) a1 + 112) = a3;
l23004772:
	a3Out = a3;
	a4Out = a4;
	return a1;
}

// 2300478C: Register word32 rf_pri_txcal_search_core(Register (ptr32 Eq_13369) s0, Register ui32 s1, Register word32 a0, Register Eq_2 a1, Register int32 a2, Register word32 s4, Register word32 s5, Register word32 s6, Register word32 s7, Register word32 s8, Register Eq_2 s9, Register int32 s11, Stack Eq_2 dwArg010C, Register out ptr32 s0Out, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out ptr32 a5Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out Eq_13388 s6Out, Register out Eq_13389 s7Out, Register out ptr32 s8Out, Register out Eq_13389 s9Out, Register out Eq_2 s11Out)
// Called from:
//      rf_pri_txcal
word32 rf_pri_txcal_search_core(struct Eq_13369 * s0, ui32 s1, word32 a0, Eq_2 a1, int32 a2, word32 s4, word32 s5, word32 s6, word32 s7, word32 s8, Eq_2 s9, int32 s11, Eq_2 dwArg010C, ptr32 & s0Out, ptr32 & s1Out, ptr32 & a0Out, ptr32 & a5Out, ptr32 & s4Out, ptr32 & s5Out, union Eq_13388 & s6Out, union Eq_13389 & s7Out, ptr32 & s8Out, union Eq_13389 & s9Out, union Eq_2 & s11Out)
{
	word32 a3_40;
	ui32 a3_46;
	word32 s10_185;
	ptr32 s2_203;
	ptr32 s3_177;
	g_t4200C506();
	*(ptr32 **) 0x40001618 = a3_46 << 0x0A | *((ptr32 **) 0x40001618) & 0xFFF00000;
	word32 a3_393;
	word32 a5_394;
	word32 a2_164;
	Eq_2 s11_159 = rf_pri_pm_pwr(out a2_164, out a3_393, out a5_394);
	ptr32 s4_179 = 0x01;
	ptr32 s5_180 = 0x02;
	Eq_13388 s6_181 = -0x0200;
	Eq_13389 s7_182 = 511;
	Eq_13389 s8_103 = 0x07FF;
	Eq_13389 s9_108 = 63;
	do
	{
		Eq_13388 s0_101 = s2_203 - s10_185;
		Eq_13389 s1_100 = s2_203 + s10_185;
		if (s4_179 >= s3_177)
		{
			if (s0_101 < 0x00)
				s0_101.u0 = 0x00;
			if (s9_108 < s1_100)
				s1_100.u0 = 63;
		}
		else if (s3_177 == s5_180)
		{
			if (s0_101 < 0x00)
				s0_101.u0 = 0x00;
			if (s8_103 < s1_100)
				s1_100.u0 = 0x07FF;
		}
		else
		{
			if (s0_101 < s6_181)
				s0_101.u0 = -0x0200;
			if (s7_182 < s1_100)
				s1_100.u0 = 511;
		}
		word32 a3_123;
		word32 s2_176;
		Eq_2 s11_186;
		ptr32 s0_189;
		word32 s1_190;
		g_t4200C506();
		word32 a3_396;
		ptr32 a5_201;
		Eq_2 a0_197 = rf_pri_pm_pwr(out a2_164, out a3_396, out a5_201);
		if (a0_197 >= s11_186)
		{
			word32 a3_208;
			ptr32 s1_229;
			g_t4200C506();
			word32 a3_398;
			Eq_2 a0_236 = rf_pri_pm_pwr(out a2_164, out a3_398, out a5_201);
			if (a0_236 < s11_159)
			{
				s11_159 = a0_236;
				s2_203 = s1_229;
			}
		}
		else
		{
			s11_159 = a0_197;
			s2_203 = s0_189;
		}
	} while (s10_185 != 0x00);
	0x00 = (int8) dwArg010C;
	s0Out = dwArgCC;
	s1Out = dwLoc4C;
	a0Out = s2_203;
	a5Out = a5_201;
	s4Out = dwArg0168;
	s5Out = s5_180;
	s6Out = s6_181;
	s7Out = s7_182;
	s8Out = dwArg0148;
	s9Out = s9_108;
	s11Out = s11_159;
	return dwLoc08;
}

// 23004896: Register word32 rf_pri_singen_config.constprop.8(Register int32 a0, Register out Eq_12538 a4Out)
// Called from:
//      rf_pri_rccal_iq
//      rf_pri_txcal
word32 rf_pri_singen_config.constprop.8(int32 a0, union Eq_12538 & a4Out)
{
	*(int32 *) 0x4000120C = a0 << 16 | *((int32 *) 0x4000120C) & ~0x03FF0000;
	*(int32 *) 0x40001214 &= 0x003FFFFF;
	Eq_12538 a4_21 = *(union Eq_12538 *) 0x40001218 & 0x003FFFFF | 0xC0000000;
	*(union Eq_12538 *) 0x40001218 = a4_21;
	a4Out = a4_21;
	return 0xC0000000;
}

// 230048D4: Register Eq_2 rf_pri_rccal_iq(Register Eq_2 ra, Register int32 a0, Register ptr32 fflags, Register ptr32 frm, Stack Eq_2 dwArgA8, Register out ptr32 a0Out, Register out ptr32 a3Out, Register out ptr32 s2Out, Register out ptr32 fflagsOut, Register out ptr32 frmOut)
// Called from:
//      rf_pri_rccal
Eq_2 rf_pri_rccal_iq(Eq_2 ra, int32 a0, ptr32 fflags, ptr32 frm, Eq_2 dwArgA8, ptr32 & a0Out, ptr32 & a3Out, ptr32 & s2Out, ptr32 & fflagsOut, ptr32 & frmOut)
{
	int32 a4_29;
	int32 a4_21 = *(int32 *) 0x4000160C;
	if (a0 != 0x00)
	{
		*(int32 *) 0x4000160C = a4_21 & -0x0401;
		a4_29 = *(int32 *) 0x4000160C | 0x04000000;
	}
	else
	{
		*(int32 *) 0x4000160C = a4_21 | 0x0400;
		a4_29 = *(int32 *) 0x4000160C & ~0x04000000;
	}
	*(int32 *) 0x4000160C = a4_29;
	struct Eq_13556 * s0_38 = *(struct Eq_13556 **) 0x40001048;
	*(struct Eq_13556 **) 0x43001148 = s0_38;
	word32 a4_416;
	rf_pri_singen_config.constprop.8(0x03, out a4_416);
	s0_38->dw0214 = s0_38->dw0214 & -0x0800 | 0x03FF;
	s0_38->dw0218 = s0_38->dw0218 & -0x0800 | 0x03FF;
	rf_pri_singen_start();
	word32 a5_417;
	rf_pri_start_txdfe(out a5_417);
	s0_38->dw0618 = s0_38->dw0618 & 0xFFF00000 | 0x00FFFC00;
	word32 a3_418;
	word32 a5_419;
	rf_pri_pm_pwr_avg(a0, 0x0400, out a3_418, out a5_419);
	Eq_2 a1_87;
	Eq_2 a0_100;
	uint32 a1_101;
	ptr32 fflags_115;
	ptr32 frm_116;
	ui32 s1_119;
	ptr32 s2_120;
	ui32 s4_122;
	word32 s8_429;
	word32 s9_430;
	word32 s0_423;
	word32 a3_424;
	word32 s3_425;
	word32 s6_427;
	word32 s7_428;
	word32 s5_426;
	word32 a3_421;
	word32 a5_422;
	word32 a2_420;
	Eq_2 ra_117 = __muldf3(ra, __floatunsidf(rf_pri_pm_pwr(out a2_420, out a3_421, out a5_422), out a1_87), a1_87, g_t230AAD00, g_t230AAD04, fflags, frm, out s0_423, out s1_119, out a0_100, out a1_101, out a3_424, out s2_120, out s3_425, out s4_122, out s5_426, out s6_427, out s7_428, out s8_429, out s9_430, out fflags_115, out frm_116);
	struct Eq_13662 * a4_132;
	Eq_2 a0_128 = __fixunsdfsi(ra_117, a0_100, a1_101, fflags_115, frm_116, out a4_132);
	struct Eq_13667 * s0_134 = a4_132->ptr0048;
	(a4_132 & s1_119 | 0x06000200)->ptr0048 = s0_134;
	word32 a4_431;
	rf_pri_singen_config.constprop.8(181, out a4_431);
	rf_pri_singen_start();
	word32 a5_432;
	rf_pri_start_txdfe(out a5_432);
	s0_134->dw0618 = s0_134->dw0618 & s4_122 | 0x0002D400;
	Eq_13268 s1_160 = 0x00;
	ui32 s0_161;
	Eq_13547 s4_162 = 32;
	for (s0_161 = 0x06; s0_161 != 0x00; s0_161 += ~0x00)
	{
		word32 s5_165 = s4_162 + s1_160;
		rf_pri_rccal_config(s2_120, s5_165);
		word32 a5_435;
		word32 a2_433;
		word32 a3_434;
		if (a0_128 < rf_pri_pm_pwr(out a2_433, out a3_434, out a5_435))
			s1_160 = s5_165;
		s4_162 >>= 0x01;
	}
	int32 s4_185;
	for (s4_185 = 63; s4_185 != 0x00; s4_185 += ~0x00)
	{
		ptr32 a0_214;
		rf_pri_rccal_config(s2_120, s1_160);
		ui32 s0_202 = s0_161 << 1;
		ptr32 a3_198;
		word32 a2_436;
		word32 a5_437;
		if (a0_128 < rf_pri_pm_pwr(out a2_436, out a3_198, out a5_437))
		{
			s0_161 = s0_202 + 0x01 & 0x0F;
			s1_160 = (word32) s1_160 + 1;
			if (s0_161 == 0x05)
				goto l23004A0E;
		}
		else
		{
			s0_161 = s0_202 & 0x0F;
			s1_160 = (word32) s1_160 - 1;
			if ((s0_202 & 0x0F) == 0x0A)
			{
l23004A0E:
				a0_214 = 0x03;
				goto l23004A38;
			}
		}
	}
	a0_214 = 0x02;
l23004A38:
	0x00 = (int8) dwArgA8;
	a0Out = a0_214;
	a3Out = a3_198;
	s2Out = s2_120;
	fflagsOut = fflags_115;
	frmOut = frm_116;
	return ra_117;
}

