pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0000.c
// 23004A4C: Register Eq_2 rf_pri_config_channel.constprop.9(Register Eq_2 s6, Stack Eq_2 dwArg08, Stack Eq_2 dwArg28, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg68, Stack Eq_2 dwArg70, Stack Eq_2 dwArg74, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgBC, Stack Eq_2 dwArg0128, Register out ptr32 a5Out, Register out ptr32 s9Out, Register out ptr32 s10Out, Register out ptr32 s11Out)
// Called from:
//      rf_pri_txcal
//      rf_pri_roscal
Eq_2 rf_pri_config_channel.constprop.9(Eq_2 s6, Eq_2 dwArg08, Eq_2 dwArg28, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg68, Eq_2 dwArg70, Eq_2 dwArg74, Eq_2 dwArg8C, Eq_2 dwArg98, Eq_2 dwArgBC, Eq_2 dwArg0128, ptr32 & a5Out, ptr32 & s9Out, ptr32 & s10Out, ptr32 & s11Out)
{
	struct Eq_12928 * a2_7 = g_ptr4200EB1C;
	*(int32 *) 0x400010A0 = ((word32) a2_7->w002E >> 8 & 0x1F) << 16 | ((word32) a2_7->w002E & 0x00FF | *((int32 *) 0x400010A0) & -0x0100) & ~0x001F0000;
	*(int32 *) 0x400010BC = ((word32) g_ptr4200EB1C->w002E & 0x00FF) >> 4 << 20 | *((int32 *) 0x400010BC) & ~0x00F00000;
	*(int32 *) 0x400010C4 = *(int32 *) 0x400010C4 & 0xC0000000 | g_dw4200CF88;
	*(int32 *) 0x400010C0 &= ~0x01000000;
	word32 s1_230 = 0x4200F000;
	struct Eq_13834 * s0_164 = (struct Eq_13834 *) 0x40001000;
	ui32 s5_236 = 0x10000000;
	word32 s2_233 = ~0x10000000;
	word32 s6_237 = 0x10000000;
	word32 s3_234 = ~0x10000000;
	word32 s7_238 = 0x01100000;
	word32 s4_235 = 0x230BF000;
	while (true)
	{
		int32 a5_76 = s0_164->dw00B8 | s5_236;
		s0_164->dw00B8 = a5_76;
		word32 s1_87;
		struct Eq_13897 * s0_89;
		ui32 s2_90;
		word32 s3_91;
		word32 s4_92;
		word32 s5_93;
		word32 s6_94;
		word32 s7_95;
		g_t4200C506();
		int32 a5_108 = s0_89->dw00B8 & s2_90;
		s0_89->dw00B8 = a5_108;
		word32 s1_112;
		struct Eq_13914 * s0_114;
		word32 s2_115;
		word32 s3_116;
		word32 s4_117;
		word32 s5_118;
		ui32 s6_119;
		word32 s7_120;
		g_t4200C506();
		int32 a5_133 = s0_114->dw00B0 | s6_119;
		s0_114->dw00B0 = a5_133;
		word32 s1_137;
		struct Eq_13931 * s0_139;
		word32 s2_140;
		ui32 s3_141;
		word32 s4_142;
		word32 s5_143;
		word32 s6_144;
		word32 s7_145;
		g_t4200C506();
		int32 a5_158 = s0_139->dw00B0 & s3_141;
		s0_139->dw00B0 = a5_158;
		word32 s4_167;
		ui32 s7_170;
		Eq_2 ra_171;
		Eq_2 a3_173;
		g_t4200C506();
		if ((s0_164->dw00B4 & s7_170) == 0x00)
			break;
		word32 t4_330;
		word32 s11_329;
		word32 s10_328;
		word32 s9_327;
		word32 s8_326;
		word32 a7_325;
		word32 a5_324;
		word32 a4_323;
		word32 a3_322;
		word32 a2_321;
		word32 a1_320;
		word32 a0_319;
		printf(ra_171, s4_167 + 80, a3_173, s6, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_230, out a0_319, out a1_320, out a2_321, out a3_322, out a4_323, out a5_324, out a7_325, out s2_233, out s3_234, out s4_235, out s5_236, out s6_237, out s7_238, out s8_326, out s9_327, out s10_328, out s11_329, out t4_330);
	}
	0x00 = (int8) dwArg0128;
	ptr32 a5_199;
	ptr32 s10_208;
	ptr32 s11_209;
	ptr32 s9_217;
	word32 a2_334;
	word32 a1_333;
	word32 a0_332;
	word32 s1_331;
	word32 a3_335;
	word32 a4_336;
	word32 a7_337;
	word32 s2_338;
	word32 s3_339;
	word32 s4_340;
	word32 s5_341;
	word32 s6_342;
	word32 s7_343;
	word32 s8_344;
	word32 t4_345;
	Eq_2 ra_206 = printf(ra_171, &g_t230AAC44, a3_173, dwArg08, dwArg28, dwArg70, dwArg74, dwArg98, dwArgBC, out s1_331, out a0_332, out a1_333, out a2_334, out a3_335, out a4_336, out a5_199, out a7_337, out s2_338, out s3_339, out s4_340, out s5_341, out s6_342, out s7_343, out s8_344, out s9_217, out s10_208, out s11_209, out t4_345);
	a5Out = a5_199;
	s9Out = s9_217;
	s10Out = s10_208;
	s11Out = s11_209;
	return ra_206;
}

// 23004B98: Register word32 rf_pri_roscal_iq.isra.3(Register int32 a0, Register (ptr32 Eq_13999) a5, Stack Eq_2 dwArg0128, Register out Eq_14001 a0Out, Register out ptr32 a3Out, Register out (ptr32 Eq_13999) a5Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s8Out)
// Called from:
//      rf_pri_roscal
word32 rf_pri_roscal_iq.isra.3(int32 a0, struct Eq_13999 * a5, Eq_2 dwArg0128, union Eq_14001 & a0Out, ptr32 & a3Out, struct Eq_13999 & a5Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s8Out)
{
	ui32 s0_100;
	Eq_14001 s2_101 = 0x00;
	Eq_14011 s4_27 = 32;
	for (s0_100 = 0x06; s0_100 != 0x00; s0_100 += ~0x00)
	{
		struct Eq_14016 * a5_38;
		word32 s1_32 = a5->dw007C;
		word32 s6_35 = s4_27 + s2_101;
		if (a0 != 0x00)
			a5_38 = s6_35 << 0x08 | a5 & 0xFC0000FF;
		else
			a5_38 = s6_35 | a5 & -64;
		a5_38->dw007C = s1_32;
		word32 a3_243;
		if (rf_pri_pm_pwr_avg(a0, 0x0400, out a3_243, out a5) <= 0x00)
			s2_101 = s6_35;
		s4_27 >>= 0x01;
	}
	int32 s4_106;
	for (s4_106 = 63; s4_106 != 0x00; s4_106 += ~0x00)
	{
		struct Eq_14051 * a5_75;
		word32 s1_71 = a5->dw007C;
		if (a0 != 0x00)
			a5_75 = s2_101 << 0x08 | a5 & 0xFC0000FF;
		else
			a5_75 = a5 & -64 | s2_101;
		a5_75->dw007C = s1_71;
		ui32 s0_93 = s0_100 << 1;
		ptr32 a3_88;
		if (rf_pri_pm_pwr_avg(a0, 0x0400, out a3_88, out a5) > 0x00)
		{
			s0_100 = s0_93 + 0x01 & 0x0F;
			s2_101 = (word32) s2_101 - 1;
			if (s0_100 == 0x05)
				break;
		}
		else
		{
			s0_100 = s0_93 & 0x0F;
			s2_101 = (word32) s2_101 + 1;
			if ((s0_93 & 0x0F) == 0x0A)
				break;
		}
	}
	0x00 = (int8) dwArg0128;
	a0Out = s2_101;
	a3Out = a3_88;
	a5Out = a5;
	s4Out = dwArg78;
	s5Out = 0xFC0000FF;
	s8Out = s5;
	return dwArgE4;
}

// 23004C68: void rf_pri_chipv(Register word32 a0)
// Called from:
//      rf_pri_init
void rf_pri_chipv(word32 a0)
{
	if (a0 != 0x00)
	{
		if (a0 == 0x01)
		{
			*(word32 *) 0x00050005 = 0x4200EB14;
			g_w4200EB18 = 0x05;
			struct Eq_14232 * a4_16 = (struct Eq_14232 *) 0x1C;
			do
			{
				struct Eq_14232 * a5_21 = (char *) a4_16 - 28;
				do
				{
					word32 a0_26 = a5_21->dw230AB00C;
					a5_21[39548892] = (struct Eq_14232) a0_26;
					a5_21[39548908] = (struct Eq_14232) a0_26;
					a5_21 = (struct Eq_14232 *) ((char *) a5_21 + 4);
				} while (a5_21 != a4_16);
				a4_16 = a5_21 + 1;
			} while (a5_21 != (struct Eq_14232 *) -448);
			struct Eq_14254 * a5_40 = null;
			struct Eq_14137 * a2_43 = (struct Eq_14137 *) 56;
			do
			{
				*a5_40[0x108046F6] = (struct Eq_14254) (a5_40 + 276842216);
				++a5_40;
			} while (a5_40 != (struct Eq_14254 *) 56);
			Eq_2 a4_57 = 0x42011F90;
			do
			{
				struct Eq_14153 * a5_61 = a2_43->ptr0000;
				a4_57 = (word32) a4_57 + 16;
				*((word32) a4_57 + 0x0FF0) = a2_43;
				*((word32) a4_57 + 0x0FF4) = a5_61->dw0004;
				*((word32) a4_57 + 0x0FF8) = a5_61->dw0008;
				a2_43 = a5_61->ptr000C;
				*((word32) a4_57 + 0x0FFC) = a2_43;
			} while (a5_61 != (struct Eq_14153 *) 3707063620);
			union Eq_2 * a5_74 = *a4_57;
			*(union Eq_2 *) 0x0C = a4_57;
			Eq_2 a5_77 = *a5_74;
			*(union Eq_2 *) 0x09 = a5_77;
			*(union Eq_2 *) 0x14 = a5_77;
			*(union Eq_2 *) 0x11 = a5_77;
			*(union Eq_2 *) 0x1C = a5_77;
			*(union Eq_2 *) 0x19 = a5_77;
			*(union Eq_2 *) 0x24 = a5_77;
			*(union Eq_2 *) 33 = a5_77;
			*(union Eq_2 *) 33 = a5_77;
			*(union Eq_2 *) 0x25 = a5_77;
			*(union Eq_2 *) 0x25 = a5_77;
			*(union Eq_2 *) 0x2D = a5_77;
			*(union Eq_2 *) 0x32 = a5_77;
		}
	}
	else
	{
		*(word32 *) 0x00060003 = 0x4200EB14;
		g_w4200EB18 = 0x06;
		struct Eq_14113 * a4_104 = (struct Eq_14113 *) 0x1C;
		do
		{
			struct Eq_14113 * a5_109 = (char *) a4_104 - 28;
			do
			{
				word32 a0_114 = a5_109[146975635];
				a5_109[276842244] = (struct Eq_14113) a0_114;
				a5_109[0x10804774] = (struct Eq_14113) a0_114;
				++a5_109;
			} while (a4_104 != a5_109);
			a4_104 += 7;
		} while (a4_104 != (struct Eq_14113 *) 476);
		struct Eq_14135 * a5_128 = null;
		struct Eq_14137 * a2_131 = (struct Eq_14137 *) 56;
		do
		{
			*a5_128[0x08C2AB85] = (struct Eq_14135) (a5_128 + 276842216);
			++a5_128;
		} while (a5_128 != (struct Eq_14135 *) 56);
		Eq_2 a4_145 = 0x42011F90;
		do
		{
			struct Eq_14153 * a5_149 = a2_131->ptr0000;
			a4_145 = (word32) a4_145 + 16;
			*((word32) a4_145 + 0x0FF0) = a2_131;
			*((word32) a4_145 + 0x0FF4) = a5_149->dw0004;
			*((word32) a4_145 + 0x0FF8) = a5_149->dw0008;
			a2_131 = a5_149->ptr000C;
			*((word32) a4_145 + 0x0FFC) = a2_131;
		} while (a5_149 != (struct Eq_14153 *) 3707063748);
		union Eq_2 * a5_162 = *a4_145;
		*(union Eq_2 *) 0x0A = a4_145;
		Eq_2 a5_165 = *a5_162;
		*(union Eq_2 *) 0x07 = a5_165;
		*(union Eq_2 *) 0x12 = a5_165;
		*(union Eq_2 *) 0x0F = a5_165;
		*(union Eq_2 *) 0x1A = a5_165;
		*(union Eq_2 *) 0x17 = a5_165;
		*(union Eq_2 *) 0x22 = a5_165;
		*(union Eq_2 *) 0x1F = a5_165;
		((word32) a5_165 + 32)->u0 = 0x00;
		((word32) a5_165 + 36)->u0 = 0x00;
		((word32) a5_165 + 36)->u0 = 0x00;
		((word32) a5_165 + 44)->u0 = 0x00;
		((word32) a5_165 + 48)->u0 = 0x00;
	}
}

// 23004E50: void rf_pri_update_tx_power_offset(Register int32 a0, Register ptr32 a1)
// Called from:
//      rfc_apply_tx_power_offset
void rf_pri_update_tx_power_offset(int32 a0, ptr32 a1)
{
	int32 s1_17 = (int32) (a1 + a0);
	word32 a6_97;
	word32 a5_96;
	word32 a1_93;
	word32 a2_94;
	word32 a3_95;
	word32 a7_98;
	struct Eq_14345 * a4_24;
	memcpy(0x42011C10, 0x42011DD0, 448, out a1_93, out a2_94, out a3_95, out a4_24, out a5_96, out a6_97, out a7_98);
	ui32 s1_40 = (s1_17 ^ 0x04) + ~0x09;
	do
	{
		struct Eq_14363 * a5_45 = a4_24->ptr0014;
		a5_45->ptr1014 = a4_24 + (s1_17 | 0x04) / 24;
		a4_24 = a5_45->dw0018 + s1_40;
		a5_45->ptr1018 = a4_24;
	} while (a5_45 != (struct Eq_14363 *) 3187597900);
	rf_pri_set_gain_table_regs();
}

