pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0000.c
// 23004EBA: Register Eq_7726 rf_pri_get_notch_param(Register Eq_7726 a0, Register (ptr32 byte) a1, Register ptr32 a2)
// Called from:
//      rf_set_channel
Eq_7726 rf_pri_get_notch_param(Eq_7726 a0, byte * a1, ptr32 a2)
{
	uint32 a5_11 = 0x0D;
	if (a0 <= 0x00FFF9A8)
		a5_11 = (word32) a0 - 0x00FFF96C >> 0x05;
	ptr32 * a5_20 = (*(struct Eq_14391 **) 0x00FFF9A8)->ptr0004;
	*a1 = 0xA8;
	*a5_20 = a2;
	return a5_11 << 0x03;
}

// 23004EEE: void rf_pri_update_param(Register Eq_7726 a0)
// Called from:
//      rf_set_channel
void rf_pri_update_param(Eq_7726 a0)
{
	uint32 a4_23;
	struct Eq_14409 * a5_24;
	ui32 a5_15;
	g_ptr4200F290 = null;
	g_ptr4200F294 = null;
	g_t4200F28C.u0 = 0x00;
	g_ptr4200F30C = null;
	if (a0 > 0x00FFF96B && a0 > 0x00FFF970)
	{
		if (a0 > 0x00FFF97A)
		{
			if (a0 > 0x00FFF989)
			{
				if (a0 > 0x00FFF998)
				{
					a4_23 = 0x08;
					a5_24 = (struct Eq_14409 *) 0x07;
					if (a0 > 0x00FFF9A7)
						goto l23004FB0;
					a5_15 = 0x04;
				}
				else
					a5_15 = 0x03;
			}
			else
				a5_15 = 0x02;
		}
		else
			a5_15 = 0x01;
	}
	else
		a5_15 = 0x00;
	struct Eq_14462 * a2_29 = a5_15 << 0x02;
	Eq_7726 a7_33 = a2_29->t230AAC2C;
	Eq_14477 a6_35 = 0x00;
	if (a7_33 != a0)
		a6_35 = a0 - a7_33;
	Eq_14461 t1_47 = a2_29->t230AABFC;
	ptr32 a1_60 = &a2_29->t230AABFC - a7_33;
	ui32 a2_53 = a2_29->dw230AAC14;
	a4_23 = (Mem10[a2_29 + 587901948:word32] - t1_47 + a6_35 >>u a1_60) + t1_47;
	a5_24 = ((word32) a6_35 + ((a5_15 + 0x01 << 2) - a2_53) >> a1_60) + a2_53;
l23004FB0:
	a5_24->dw001F = 0x4200D028;
	(55 - a4_23)->dw0014 = 0x4200D028;
	struct Eq_14451 * a7_101 = &g_t4200D028;
	int32 a6_240 = 0x00;
	struct Eq_14455 * a3_100 = (struct Eq_14455 *) 0x0A;
	int32 a5_80 = 0x14 - a5_24;
	do
	{
		struct Eq_14455 * a1_132 = (word32) a7_101[4] + a6_240 - a5_80;
		a6_240 = 0x00;
		if (a3_100 < a1_132)
			a6_240 = a1_132 - a3_100;
		if (a3_100 < a1_132)
			a1_132 = a3_100;
		a7_101[3] = (struct Eq_14451) a1_132;
		a3_100 = (struct Eq_14455 *) ((char *) a3_100 - 5);
		a7_101 = (struct Eq_14451 *) ((char *) a7_101 - 4);
	} while (a3_100 != (struct Eq_14455 *) ~0x09);
	struct Eq_14455 * a3_110 = (struct Eq_14455 *) 56;
	ui32 a7_111 = 0x00;
	word32 a5_114 = 0x00 - (a4_23 ^ 0x04);
	struct Eq_14525 * a5_116 = (struct Eq_14525 *) 0x14;
	int32 a4_117 = 0x14 - a4_23;
	do
	{
		word32 a2_120 = a5_116->dw0014;
		a5_116 = a5_116 - a7_111 + a4_117;
		if (a5_116 > (struct Eq_14525 *) 95)
			a5_116 += (a5_114 + 5) / 28;
		a5_116->dw0018 = a2_120;
		word32 a2_133 = a1_132->dw0018;
		a7_111 = 0x00;
		if (a1_132 < a3_110)
			a7_111 = a3_110 - a1_132;
		if (a1_132 < a3_110)
			a1_132 = a3_110;
		a1_132->dw0018 = a2_133;
		a3_110 = (struct Eq_14455 *) ((char *) a3_110 + 5);
	} while (a3_110 != (struct Eq_14455 *) 91);
	word32 a3_177;
	ui32 a5_178;
	g_dw4200D038 = 0x0F;
	g_dw4200D03C = 0x0033;
	if (a0 <= 16775557)
	{
		a3_177 = *(word32 *) 0x00FFF9F1;
		a5_178 = (word32) g_w4200EB16;
	}
	else
	{
		a3_177 = *(word32 *) 0x00FFF9F1;
		a5_178 = (word32) g_w4200EB18;
	}
	word32 * a5_194;
	(a5_178 | 0x00FFF980)->dw006C = a3_177;
	if (a0 == 0x00FFF98A)
	{
		a5_194 = g_ptr42011BB8;
		goto l2300514A;
	}
	if (a0 <= 0x00FFF98A)
	{
		if (a0 == 0x00FFF976)
		{
			a5_194 = g_ptr42011BA8;
			goto l2300514A;
		}
		if (a0 <= 0x00FFF976)
		{
			if (a0 != 0x00FFF96C)
			{
				if (a0 != 0x00FFF971)
					goto l230050AC;
				a5_194 = g_ptr42011BA4;
			}
			else
				a5_194 = g_a42011BA0[0];
l2300514A:
			*a5_194 = 0x4200F304;
			return;
		}
		if (a0 == 0x00FFF980)
		{
			a5_194 = g_ptr42011BB0;
			goto l2300514A;
		}
		if (a0 == 16775557)
		{
			a5_194 = g_ptr42011BB4;
			goto l2300514A;
		}
		if (a0 == 0x00FFF97B)
		{
			a5_194 = g_ptr42011BAC;
			goto l2300514A;
		}
	}
	else
	{
		if (a0 == 0x00FFF99E)
		{
			a5_194 = g_ptr42011BC8;
			goto l2300514A;
		}
		if (a0 <= 0x00FFF99E)
		{
			if (a0 == 0x00FFF994)
			{
				a5_194 = g_ptr42011BC0;
				goto l2300514A;
			}
			if (a0 == 0x00FFF999)
			{
				a5_194 = g_ptr42011BC4;
				goto l2300514A;
			}
			if (a0 == 0x00FFF98F)
			{
				a5_194 = g_ptr42011BBC;
				goto l2300514A;
			}
		}
		else
		{
			if (a0 == 0x00FFF9A8)
			{
				a5_194 = g_ptr42011BD0;
				goto l2300514A;
			}
			if (a0 == 0x00FFF9B4)
			{
				a5_194 = g_ptr42011BD4;
				goto l2300514A;
			}
			if (a0 == 0x00FFF9A3)
			{
				a5_194 = g_ptr42011BCC;
				goto l2300514A;
			}
		}
	}
l230050AC:
	g_dw4200F304 = 0x00;
}

// 230051B2: void rf_pri_xtalfreq(Register (ptr32 Eq_10210) a0)
// Called from:
//      rfc_init
void rf_pri_xtalfreq(struct Eq_10210 * a0)
{
	struct Eq_14654 * a4_456;
	if (a0 != null)
	{
		struct Eq_14657 * a4_603;
		if (a0 == (struct Eq_10210 *) 0x01)
		{
			*(word32 *) 0x1ED20D21 = 0x4200CF64;
			*(word32 *) 517942775 = 0x4200CF64;
			*(word32 *) 0x1EEC4ECD = 0x4200CF64;
			*(word32 *) 519663523 = 0x4200CF64;
			*(word32 *) 0x1F069079 = 0x4200CF64;
			*(word32 *) 0x1F13B14F = 0x4200CF64;
			*(word32 *) 522244645 = 0x4200CF64;
			*(word32 *) 0x1F2DF2FB = 0x4200CF64;
			*(word32 *) 523965393 = 0x4200CF64;
			*(word32 *) 524825767 = 0x4200CF64;
			*(word32 *) 0x1F55557D = 0x4200CF64;
			*(word32 *) 526546515 = 0x4200CF64;
			*(word32 *) 0x1F6F9729 = 0x4200CF64;
			*(word32 *) 0x1F7CB7FF = 0x4200CF64;
			*(word32 *) 0x1F89D8D6 = 0x4200CF64;
			*(word32 *) 529988012 = 0x4200CF64;
			*(word32 *) 530848386 = 0x4200CF64;
			*(word32 *) 0x1FB13B58 = 0x4200CF64;
			*(word32 *) 532569134 = 0x4200CF64;
			*(word32 *) 533429508 = 0x4200CF64;
			*(word32 *) 534289882 = 0x4200CF64;
			*(word32 *) 2806228732 = 0x4200CF38;
			*(word32 *) ~0x582E5871 = 0x4200CF38;
			*(word32 *) 0xA860A821 = 0x4200CF38;
			*(word32 *) 2834213043 = 0x4200CF38;
			*(word32 *) 0xA97CA945 = 0x4200CF38;
			*(word32 *) 2852825559 = 0x4200CF38;
			*(word32 *) 0xAA99AA6A = 0x4200CF38;
			*(word32 *) ~0x54D85503 = 0x4200CF38;
			*(word32 *) 2880809870 = 0x4200CF38;
			*(word32 *) 0xAC43AC20 = 0x4200CF38;
			g_w4200CF60 = 64651;
			*(word32 *) 2800854705 = 0x4200EB08;
			g_w4200EB0C = ~0x030D;
			g_w4200FB0E = 0x056B;
			*(word32 *) 6000004 = 0x4200CFB8;
			*(word32 *) 1000012 = 0x4200CFB8;
			*(word32 *) ~0x003D08EB = 0x4200CFB8;
			*(word32 *) ~0x00895423 = 0x4200CFB8;
			*(word32 *) 7000044 = 0x4200CFB8;
			*(word32 *) 2000052 = 0x4200CFB8;
			*(word32 *) ~0x002DC683 = 0x4200CFB8;
			*(word32 *) ~0x007A11BB = 0x4200CFB8;
			*(word32 *) 8000084 = 0x4200CFB8;
			*(word32 *) 3000092 = 0x4200CFB8;
			a0->dw0000 = 0x4200CFB8;
			a0->dw0008 = 0x4200CFB8;
			a0->dw0010 = 0x4200CFB8;
			a0->dw0018 = 0x4200CFB8;
			g_dw4200CFD8 = 0x00;
			a0->dw0028 = 0x4200CFB8;
			a0->dw0030 = 0x4200CFB8;
			a0->dw0038 = 0x4200CFB8;
			a0->dw0040 = 0x4200CFB8;
			g_dw4200D000 = 0x00;
			a0->dw0050 = 0x4200CFB8;
			a0->dw0058 = 0x4200CFB8;
			a0->dw0060 = 0x4200CFB8;
			g_dw4200D020 = 0x00;
			g_dw4200CFDC = 0x00;
			g_dw4200D004 = 0x00;
			a4_603 = (struct Eq_14657 *) 4292967296;
		}
		else
		{
			if (a0 != (struct Eq_10210 *) 0x02)
			{
				if (a0 != (struct Eq_10210 *) 0x03)
				{
					if (a0 == (struct Eq_10210 *) 0x04)
					{
						*(word32 *) 0x14088889 = 0x4200CF64;
						*(word32 *) 0x14111115 = 0x4200CF64;
						*(word32 *) 337222050 = 0x4200CF64;
						*(word32 *) 0x1422222E = 0x4200CF64;
						*(word32 *) 338340539 = 0x4200CF64;
						*(word32 *) 338899783 = 0x4200CF64;
						*(word32 *) 0x143BBBD4 = 0x4200CF64;
						*(word32 *) 0x14444460 = 0x4200CF64;
						*(word32 *) 0x144CCCED = 0x4200CF64;
						*(word32 *) 341136761 = 0x4200CF64;
						*(word32 *) 341696006 = 0x4200CF64;
						*(word32 *) 342255250 = 0x4200CF64;
						*(word32 *) 0x146EEF1F = 0x4200CF64;
						*(word32 *) 343373739 = 0x4200CF64;
						*(word32 *) 0x14800038 = 0x4200CF64;
						*(word32 *) 344492229 = 0x4200CF64;
						*(word32 *) 0x14911151 = 0x4200CF64;
						*(word32 *) 0x149999DE = 0x4200CF64;
						*(word32 *) 346169962 = 0x4200CF64;
						*(word32 *) 0x14AAAAF7 = 0x4200CF64;
						*(word32 *) 0x14B33383 = 0x4200CF64;
						*(word32 *) ~0x58CD5914 = 0x4200CF38;
						*(word32 *) ~0x583F5882 = 0x4200CF38;
						*(word32 *) 0xA84FA810 = 0x4200CF38;
						*(word32 *) 0xA8DDA8A2 = 0x4200CF38;
						*(word32 *) 2842405172 = 0x4200CF38;
						*(word32 *) ~0x56065639 = 0x4200CF38;
						*(word32 *) 0xAA87AA58 = 0x4200CF38;
						*(word32 *) ~0x54E95514 = 0x4200CF38;
						*(word32 *) ~0x545B5482 = 0x4200CF38;
						*(word32 *) 2889001999 = 0x4200CF38;
						g_w4200CF60 = 64633;
						*(word32 *) 0xA6E0A6A0 = 0x4200EB08;
						g_w4200EB0C = ~0x031F;
						g_w4200FB0E = ~0x07AA;
						((union Eq_2 *) 33)->u0 = 0x4200CFB8;
						((union Eq_2 *) 0x29)->u0 = 0x4200CFB8;
						((union Eq_2 *) 0x31)->u0 = 0x4200CFB8;
						((union Eq_2 *) 0x39)->u0 = 0x4200CFB8;
						((union Eq_2 *) 0x61)->u0 = 0x4200CFB8;
						*(word32 *) 0x69 = 0x4200CFB8;
						*(word32 *) 3000044 = 0x4200CFB8;
						*(word32 *) 8000036 = 0x4200CFB8;
						*(word32 *) ~0x001E844B = 0x4200CFB8;
						*(word32 *) 8000100 = 0x4200CFB8;
						g_dw4200CFB8 = 0x00;
						g_dw4200CFC0 = 0x00;
						g_dw4200CFC8 = 0x00;
						g_dw4200CFD0 = 0x00;
						g_dw4200CFF8 = 0x00;
						g_dw4200D000 = 0x00;
						g_dw4200D008 = 0x00;
						g_dw4200D010 = 0x00;
						g_dw4200CFBC = 0x00;
						g_dw4200CFC4 = 0x00;
						g_dw4200CFCC = 0x00;
						g_dw4200CFD4 = 0x00;
						*(word32 *) ~0x006ACF83 = 0x4200CFB8;
						g_dw4200CFFC = 0x00;
						g_dw4200D004 = 0x00;
						g_dw4200D00C = 0x00;
						g_dw4200D014 = 0x00;
						*(word32 *) ~0x003D0893 = 0x4200CFB8;
						return;
					}
					if (a0 != (struct Eq_10210 *) 0x05)
						return;
					*(word32 *) 0x0F690690 = 0x4200CF64;
					*(word32 *) 0x0F6F96FD = 0x4200CF64;
					*(word32 *) 0x0F76276A = 0x4200CF64;
					*(word32 *) 0x0F7CB7D7 = 0x4200CF64;
					*(word32 *) 0x0F834845 = 0x4200CF64;
					*(word32 *) 260692146 = 0x4200CF64;
					*(word32 *) 0x0F90691F = 0x4200CF64;
					*(word32 *) 261552524 = 0x4200CF64;
					*(word32 *) 0x0F9D89F9 = 0x4200CF64;
					*(word32 *) 262412902 = 0x4200CF64;
					*(word32 *) 0x0FAAAAD3 = 0x4200CF64;
					*(word32 *) 0x0FB13B40 = 0x4200CF64;
					*(word32 *) 0x0FB7CBAD = 0x4200CF64;
					*(word32 *) 264133658 = 0x4200CF64;
					*(word32 *) 0x0FC4EC87 = 0x4200CF64;
					*(word32 *) 264994036 = 0x4200CF64;
					*(word32 *) 265424225 = 0x4200CF64;
					*(word32 *) 265854414 = 0x4200CF64;
					*(word32 *) 266284603 = 0x4200CF64;
					*(word32 *) 266714792 = 0x4200CF64;
					*(word32 *) 0x0FEC4F15 = 0x4200CF64;
					*(word32 *) 2805245677 = 0x4200CF38;
					*(word32 *) ~0x583D5880 = 0x4200CF38;
					*(word32 *) 0xA850A811 = 0x4200CF38;
					*(word32 *) 0xA8DEA8A3 = 0x4200CF38;
					*(word32 *) 2842536245 = 0x4200CF38;
					*(word32 *) 2851842504 = 0x4200CF38;
					*(word32 *) 0xAA89AA5A = 0x4200CF38;
					*(word32 *) 2870455020 = 0x4200CF38;
					*(word32 *) ~0x545A5481 = 0x4200CF38;
					*(word32 *) 0xAC34AC10 = 0x4200CF38;
					g_w4200CF60 = 64635;
					*(word32 *) 0xA6E2A6A2 = 0x4200EB08;
					g_w4200EB0C = ~0x031D;
					g_w4200FB0E = ~0x052A;
					((union Eq_2 *) 0x29)->u0 = 0x4200CFB8;
					((union Eq_2 *) 0x31)->u0 = 0x4200CFB8;
					((union Eq_2 *) 0x39)->u0 = 0x4200CFB8;
					((union Eq_2 *) 0x41)->u0 = 0x4200CFB8;
					*(word32 *) 7000044 = 0x4200CFB8;
					*(word32 *) 2000052 = 0x4200CFB8;
					*(word32 *) ~0x002DC683 = 0x4200CFB8;
					g_dw4200CFB8 = 0x00;
					g_dw4200CFC0 = 0x00;
					g_dw4200CFC8 = 0x00;
					g_dw4200CFD0 = 0x00;
					g_dw4200CFD8 = 0x00;
					g_dw4200D000 = 0x00;
					g_dw4200D008 = 0x00;
					g_dw4200D010 = 0x00;
					g_dw4200D018 = 0x00;
					g_dw4200D020 = 0x00;
					g_dw4200CFBC = 0x00;
					g_dw4200CFC4 = 0x00;
					g_dw4200CFCC = 0x00;
					g_dw4200CFD4 = 0x00;
					g_dw4200CFDC = 0x00;
					*(word32 *) ~0x007A11BB = 0x4200CFB8;
					g_dw4200D004 = 0x00;
					g_dw4200D00C = 0x00;
					g_dw4200D014 = 0x00;
l230053B4:
					g_dw4200D01C = 0x00;
l230055D6:
					g_dw4200D024 = 0x00;
					return;
				}
				*(word32 *) 0x14DE38E4 = 0x4200CF64;
				*(word32 *) 0x14E71C76 = 0x4200CF64;
				*(word32 *) 0x14F00008 = 0x4200CF64;
				*(word32 *) 351855514 = 0x4200CF64;
				*(word32 *) 0x1501C72C = 0x4200CF64;
				*(word32 *) 0x150AAABF = 0x4200CF64;
				*(word32 *) 353603153 = 0x4200CF64;
				*(word32 *) 0x151C71E3 = 0x4200CF64;
				*(word32 *) 0x15255575 = 0x4200CF64;
				*(word32 *) 355350792 = 0x4200CF64;
				*(word32 *) 355933338 = 0x4200CF64;
				*(word32 *) 0x1540002C = 0x4200CF64;
				*(word32 *) 357098430 = 0x4200CF64;
				*(word32 *) 0x1551C750 = 0x4200CF64;
				*(word32 *) 358263523 = 0x4200CF64;
				*(word32 *) 358846069 = 0x4200CF64;
				*(word32 *) 0x156C7207 = 0x4200CF64;
				*(word32 *) 360011161 = 0x4200CF64;
				*(word32 *) 360593708 = 0x4200CF64;
				*(word32 *) 361176254 = 0x4200CF64;
				*(word32 *) 0x15900050 = 0x4200CF64;
				*(word32 *) 2805573362 = 0x4200CF38;
				*(word32 *) ~0x5838587B = 0x4200CF38;
				*(word32 *) 2824185878 = 0x4200CF38;
				*(word32 *) 0xA8E4A8A8 = 0x4200CF38;
				*(word32 *) ~0x568D56C4 = 0x4200CF38;
				*(word32 *) 0xAA00A9CD = 0x4200CF38;
				*(word32 *) ~0x557155A0 = 0x4200CF38;
				*(word32 *) 2870782705 = 0x4200CF38;
				*(word32 *) ~0x5454547B = 0x4200CF38;
				*(word32 *) 0xAC39AC16 = 0x4200CF38;
				g_w4200CF60 = 64640;
				*(word32 *) ~0x59185958 = 0x4200EB08;
				g_w4200EB0C = 64743;
				g_w4200FB0E = 0xF800;
				((union Eq_2 *) 0x01)->u0 = 0x4200CFB8;
				((union Eq_2 *) 0x09)->u0 = 0x4200CFB8;
				((union Eq_2 *) 0x11)->u0 = 0x4200CFB8;
				((union Eq_2 *) 0x19)->u0 = 0x4200CFB8;
				((union Eq_2 *) 0x41)->u0 = 0x4200CFB8;
				*(word32 *) 0x49 = 0x4200CFB8;
				((union Eq_2 *) 0x51)->u0 = 0x4200CFB8;
				*(word32 *) 0x59 = 0x4200CFB8;
				*(word32 *) 7200004 = 0x4200CFB8;
				*(word32 *) 2200012 = 0x4200CFB8;
				*(word32 *) ~0x002AB96B = 0x4200CFB8;
				*(word32 *) ~0x007704A3 = 0x4200CFB8;
				*(word32 *) 5600068 = 0x4200CFB8;
				*(word32 *) 600076 = 0x4200CFB8;
				*(word32 *) ~0x0043232B = 0x4200CFB8;
				g_dw4200CFD8 = 0x00;
				g_dw4200CFE0 = 0x00;
				g_dw4200CFE8 = 0x00;
				g_dw4200CFF0 = 0x00;
				g_dw4200D018 = 0x00;
				g_dw4200D020 = 0x00;
				g_dw4200CFDC = 0x00;
				g_dw4200CFE4 = 0x00;
				g_dw4200CFEC = 0x00;
				g_dw4200CFF4 = 0x00;
				a4_456 = (struct Eq_14654 *) 0xFF709140;
l230053B2:
				a4_456->dw005C = 0x4200CFB8;
				goto l230053B4;
			}
			*(word32 *) 0x190AAAAB = 0x4200CF64;
			*(word32 *) 0x19155559 = 0x4200CF64;
			*(word32 *) 0x19200008 = 0x4200CF64;
			*(word32 *) 422226615 = 0x4200CF64;
			*(word32 *) 422925669 = 0x4200CF64;
			*(word32 *) 0x19400014 = 0x4200CF64;
			*(word32 *) 424323779 = 0x4200CF64;
			*(word32 *) 0x19555571 = 0x4200CF64;
			*(word32 *) 0x19600020 = 0x4200CF64;
			*(word32 *) 426420943 = 0x4200CF64;
			*(word32 *) 427119997 = 0x4200CF64;
			*(word32 *) 0x1980002C = 0x4200CF64;
			*(word32 *) 0x198AAADB = 0x4200CF64;
			*(word32 *) 0x19955589 = 0x4200CF64;
			*(word32 *) 429916216 = 0x4200CF64;
			*(word32 *) 0x19AAAAE7 = 0x4200CF64;
			*(word32 *) 0x19B55595 = 0x4200CF64;
			*(word32 *) 0x19C00044 = 0x4200CF64;
			*(word32 *) 432712435 = 0x4200CF64;
			*(word32 *) 433411489 = 0x4200CF64;
			*(word32 *) 0x19E00050 = 0x4200CF64;
			*(word32 *) ~0x58BE5905 = 0x4200CF38;
			*(word32 *) 0xA7D0A78C = 0x4200CF38;
			*(word32 *) 2824775711 = 0x4200CF38;
			*(word32 *) 0xA8ECA8B1 = 0x4200CF38;
			*(word32 *) 2843388227 = 0x4200CF38;
			*(word32 *) 0xAA09A9D5 = 0x4200CF38;
			*(word32 *) 2862066280 = 0x4200CF38;
			*(word32 *) ~0x54DA5505 = 0x4200CF38;
			*(word32 *) ~0x544C5473 = 0x4200CF38;
			*(word32 *) 2890050590 = 0x4200CF38;
			g_w4200CF60 = 64649;
			*(word32 *) ~0x59105950 = 0x4200EB08;
			g_w4200EB0C = ~0x030F;
			g_w4200FB0E = 1707;
			((union Eq_2 *) 0x11)->u0 = 0x4200CFB8;
			((union Eq_2 *) 0x19)->u0 = 0x4200CFB8;
			((union Eq_2 *) 33)->u0 = 0x4200CFB8;
			((union Eq_2 *) 0x29)->u0 = 0x4200CFB8;
			((union Eq_2 *) 0x31)->u0 = 0x4200CFB8;
			*(word32 *) 0x49 = 0x4200CFB8;
			((union Eq_2 *) 0x51)->u0 = 0x4200CFB8;
			*(word32 *) 0x59 = 0x4200CFB8;
			((union Eq_2 *) 0x61)->u0 = 0x4200CFB8;
			*(word32 *) 10000020 = 0x4200CFB8;
			*(word32 *) 5000028 = 0x4200CFB8;
			*(word32 *) ~0x004C4B13 = 0x4200CFB8;
			*(word32 *) 4284967348 = 0x4200CFB8;
			*(word32 *) 7000076 = 0x4200CFB8;
			*(word32 *) 2000084 = 0x4200CFB8;
			*(word32 *) ~0x002DC663 = 0x4200CFB8;
			g_dw4200CFB8 = 0x00;
			g_dw4200CFC0 = 0x00;
			g_dw4200CFF0 = 0x00;
			g_dw4200CFF8 = 0x00;
			g_dw4200D020 = 0x00;
			g_dw4200CFBC = 0x00;
			g_dw4200CFC4 = 0x00;
			g_dw4200CFDC = 0x00;
			g_dw4200CFF4 = 0x00;
			g_dw4200CFFC = 0x00;
			a4_603 = (struct Eq_14657 *) ~0x007A11FF;
		}
		a4_603->dw0064 = 0x4200CFB8;
		goto l230055D6;
	}
	else
	{
		*(word32 *) 560172601 = 0x4200CF64;
		*(word32 *) 0x2171C720 = 0x4200CF64;
		*(word32 *) 0x21800008 = 0x4200CF64;
		*(word32 *) 562968816 = 0x4200CF64;
		*(word32 *) 0x219C71D7 = 0x4200CF64;
		*(word32 *) 0x21AAAABF = 0x4200CF64;
		*(word32 *) 565765030 = 0x4200CF64;
		*(word32 *) 566697102 = 0x4200CF64;
		*(word32 *) 0x21D55575 = 0x4200CF64;
		*(word32 *) 568561245 = 0x4200CF64;
		*(word32 *) 569493316 = 0x4200CF64;
		*(word32 *) 0x2200002C = 0x4200CF64;
		*(word32 *) 571357460 = 0x4200CF64;
		*(word32 *) 0x221C71FB = 0x4200CF64;
		*(word32 *) 0x222AAAE3 = 0x4200CF64;
		*(word32 *) 574153674 = 0x4200CF64;
		*(word32 *) 575085746 = 0x4200CF64;
		*(word32 *) 0x22555599 = 0x4200CF64;
		*(word32 *) 576949889 = 0x4200CF64;
		*(word32 *) 577881960 = 0x4200CF64;
		*(word32 *) 0x22800050 = 0x4200CF64;
		*(word32 *) 2805573362 = 0x4200CF38;
		*(word32 *) ~0x5838587B = 0x4200CF38;
		*(word32 *) 2824185878 = 0x4200CF38;
		*(word32 *) 0xA8E4A8A8 = 0x4200CF38;
		*(word32 *) ~0x568D56C4 = 0x4200CF38;
		*(word32 *) 0xAA00A9CD = 0x4200CF38;
		*(word32 *) ~0x557155A0 = 0x4200CF38;
		*(word32 *) 2870782705 = 0x4200CF38;
		*(word32 *) ~0x5454547B = 0x4200CF38;
		*(word32 *) 0xAC39AC16 = 0x4200CF38;
		g_w4200CF60 = 64640;
		*(word32 *) ~0x59185958 = 0x4200EB08;
		g_w4200EB0C = 64743;
		g_w4200FB0E = 0x0500;
		((union Eq_2 *) 0x09)->u0 = 0x4200CFB8;
		((union Eq_2 *) 0x11)->u0 = 0x4200CFB8;
		((union Eq_2 *) 0x19)->u0 = 0x4200CFB8;
		((union Eq_2 *) 33)->u0 = 0x4200CFB8;
		((union Eq_2 *) 0x31)->u0 = 0x4200CFB8;
		((union Eq_2 *) 0x39)->u0 = 0x4200CFB8;
		((union Eq_2 *) 0x41)->u0 = 0x4200CFB8;
		*(word32 *) 0x49 = 0x4200CFB8;
		*(word32 *) 0x59 = 0x4200CFB8;
		((union Eq_2 *) 0x61)->u0 = 0x4200CFB8;
		*(word32 *) 7000012 = 0x4200CFB8;
		*(word32 *) 2000020 = 0x4200CFB8;
		*(word32 *) 4291967324 = 0x4200CFB8;
		*(word32 *) ~0x007A11DB = 0x4200CFB8;
		*(word32 *) 6000052 = 0x4200CFB8;
		*(word32 *) 1000060 = 0x4200CFB8;
		*(word32 *) ~0x003D08BB = 0x4200CFB8;
		*(word32 *) ~0x008953F3 = 0x4200CFB8;
		g_dw4200CFB8 = 0x00;
		g_dw4200CFE0 = 0x00;
		g_dw4200D008 = 0x00;
		g_dw4200D020 = 0x00;
		g_dw4200CFBC = 0x00;
		g_dw4200CFE4 = 0x00;
		g_dw4200D00C = 0x00;
		a4_456 = (struct Eq_14654 *) 5000000;
		goto l230053B2;
	}
}

// 23005DD6: Register ui32 rf_pri_get_vco_freq_cw(Register Eq_2 ra, Register ui32 a0, Register ptr32 fflags, Register ptr32 frm)
// Called from:
//      rfc_init
ui32 rf_pri_get_vco_freq_cw(Eq_2 ra, ui32 a0, ptr32 fflags, ptr32 frm)
{
	Eq_2 a1_11;
	Eq_2 a1_22;
	word32 a5_64;
	word32 a4_63;
	word32 a3_62;
	word32 a1_61;
	Eq_2 a0_30 = __fixdfsi(ra, __adddf3(ra, __floatunsidf(a0 + 0xFF00069C >> 2, out a1_11), a1_11, g_t230AA3C8, g_t230AA3CC, fflags, frm, out a1_22), a1_22, fflags, frm, out a1_61, out a3_62, out a4_63, out a5_64);
	if (a0_30 > 0x14)
		a0_30.u0 = 0x14;
	return CONVERT(Mem10[(a0_30 + 0x08 << 1) + Mem10[0x4200EB1C:int32] + 0x0C:uint16], uint16, word32) & 0x00FF;
}

// 23005E20: Register ui32 rf_pri_get_vco_idac_cw(Register Eq_2 ra, Register ui32 a0, Register ptr32 fflags, Register ptr32 frm)
// Called from:
//      rfc_init
ui32 rf_pri_get_vco_idac_cw(Eq_2 ra, ui32 a0, ptr32 fflags, ptr32 frm)
{
	Eq_2 a1_11;
	Eq_2 a1_22;
	word32 a5_65;
	word32 a4_64;
	word32 a3_63;
	word32 a1_62;
	Eq_2 a0_30 = __fixdfsi(ra, __adddf3(ra, __floatunsidf(a0 + 0xFF00069C >> 2, out a1_11), a1_11, g_t230AA3C8, g_t230AA3CC, fflags, frm, out a1_22), a1_22, fflags, frm, out a1_62, out a3_63, out a4_64, out a5_65);
	if (a0_30 > 0x14)
		a0_30.u0 = 0x14;
	return CONVERT(Mem10[(a0_30 + 0x08 << 1) + Mem10[0x4200EB1C:int32] + 0x0C:uint16], uint16, word32) >>u 8 & 0x1F;
}

// 23005E6A: Register int32 rf_pri_get_txgain_max()
// Called from:
//      phy_hw_set_channel
//      trpc_init
//      phy_tcal_txpwr
int32 rf_pri_get_txgain_max()
{
	return g_dw4200F308 + (g_dw42011C28 + g_dw4200F304);
}

// 23005E88: Register int32 rf_pri_get_txgain_min()
// Called from:
//      phy_hw_set_channel
//      trpc_init
//      phy_tcal_txpwr
int32 rf_pri_get_txgain_min()
{
	return g_dw4200F308 + (g_dw42011DCC + g_dw4200F304);
}

// 23005EA6: Register Eq_2 rf_pri_get_txgain_index(Register Eq_2 a0, Register word32 a1, Register Eq_2 a3, Register out Eq_2 a3Out, Register out ptr32 a4Out)
// Called from:
//      rfc_get_power_level
Eq_2 rf_pri_get_txgain_index(Eq_2 a0, word32 a1, Eq_2 a3, union Eq_2 & a3Out, ptr32 & a4Out)
{
	if (a1 == 0x00)
		a0 = (word32) a0 - 30;
	int32 a1_9 = g_dw4200F304;
	int32 a6_12 = g_dw4200F308;
	Eq_2 a5_14 = 0x00;
	do
	{
		ptr32 a4_18 = *((word32) a3 + 24);
		a3 = (word32) a3 + a1_9 + a6_12;
		if (a0 >= a3)
			goto l23005EDA;
		a5_14 = (word32) a5_14 + 1;
		a4_18 += 0x1C;
	} while (a5_14 != 0x10);
	a5_14.u0 = 0x0F;
l23005EDA:
	a3Out = a3;
	a4Out = a4_18;
	return a5_14;
}

// 23005EDE: Register uint32 rf_pri_query_txgain_table(Register uint32 a0, Register ptr32 a1, Register ptr32 a2, Register out ptr32 a5Out)
// Called from:
//      rfc_init
//      rfc_apply_tx_power_offset
uint32 rf_pri_query_txgain_table(uint32 a0, ptr32 a1, ptr32 a2, ptr32 & a5Out)
{
	if (a0 > 0x0F)
		a0 = 0x0F;
	0x07 - (a0 >> 0x01) = a1;
	uint32 a0_17 = g_dw42011C24;
	g_ptr42011C10 = a2;
	a5Out = 0x42011C10;
	return a0_17;
}

// 23005F06: void rf_pri_update_dvga_os(Register Eq_14417 a0, Register (ptr32 word32) a3)
// Called from:
//      rf_pri_tx_gain_comp
void rf_pri_update_dvga_os(Eq_14417 a0, word32 * a3)
{
	byte * a4_13 = g_a4200D05C;
	do
	{
		a3 += a0;
		*a4_13 = (byte) a3;
		++a4_13;
	} while (a4_13 != (byte *) 3187617716);
}

