pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0000.c
// 23005F30: void rf_pri_tx_gain_comp(Register (ptr32 word32) a0, Register (ptr32 word32) a1, Register (ptr32 word32) a3)
// Called from:
//      phy_tcal_txpwr
void rf_pri_tx_gain_comp(word32 * a0, word32 * a1, word32 * a3)
{
	Eq_14417 a0_100;
	word32 * a5_5 = g_ptr4200F30C;
	if (a5_5 == (word32 *) 0x01)
	{
		word32 * a5_17 = g_ptr4200F288;
		if (a0 < a5_17 && (char *) a5_17 - 5 < a0)
			goto l23005F58;
	}
	else if (a5_5 == (word32 *) ~0x00)
	{
		word32 * a5_13 = g_ptr4200F288;
		if (a5_13 < a0 && a0 < (char *) a5_13 + 5)
		{
l23005F58:
			g_dw4200F308 = (char *) g_ptr4200F290 - 0x0A;
			a0_100.u1 = (int32) g_t4200F28C;
			goto l23005F76;
		}
	}
	int32 a4_21 = 0x0C;
	while (a0 < a1)
	{
		a4_21 += ~0x00;
		if (a4_21 == ~0x00)
			break;
	}
	if (a4_21 < 0x00)
		a4_21 = 0x00;
	word32 * a5_102 = a4_21 + -4;
	word32 * a3_45 = (&g_t4200D028)[a4_21];
	if (a0 > (word32 *) 0x0022)
	{
		if (a3_45 <= (word32 *) 35)
			a3_45 = (word32 *) (&g_t4200D028)[a4_21 + 0x01];
	}
	else
	{
		if (a3_45 < a0)
		{
			word32 * a4_52 = (&g_t4200D028)[a4_21 + 0x01];
			if (a4_52 > (word32 *) 0x0022)
				a4_52 = a3_45;
			*a4_52 = 0x4200F288;
l23005FF6:
			a3 = g_ptr4200F294;
			if (a3 < a5_102)
				a3 = (word32 *) 0x01;
			else
			{
				if (a5_102 >= a3)
					goto l2300600C;
				a3 = (word32 *) ~0x00;
			}
			g_ptr4200F30C = a3;
l2300600C:
			*a5_102 = 0x4200F294;
			if (a5_102 > null)
			{
				int32 a5_98 = (char *) a5_102 + 1;
				a0_100 = a5_98 & 1;
				if ((a5_98 & 1) == 0x00)
					a0_100.u0 = ~0x00;
				a5_102 = a5_98 >> 1;
			}
			else
			{
				a0_100.u0 = 0x00;
				if (a5_102 != null)
				{
					a0_100.u0 = ~0x00;
					if ((a5_102 & 1) != 0x00)
						a0_100.u0 = 0x01;
					a5_102 = (char *) a5_102 - 1 ^ 0x02;
				}
			}
			g_ptr4200F290 = a5_102;
			g_t4200F28C = a0_100;
			g_dw4200F308 = (char *) a5_102 - 0x0A;
l23005F76:
			rf_pri_update_dvga_os(a0_100, a3);
			rfc_apply_tx_dvga(g_a4200D05C);
			return;
		}
		a5_102 = a4_21 + -5;
	}
	*a3_45 = 0x4200F288;
	goto l23005FF6;
}

// 2300607A: Register (ptr32 Eq_16086) rf_pri_txcal(Register (ptr32 Eq_12461) a3, Register (ptr32 Eq_16086) a5, Register Eq_2 s2, Register Eq_2 s6, Register Eq_2 s9, Stack Eq_2 dwArg08, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg2C, Stack Eq_2 dwArg5C, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgC8)
// Called from:
//      rf_pri_init
struct Eq_16086 * rf_pri_txcal(struct Eq_12461 * a3, struct Eq_16086 * a5, Eq_2 s2, Eq_2 s6, Eq_2 s9, Eq_2 dwArg08, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg2C, Eq_2 dwArg5C, Eq_2 dwArgAC, Eq_2 dwArgC8)
{
	(a5 & ~0x00F00000 | 0x00500000)->dw0014 = a5->dw0014;
	word32 a5_829;
	rf_pri_manu_pu(0x05, rf_pri_save_state_for_cal(a3), out a5_829);
	struct Eq_16117 * a5_51;
	ui32 s9_156;
	word32 s10_157;
	struct Eq_16120 * s11_158;
	rf_pri_config_channel.constprop.9(s6, dwLoc58, s2, dwLoc20, dwLoc1C, dwArg08, dwArg10, dwArg14, dwArg2C, s9, dwArg5C, dwArgC8, out a5_51, out s9_156, out s10_157, out s11_158);
	struct Eq_16131 * s0_71 = a5_51->ptr001C;
	(a5_51 | 0x03000000)->ptr001C = s0_71;
	int32 a5_76 = s0_71->dw0084;
	s0_71->dw0084 = a5_76 | 0x80000000;
	struct Eq_16149 * a5_84 = a5_76 | 0x80000000 | 0x00400000;
	a5_84->dw0064 = (a5_76 | 0x80000000)->dw0064;
	((word32) g_w4200EB14 | a5_84 & -8)->dw006C = a5_84->dw006C;
	struct Eq_16172 * sp_116 = fp + -96;
	word32 s2_155 = 0x07;
	ui32 a4_119;
	word32 a3_159 = rf_pri_singen_config.constprop.8(61, out a4_119);
	struct Eq_16184 * a5_104 = (struct Eq_16184 *) 0x0FFFFFFF;
	struct Eq_16186 * s3_105 = &g_t42011F90;
	struct Eq_16188 * s8_106 = &g_ptr42011C10;
	ui32 s4_108 = ~0x003C0000;
	ui32 s5_109 = ~0x00070000;
	ui32 s6_110 = ~0x30000000;
	ui32 s7_111 = ~0x01F70000;
	ui32 s1_112 = ~0x003F0000;
l2300612C:
	word32 a2_117 = sp_116->dw00C4;
	struct Eq_16636 * a5_129 = (s3_105->dw0000 << 28 | a4_119 & a5_104) & s4_108 | s3_105->dw0008 << 18;
	a5_129->dw0064 = a5_104->dw0064;
	struct Eq_16657 * a5_136 = s3_105->dw0004 << 16 | a5_129 & s5_109;
	a5_136->dw0058 = a5_129->dw0058;
	word32 s0_138 = a5_136->dw0048;
	ui32 a5_149 = (s8_106->dw0000 << 28 | a5_136 & s6_110) & s7_111 | s8_106->dw000C << 20;
	(a5_149 | 0x00070000)->dw0048 = s0_138;
	struct Eq_13369 * s0_162;
	ui32 s1_163;
	word32 s2_164;
	struct Eq_16613 * s3_165;
	word32 s4_166;
	word32 s5_167;
	word32 s6_168;
	word32 s7_169;
	word32 s8_170;
	int32 s11_173;
	g_t4200C506();
	Eq_2 s9_187 = s3_165->t000C;
	uint32 s10_188 = s9_187 >> 0x01;
l2300618C:
	s0_162->dw0214 = s9_187 | s0_162->dw0214 & -0x0800;
	s0_162->dw0218 = s9_187 | s0_162->dw0218 & -0x0800;
	rf_pri_singen_start();
	word32 a5_206;
	Eq_2 ra_221;
	g_t4200C506();
	uint32 s10_270;
	Eq_2 t4_281;
	word32 a5_873;
	word32 a7_874;
	word32 a3_871;
	word32 a4_872;
	word32 a1_869;
	word32 a2_870;
	word32 a5_867;
	word32 a0_868;
	word32 a3_866;
	printf(ra_221, &g_t230AADA8, rf_pri_pm_pwr_avg(0x01, 0x0400, out a3_866, out a5_867) >> 0x0A, dwLoc58, s2, dwArg10, dwArg14, s9, dwArg5C, out s1_163, out a0_868, out a1_869, out a2_870, out a3_871, out a4_872, out a5_873, out a7_874, out s2_164, out s3_165, out s4_166, out s5_167, out s6_168, out s7_169, out s8_170, out s9_187, out s10_270, out s11_173, out t4_281);
	sp_116 = fp - 96;
	if (s11_173 > 320)
		s9_187 -= s10_270;
	else
	{
		if (s11_173 > 191)
			goto l23006200;
		s9_187 = (word32) s9_187 + s10_270;
	}
	if (s10_270 != 0x00)
	{
		s10_188 = s10_270 >> 0x01;
		goto l2300618C;
	}
l23006200:
	word32 a5_831;
	word32 a3_830;
	rf_pri_pm_pwr_avg(0x01, 0x01000000, out a3_830, out a5_831);
	Eq_2 a0_320;
	struct Eq_13369 * s0_328;
	ui32 s1_329;
	int32 s11_331;
	word32 s4_334;
	word32 s5_335;
	word32 s6_336;
	word32 s7_337;
	word32 s8_338;
	word32 s9_833;
	word32 a5_832;
	rf_pri_txcal_search_core(s0_162, s1_163, 0x00, 32, 0x10, s4_166, s5_167, s6_168, s7_169, s8_170, s9_187, s11_173, dwArgAC, out s0_328, out s1_329, out a0_320, out a5_832, out s4_334, out s5_335, out s6_336, out s7_337, out s8_338, out s9_833, out s11_331);
	word32 a4_835;
	word32 a3_834;
	rf_pri_txcal_config(0x00, a0_320, out a3_834, out a4_835);
	ui32 a0_354;
	struct Eq_16258 * a5_359;
	ui32 s1_363;
	int32 s11_365;
	word32 s4_368;
	word32 s5_369;
	word32 s6_370;
	word32 s7_371;
	word32 s8_372;
	Eq_2 s9_373;
	word32 s0_836;
	rf_pri_txcal_search_core(s0_328, s1_329, 0x01, 32, 0x10, s4_334, s5_335, s6_336, s7_337, s8_338, a0_320, s11_331, dwArgAC, out s0_836, out s1_363, out a0_354, out a5_359, out s4_368, out s5_369, out s6_370, out s7_371, out s8_372, out s9_373, out s11_365);
	struct Eq_13369 * s0_377 = a5_359->ptr0070;
	(a0_354 << 0x10 | a5_359 & s1_363)->ptr0070 = s0_377;
	Eq_2 a0_387;
	struct Eq_13369 * s0_395;
	ui32 s1_396;
	int32 s11_398;
	word32 s4_401;
	word32 s5_402;
	word32 s6_403;
	word32 s7_404;
	word32 s8_405;
	Eq_2 s9_406;
	word32 a5_837;
	rf_pri_txcal_search_core(s0_377, s1_363, 0x00, s9_373, 0x02, s4_368, s5_369, s6_370, s7_371, s8_372, s9_373, s11_365, dwArgAC, out s0_395, out s1_396, out a0_387, out a5_837, out s4_401, out s5_402, out s6_403, out s7_404, out s8_405, out s9_406, out s11_398);
	word32 a4_839;
	word32 a3_838;
	rf_pri_txcal_config(0x00, a0_387, out a3_838, out a4_839);
	Eq_2 a0_421;
	struct Eq_13369 * s0_429;
	ui32 s1_430;
	int32 s11_432;
	word32 s4_435;
	word32 s5_436;
	word32 s6_437;
	word32 s7_438;
	word32 s8_439;
	word32 s9_841;
	word32 a5_840;
	rf_pri_txcal_search_core(s0_395, s1_396, 0x02, 0x0400, 0x0080, s4_401, s5_402, s6_403, s7_404, s8_405, s9_406, s11_398, dwArgAC, out s0_429, out s1_430, out a0_421, out a5_840, out s4_435, out s5_436, out s6_437, out s7_438, out s8_439, out s9_841, out s11_432);
	word32 a4_843;
	word32 a3_842;
	rf_pri_txcal_config(0x02, a0_421, out a3_842, out a4_843);
	Eq_2 a0_455;
	struct Eq_13369 * s0_463;
	ui32 s1_464;
	int32 s11_466;
	word32 s4_469;
	word32 s5_470;
	word32 s6_471;
	word32 s7_472;
	word32 s8_473;
	Eq_2 s9_474;
	word32 a5_844;
	rf_pri_txcal_search_core(s0_429, s1_430, 0x03, 0x00, 64, s4_435, s5_436, s6_437, s7_438, s8_439, a0_421, s11_432, dwArgAC, out s0_463, out s1_464, out a0_455, out a5_844, out s4_469, out s5_470, out s6_471, out s7_472, out s8_473, out s9_474, out s11_466);
	word32 a3_845;
	word32 a4_846;
	rf_pri_txcal_config(0x03, a0_455, out a3_845, out a4_846);
	Eq_2 a0_488;
	struct Eq_13369 * s0_496;
	ui32 s1_497;
	int32 s11_499;
	word32 s4_502;
	word32 s5_503;
	word32 s6_504;
	word32 s7_505;
	word32 s8_506;
	Eq_2 s9_507;
	word32 a5_847;
	rf_pri_txcal_search_core(s0_463, s1_464, 0x02, s9_474, 64, s4_469, s5_470, s6_471, s7_472, s8_473, s9_474, s11_466, dwArgAC, out s0_496, out s1_497, out a0_488, out a5_847, out s4_502, out s5_503, out s6_504, out s7_505, out s8_506, out s9_507, out s11_499);
	word32 a4_849;
	word32 a3_848;
	rf_pri_txcal_config(0x02, a0_488, out a3_848, out a4_849);
	word32 s6_855;
	word32 s1_851;
	Eq_2 a0_522;
	word32 s4_853;
	word32 s8_857;
	word32 s11_859;
	word32 s9_858;
	word32 s7_856;
	word32 s5_854;
	word32 a5_852;
	word32 s0_850;
	Eq_2 ra_529 = rf_pri_txcal_search_core(s0_496, s1_497, 0x03, 0x00, 32, s4_502, s5_503, s6_504, s7_505, s8_506, s9_507, s11_499, dwArgAC, out s0_850, out s1_851, out a0_522, out a5_852, out s4_853, out s5_854, out s6_855, out s7_856, out s8_857, out s9_858, out s11_859);
	ui32 a4_551;
	word32 a3_860;
	rf_pri_txcal_config(0x03, a0_522, out a3_860, out a4_551);
	struct Eq_12928 * a3_553 = g_ptr4200EB1C;
	struct Eq_16467 * a3_563 = a3_553 & -64 | 0x3F;
	a3_563->dw0008 = a3_553->dw0008;
	struct Eq_16478 * a3_571 = a3_563 & 0xFF00003F | (a0_354 & 63) << 6;
	a3_571->dw0008 = a3_563->dw0008;
	struct Eq_16492 * a3_582 = a3_571 & ~0x007FF000 | (t4_281 & 0x07FF) << 0x0C;
	a3_582->dw0008 = a3_571->dw0008;
	(a3_582 & -0x0400 | a4_551 & 0x03FF)->dw000C = a3_582->dw000C;
	ui32 a2_599;
	word32 s2_607;
	word32 s3_608;
	word32 s8_613;
	word32 a0_861;
	word32 t4_865;
	word32 a5_863;
	word32 a7_864;
	word32 a1_862;
	printf(ra_529, &g_t230AADCC, t4_281, a0_522, s2, dwArg10, dwArg14, s9, dwArg5C, out s1_112, out a0_861, out a1_862, out a2_599, out a3_159, out a4_119, out a5_863, out a7_864, out s2_607, out s3_608, out s4_108, out s5_109, out s6_110, out s7_111, out s8_613, out s9_156, out s10_157, out s11_158, out t4_865);
	s2_155 = s2_607 + ~0x00;
	a5_104 = (struct Eq_16184 *) ~0x00;
	s3_105 = s3_608 + 0x10;
	s8_106 = s8_613 + 56;
	if (s2_607 == 0x00)
	{
		struct Eq_16701 * a5_626;
		rf_pri_txcal_config_hw(a2_599, out a5_626);
		(a5_626 & ~0x03000000)->dw001C = a5_626->dw001C;
		struct Eq_16714 * a5_636 = rf_pri_restore_state_for_cal();
		(a5_636 | 0x00F00000)->dw0014 = a5_636->dw0014;
		struct Eq_16726 * a3_642 = s11_158->ptrFFFFFB1C;
		struct Eq_16730 * s0_641 = (a5_636 | 0x00F00000)->ptr0070;
		((a3_642->t0080 >> 6 & 63) << 16 | ((a3_642->t0080 & 63) << 24 | (a5_636 | 0x00F00000) & ~0x3F000000) & s1_112)->ptr0070 = s0_641;
		struct Eq_16726 * a4_659 = s11_158->ptrFFFFFB1C;
		int32 a5_664 = a4_659->dw0084;
		s0_641->dw0600 = a5_664 & 0x03FF | (a4_659->t0080 & 0x007FF000 | s0_641->dw0600 & s9_156) & -0x0400;
		return a5_664 & 0x03FF;
	}
	goto l2300612C;
}

// 230063D6: Register Eq_2 rf_pri_roscal(Register ui32 a3, Register Eq_2 s3, Register Eq_2 s6, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg38, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg68, Stack Eq_2 dwArg8C, Stack Eq_2 dwArgF8, Stack word32 dwArg0128)
// Called from:
//      rf_pri_init
Eq_2 rf_pri_roscal(ui32 a3, Eq_2 s3, Eq_2 s6, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg38, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg68, Eq_2 dwArg8C, Eq_2 dwArgF8, word32 dwArg0128)
{
	word32 s0_28 = *(word32 *) 0xF4000014;
	struct Eq_16803 * a5_30 = (struct Eq_16803 *) 0xF0000000;
	if ((a3 & 0x0100) != 0x00)
	{
		*(word32 *) 0xF4000014 = s0_28;
		struct Eq_16811 * a5_40;
		rf_pri_manu_pu(0x03, rf_pri_save_state_for_cal(a3 & 0x0100), out a5_40);
		(a5_40 | 0x0200)->dw001C = a5_40->dw001C;
		struct Eq_16827 * a5_51;
		word32 s9_484;
		word32 s10_485;
		word32 s11_486;
		Eq_2 ra_54 = rf_pri_config_channel.constprop.9(s6, s6, dwLoc08, dwArg10, dwArg14, dwArg38, dwArg40, dwArg44, s3, dwArg68, dwArg8C, dwArgF8, out a5_51, out s9_484, out s10_485, out s11_486);
		struct Eq_13999 * a5_77 = a5_51 & ~0x07000000 | 0x06000300;
		a5_77->dw0048 = a5_51->dw0048;
		ui32 a0_80;
		Eq_2 a3_83;
		struct Eq_16852 * a5_85;
		word32 s5_92;
		word32 s4_487;
		word32 s8_488;
		struct Eq_16856 * s0_87 = rf_pri_roscal_iq.isra.3(0x01, a5_77, dwArgF8, out a0_80, out a3_83, out a5_85, out s4_487, out s5_92, out s8_488);
		(a5_85 & -64 | a0_80 & 63)->dw0060 = a5_85->dw0060;
		s0_87->dw016C = s0_87->dw016C & s5_92 + ~0x00 | a0_80 << 0x10;
		struct Eq_16890 * a5_115;
		Eq_2 a3_119;
		ui32 s2_126;
		ui32 s3_127;
		word32 s1_489;
		word32 a0_490;
		word32 a1_491;
		word32 a2_492;
		word32 a4_493;
		word32 a7_494;
		word32 s4_495;
		word32 s5_496;
		word32 s6_497;
		word32 s7_498;
		word32 s8_499;
		word32 s9_500;
		word32 s10_501;
		word32 s11_502;
		word32 t4_503;
		Eq_2 ra_122 = printf(ra_54, &g_t230AAD08, a3_83, s6, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_489, out a0_490, out a1_491, out a2_492, out a3_119, out a4_493, out a5_115, out a7_494, out s2_126, out s3_127, out s4_495, out s5_496, out s6_497, out s7_498, out s8_499, out s9_500, out s10_501, out s11_502, out t4_503);
		(a5_115 & -64 | s3_127)->dw0058 = a5_115->dw0058;
		s0_87->dw016C = s2_126 | s0_87->dw016C & -64;
		struct Eq_16950 * a5_152;
		Eq_2 a3_156;
		ui32 s3_164;
		ui32 s4_165;
		ui32 s5_166;
		word32 s1_504;
		word32 a0_505;
		word32 a1_506;
		word32 a2_507;
		word32 a4_508;
		word32 a7_509;
		word32 s2_510;
		word32 s6_511;
		word32 s7_512;
		word32 s8_513;
		word32 s9_514;
		word32 s10_515;
		word32 s11_516;
		word32 t4_517;
		Eq_2 ra_159 = printf(ra_122, &g_t230AAD1C, a3_119, s6, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_504, out a0_505, out a1_506, out a2_507, out a3_156, out a4_508, out a5_152, out a7_509, out s2_510, out s3_164, out s4_165, out s5_166, out s6_511, out s7_512, out s8_513, out s9_514, out s10_515, out s11_516, out t4_517);
		(a5_152 & -64 | s3_164)->dw0050 = a5_152->dw0050;
		s0_87->dw0168 = s4_165 | s0_87->dw0168 & s5_166;
		struct Eq_17009 * a5_187;
		Eq_2 a3_191;
		ui32 s2_198;
		ui32 s3_199;
		word32 s1_518;
		word32 a0_519;
		word32 a1_520;
		word32 a2_521;
		word32 a4_522;
		word32 a7_523;
		word32 s4_524;
		word32 s5_525;
		word32 s6_526;
		word32 s7_527;
		word32 s8_528;
		word32 s9_529;
		word32 s10_530;
		word32 s11_531;
		word32 t4_532;
		Eq_2 ra_194 = printf(ra_159, &g_t230AAD30, a3_156, s6, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_518, out a0_519, out a1_520, out a2_521, out a3_191, out a4_522, out a5_187, out a7_523, out s2_198, out s3_199, out s4_524, out s5_525, out s6_526, out s7_527, out s8_528, out s9_529, out s10_530, out s11_531, out t4_532);
		(a5_187 & -64 | s3_199)->dw0048 = a5_187->dw0048;
		s0_87->dw0168 = s2_198 | s0_87->dw0168 & -64;
		struct Eq_13999 * a5_223;
		word32 s1_533;
		word32 a0_534;
		word32 a1_535;
		word32 a2_536;
		word32 a3_537;
		word32 a4_538;
		word32 a7_539;
		word32 s2_540;
		word32 s3_541;
		word32 s4_542;
		word32 s5_543;
		word32 s6_544;
		word32 s7_545;
		word32 s8_546;
		word32 s9_547;
		word32 s10_548;
		word32 s11_549;
		word32 t4_550;
		Eq_2 ra_230 = printf(ra_194, &g_t230AAD44, a3_191, s6, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_533, out a0_534, out a1_535, out a2_536, out a3_537, out a4_538, out a5_223, out a7_539, out s2_540, out s3_541, out s4_542, out s5_543, out s6_544, out s7_545, out s8_546, out s9_547, out s10_548, out s11_549, out t4_550);
		ui32 a0_245;
		Eq_2 a3_248;
		struct Eq_17113 * a5_250;
		ui32 s4_256;
		ui32 s8_260;
		word32 s5_551;
		struct Eq_16856 * s0_252 = rf_pri_roscal_iq.isra.3(0x00, a5_223, dwArgF8, out a0_245, out a3_248, out a5_250, out s4_256, out s5_551, out s8_260);
		(a5_250 & s4_256 | (a0_245 & 63) << 6)->dw0060 = a5_250->dw0060;
		s0_252->dw016C = s0_252->dw016C & s8_260 | a0_245 << 0x18;
		struct Eq_17149 * a5_280;
		Eq_2 a3_284;
		ui32 s2_291;
		ui32 s3_292;
		ui32 s4_293;
		ui32 s6_295;
		word32 s1_552;
		word32 a0_553;
		word32 a1_554;
		word32 a2_555;
		word32 a4_556;
		word32 a7_557;
		word32 s5_558;
		word32 s7_559;
		word32 s8_560;
		word32 s9_561;
		word32 s10_562;
		word32 s11_563;
		word32 t4_564;
		Eq_2 ra_287 = printf(ra_230, &g_t230AAD58, a3_248, s6, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_552, out a0_553, out a1_554, out a2_555, out a3_284, out a4_556, out a5_280, out a7_557, out s2_291, out s3_292, out s4_293, out s5_558, out s6_295, out s7_559, out s8_560, out s9_561, out s10_562, out s11_563, out t4_564);
		(a5_280 & s4_293 | s3_292)->dw0058 = a5_280->dw0058;
		s0_252->dw016C = s0_252->dw016C & s6_295 | s2_291 << 0x08;
		struct Eq_17209 * a5_315;
		Eq_2 a3_319;
		ui32 s3_327;
		ui32 s4_328;
		ui32 s7_331;
		ui32 s8_332;
		word32 s1_565;
		word32 a0_566;
		word32 a1_567;
		word32 a2_568;
		word32 a4_569;
		word32 a7_570;
		word32 s2_571;
		word32 s5_572;
		word32 s6_573;
		word32 s9_574;
		word32 s10_575;
		word32 s11_576;
		word32 t4_577;
		Eq_2 ra_322 = printf(ra_287, &g_t230AAD6C, a3_284, s6, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_565, out a0_566, out a1_567, out a2_568, out a3_319, out a4_569, out a5_315, out a7_570, out s2_571, out s3_327, out s4_328, out s5_572, out s6_573, out s7_331, out s8_332, out s9_574, out s10_575, out s11_576, out t4_577);
		(a5_315 & s4_328 | s3_327)->dw0050 = a5_315->dw0050;
		s0_252->dw0168 = s7_331 | s0_252->dw0168 & s8_332;
		struct Eq_17267 * a5_349;
		Eq_2 a3_353;
		ui32 s3_361;
		ui32 s4_362;
		ui32 s5_363;
		ui32 s6_364;
		word32 s1_578;
		word32 a0_579;
		word32 a1_580;
		word32 a2_581;
		word32 a4_582;
		word32 a7_583;
		word32 s2_584;
		word32 s7_585;
		word32 s8_586;
		word32 s9_587;
		word32 s10_588;
		word32 s11_589;
		word32 t4_590;
		Eq_2 ra_356 = printf(ra_322, &g_t230AAD80, a3_319, s6, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_578, out a0_579, out a1_580, out a2_581, out a3_353, out a4_582, out a5_349, out a7_583, out s2_584, out s3_361, out s4_362, out s5_363, out s6_364, out s7_585, out s8_586, out s9_587, out s10_588, out s11_589, out t4_590);
		a5_349->ptr0048->dw0048 = a5_349 & s4_362 | s3_361;
		s0_252->dw0168 = s5_363 | s0_252->dw0168 & s6_364;
		word32 s1_591;
		word32 a0_592;
		word32 a1_593;
		word32 a2_594;
		word32 a3_595;
		word32 a4_596;
		word32 a5_597;
		word32 a7_598;
		word32 s2_599;
		word32 s3_600;
		word32 s4_601;
		word32 s5_602;
		word32 s6_603;
		word32 s7_604;
		word32 s8_605;
		word32 s9_606;
		word32 s10_607;
		word32 s11_608;
		word32 t4_609;
		ra = printf(ra_356, &g_t230AAD94, a3_353, s6, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_591, out a0_592, out a1_593, out a2_594, out a3_595, out a4_596, out a5_597, out a7_598, out s2_599, out s3_600, out s4_601, out s5_602, out s6_603, out s7_604, out s8_605, out s9_606, out s10_607, out s11_608, out t4_609);
		struct Eq_16714 * a5_405 = rf_pri_restore_state_for_cal();
		s0_28 = a5_405->dw0014;
		a5_30 = a5_405 | 0x0C000000;
	}
	a5_30->dw0014 = s0_28;
	0x00 = dwArg0128;
	return ra;
}

