pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0000.c
// 2300660A: Register Eq_2 rf_pri_rccal(Register Eq_2 ra, Register ptr32 fflags, Register ptr32 frm, Stack Eq_2 dwArg18, Stack Eq_2 dwArg38, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgAC, Register out Eq_17389 a5Out, Register out ptr32 s2Out, Register out ptr32 s6Out, Register out ptr32 s9Out)
// Called from:
//      rf_pri_init
Eq_2 rf_pri_rccal(Eq_2 ra, ptr32 fflags, ptr32 frm, Eq_2 dwArg18, Eq_2 dwArg38, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgAC, union Eq_17389 & a5Out, ptr32 & s2Out, ptr32 & s6Out, ptr32 & s9Out)
{
	int32 a3_13 = *(int32 *) 0x40001020;
	int32 a5_16 = *(int32 *) 0x40001014;
	ptr32 s2_12 = 0x40001000;
	Eq_2 a3_17 = a3_13 & 0x0400;
	Eq_17389 a5_18 = a5_16 & ~0x000C0000;
	if ((a3_13 & 0x0400) == 0x00)
		*(int32 *) 0x40001014 = a5_16 & ~0x000C0000;
	else
	{
		*(int32 *) 0x40001014 = a5_16 & ~0x000C0000 | 0x00040000;
		word32 a5_518;
		rf_pri_manu_pu(0x04, rf_pri_save_state_for_cal(a3_13 & 0x0400), out a5_518);
		*(int32 *) 0x40001084 = *(int32 *) 0x40001084 & ~0x03000000 | 0x02000000;
		*(int32 *) 0x4000108C |= 0x01000000;
		*(int32 *) 0x4000101C |= 0x00FFF800;
		ptr32 fflags_55;
		ptr32 frm_56;
		word32 a0_78;
		struct Eq_17446 * a3_81;
		struct Eq_17447 * s2_91;
		word32 a0_519;
		word32 a3_520;
		word32 s2_521;
		word32 fflags_522;
		word32 frm_523;
		Eq_2 ra_88 = rf_pri_rccal_iq(rf_pri_rccal_iq(ra, 0x01, fflags, frm, dwArg98, out a0_519, out a3_520, out s2_521, out fflags_55, out frm_56), 0x00, fflags_55, frm_56, dwArg98, out a0_78, out a3_81, out s2_91, out fflags_522, out frm_523);
		Eq_17471 a4_107 = s2_91->t0080;
		struct Eq_17475 * a3_116 = a3_81 & -64 | a4_107 >> 0x18 & 63;
		a3_116->dw0008 = a3_81->dw0008;
		struct Eq_17489 * a3_123 = a3_116 & 0xFF00003F | (a4_107 >> 0x10 & 63) << 6;
		a3_123->dw0008 = a3_116->dw0008;
		struct Eq_17505 * a3_132 = a3_123 & ~0x0003F000 | (a4_107 >> 0x08 & 63) << 0x0C;
		a3_132->dw0008 = a3_123->dw0008;
		((a4_107 & 63) << 18 | a3_132 & ~0x00FC0000)->dw0008 = a3_132->dw0008;
		ui32 a0_156;
		ui32 a5_157;
		uint32 a3_161;
		word32 t4_539;
		word32 s11_538;
		word32 s10_537;
		word32 s9_536;
		word32 s4_531;
		word32 s5_532;
		word32 s6_533;
		word32 s7_534;
		word32 s8_535;
		word32 a2_526;
		word32 a4_527;
		word32 a7_528;
		word32 s2_529;
		word32 s3_530;
		word32 a1_525;
		word32 s1_524;
		Eq_2 ra_164 = printf(ra_88, &g_t230AACB4, (a3_132 & ~0x00FC0000) >> 6 & 63, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_524, out a0_156, out a1_525, out a2_526, out a3_161, out a4_527, out a5_157, out a7_528, out s2_529, out s3_530, out s4_531, out s5_532, out s6_533, out s7_534, out s8_535, out s9_536, out s10_537, out s11_538, out t4_539);
		struct Eq_17582 * a5_181 = a5_157 & 63;
		uint32 a3_183 = a3_161 >> 6 & 63;
		if ((a5_157 & 63) < a3_183)
			a5_181 = (a5_157 & 63) >> 6 & 63;
		struct Eq_17582 * a3_191 = a3_183 >> 0x0C & 63;
		if (a5_181 < a3_191)
			a5_181 = a5_181 >> 0x0C & 63;
		if (a5_181 < (a3_191 >> 18 & 63))
			a5_181 = a5_181 >> 18 & 63;
		int32 a3_206 = 0x18;
		if (a5_181 > (struct Eq_17582 *) 39)
			a3_206 = 63 - a5_181;
		struct Eq_17623 * a3_217 = a3_206 & 0x00FF;
		struct Eq_17626 * a2_219 = (char *) &a3_217->dw0008 + 31 & 63;
		struct Eq_17631 * a5_221 = a5_181 & -64 | a2_219;
		a5_221->dw0008 = a5_181->dw0008;
		struct Eq_17641 * a5_232 = (a3_217 + (a5_221 >> 6) / 0x0C & 63) << 6 | a2_219 & 0xFF00003F;
		a5_232->dw0008 = a2_219->dw0008;
		struct Eq_17658 * a5_243 = (a3_217 + (a5_232 >> 0x0C) / 0x0C & 63) << 0x0C | (a2_219 & 0xFF00003F) & ~0x0003F000;
		a5_243->dw0008 = (a2_219 & 0xFF00003F)->dw0008;
		((a3_217 + (a5_243 >> 18) / 0x0C & 63) << 18 | a3_217 & ~0x00FC0000)->dw0008 = a3_217->dw0008;
		rf_pri_rccal_config.part.0(a0_156 & 63);
		word32 s11_553;
		word32 s10_552;
		word32 s8_551;
		word32 s3_547;
		word32 a7_546;
		word32 s4_548;
		word32 a4_544;
		word32 a3_543;
		word32 a5_545;
		word32 s1_310;
		word32 s5_549;
		word32 s7_550;
		word32 t4_554;
		word32 a2_542;
		word32 a1_541;
		word32 a0_540;
		printf(ra_164, &g_t230AACB0, rf_pri_rccal_config(0x00, 0x3F) >> 6 & 63, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_310, out a0_540, out a1_541, out a2_542, out a3_543, out a4_544, out a5_545, out a7_546, out s2_12, out s3_547, out s4_548, out s5_549, out s6, out s7_550, out s8_551, out s9, out s10_552, out s11_553, out t4_554);
		rf_pri_restore_state_for_cal();
		if (s1_310 != 0x02 && a0_78 != 0x02)
		{
			*(union Eq_2 *) 0x000C0016 = *(union Eq_2 *) 22;
			a3_17.u0 = 0x000C0000;
			a5_18.u0 = 0x000C0002;
		}
		else
		{
			a3_17 = *(union Eq_2 *) 22;
			*(union Eq_2 *) 0x00080016 = a3_17;
			a5_18.u0 = 0x00080002;
		}
	}
	0x00 = (int8) dwArg38;
	a5Out = a5_18;
	s2Out = s2_12;
	s6Out = s6;
	s9Out = s9;
	return a3_17;
}

// 2300685A: Register (ptr32 Eq_12461) rf_pri_lo_acal(Register (ptr32 Eq_12461) a3, Register (ptr32 Eq_17766) a5, Register Eq_2 s6, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg68, Stack Eq_2 dwArg8C, Stack word32 dwArg0128, Register out ptr32 s3Out, Register out (ptr32 Eq_17774) s6Out)
// Called from:
//      rf_pri_init
struct Eq_12461 * rf_pri_lo_acal(struct Eq_12461 * a3, struct Eq_17766 * a5, Eq_2 s6, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg68, Eq_2 dwArg8C, word32 dwArg0128, ptr32 & s3Out, struct Eq_17774 & s6Out)
{
	(a5 & -0x00C1 | 64)->dw0014 = a5->dw0014;
	struct Eq_17785 * a5_225;
	rf_pri_manu_pu(0x06, rf_pri_save_state_for_cal(a3), out a5_225);
	int32 * s3_226 = &g_dw4200CF64;
	word32 s2_224 = 0x00;
	ui32 s4_216 = ~0x001F0000;
	struct Eq_17774 * s6_218 = &g_t4200F000;
	word32 s5_217 = 0xFE0000FF;
	do
	{
		struct Eq_17923 * s0_50 = a5_225->ptr001C;
		(a5_225 | 16)->ptr001C = s0_50;
		s0_50->dw00A4 = s0_50->dw00A4 & -0x0701 | 0x0400;
		s0_50->dw00A0 = s0_50->dw00A0 & s4_216 | 0x00100000;
		ui32 s7_53 = s2_224 + 8;
		int32 a5_69 = s0_50->dw00A0;
		s0_50->dw00A0 = (word32) ((word32) s6_218->tFFFFFB1C + (s7_53 << 0x01) + 0x0C) & 0x00FF | a5_69 & -0x0100;
		int32 a5_80 = *s3_226;
		s0_50->dw00C4 = a5_80;
		struct Eq_17808 * s0_106;
		ui32 s4_112;
		word32 s8_116;
		word32 s9_117;
		word32 s2_119;
		word32 s3_120;
		word32 s5_121;
		word32 s6_122;
		word32 s7_123;
		ui32 s1_109;
		g_t4200C506();
		while (true)
		{
			ui32 a3_110 = s1_109 << 0x10;
			int32 a5_114 = s0_106->dw00A0 & s4_112 | a3_110;
			s0_106->dw00A0 = a5_114;
			if (s8_116 == s9_117)
				break;
			word32 s1_134;
			word32 s8_136;
			g_t4200C506();
			ui32 a5_148 = 0x01 << s8_136;
			if (s0_106->dw00A4 << 0x13 < 0x00)
				s1_109 = s1_134 - a5_148;
			else
				s1_109 = s1_134 + a5_148;
			s8_116 = s8_136 + ~0x00;
		}
		Eq_2 ra_156;
		struct Eq_17817 * s0_157;
		ui32 s5_161;
		struct Eq_17819 * s6_162;
		ui32 s7_165;
		Eq_2 a3_170;
		uint32 s1_164;
		g_t4200C506();
		if (s0_157->dw00A4 << 0x13 >= 0x00 && s1_164 <= 0x1E)
			++s1_164;
		struct Eq_17831 * s7_187 = (s7_165 << 1) + s6_162->dwFFFFFB1C;
		s7_187->w000C = (word16) ((word32) s7_187->w000C & s5_161 | (s1_164 & 31) << 8);
		struct Eq_12461 * a3_207;
		word32 s2_214;
		word32 s3_215;
		word32 a2_368;
		word32 a1_367;
		word32 a0_366;
		word32 s1_365;
		word32 t4_377;
		word32 s8_373;
		word32 s10_375;
		word32 s11_376;
		word32 s9_374;
		word32 a4_369;
		word32 a7_371;
		word32 s7_372;
		word32 a5_370;
		printf(ra_156, &g_t230AAC90, a3_170, s6, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_365, out a0_366, out a1_367, out a2_368, out a3_207, out a4_369, out a5_370, out a7_371, out s2_214, out s3_215, out s4_216, out s5_217, out s6_218, out s7_372, out s8_373, out s9_374, out s10_375, out s11_376, out t4_377);
		s2_224 = s2_214 + 0x01;
		a5_225 = (struct Eq_17785 *) 0x15;
		s3_226 = s3_215 + 0x04;
	} while (s2_214 != ~0x13);
	struct Eq_16714 * a5_228 = rf_pri_restore_state_for_cal();
	(a5_228 | 0x00C0)->dw0014 = a5_228->dw0014;
	0x00 = dwArg0128;
	s3Out = s3_215 + 0x04;
	s6Out = s6_218;
	return a3_207;
}

// 230069C8: Register (ptr32 Eq_12461) rf_pri_fcal(Register (ptr32 Eq_12461) a3, Register Eq_2 s6, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg68, Stack Eq_2 dwArg8C, Stack word32 dwArg0128, Register out Eq_18009 a5Out, Register out ptr32 s6Out)
// Called from:
//      rf_pri_init
struct Eq_12461 * rf_pri_fcal(struct Eq_12461 * a3, Eq_2 s6, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg68, Eq_2 dwArg8C, word32 dwArg0128, union Eq_18009 & a5Out, ptr32 & s6Out)
{
	word32 s4_28 = (word32) g_w4200EB08;
	word32 s5_29 = (word32) g_w4200EB0A;
	word32 s3_30 = (word32) g_w4200EB0C;
	g_ptr4200EB2C = g_ptr4200EB1C;
	struct Eq_18027 * a5_44;
	word32 a3_42 = rf_pri_manu_pu(0x07, rf_pri_save_state_for_cal(a3), out a5_44);
	struct Eq_18035 * s0_45 = a5_44->ptr001C;
	(a5_44 | 8)->ptr001C = s0_45;
	s0_45->dw00A0 = s0_45->dw00A0 & -0x0100 | 0x0080;
	s0_45->dw00B8 &= ~0x03000000;
	s0_45->dw00A8 = (word32) g_w4200EB0E | s0_45->dw00A8 & 0xF0000000;
	s0_45->dw00C4 = 0x01000000;
	s0_45->dw00C0 |= 0x01000000;
	int32 a5_75 = s0_45->dw00C0;
	s0_45->dw00C0 = a5_75 & ~0x10000000;
	int32 a4_78 = s0_45->dw00B8;
	s0_45->dw00B8 = a4_78 | 0x10000000;
	struct Eq_18104 * s0_85;
	ui32 s1_86;
	ui32 s2_87;
	word32 s6_88;
	word32 s7_89;
	word32 s8_90;
	word32 s9_91;
	word32 s3_92;
	word32 s4_93;
	word32 s5_94;
	word32 a3_98;
	g_t4200C506();
	s0_85->dw00C0 |= s2_87;
	int32 a5_108 = s0_85->dw00B8 & s1_86;
	s0_85->dw00B8 = a5_108;
	struct Eq_18131 * s0_114;
	word32 s1_115;
	word32 s2_116;
	word32 s6_117;
	word32 s7_118;
	word32 s8_119;
	word32 s9_120;
	word32 s3_121;
	word32 s4_122;
	word32 s5_123;
	word32 a3_127;
	g_t4200C506();
	int32 a5_135 = s0_114->dw00A4 & ~0x03 | 2;
	s0_114->dw00A4 = a5_135;
	Eq_13224 s8_146;
	word32 s7_145;
	Eq_2 a3_154;
	word32 s9_147;
	Eq_2 ra_140;
	up32 s4_149;
	ui32 s6_144;
	up32 s5_150;
	up32 s3_148;
	g_t4200C506();
	while (true)
	{
		word32 s2_159;
		Eq_13224 s0_160 = 0x0080;
		for (s2_159 = 0x06; s2_159 != s9_147; s2_159 += ~0x00)
		{
			up32 s0_175;
			up32 a0_166;
			ra_140 = rf_pri_fcal_meas(ra_140, s0_160, s0_160, out a0_166, out a3_154);
			if (a0_166 >= s4_149)
			{
				if (s5_150 >= a0_166)
					break;
				s0_175 = (word32) s0_160 + (s6_144 << s2_159);
			}
			else
				s0_175 = s0_160 - (s6_144 << s2_159);
			s0_160 = (word32) (word16) s0_175;
		}
		if (s8_146 < s0_160)
			break;
		word32 a5_693;
		word32 a3_214;
		ui32 s1_218;
		word32 s3_222;
		word32 s4_223;
		word32 s5_224;
		word32 s6_225;
		word32 s7_226;
		word32 s8_227;
		word32 s9_228;
		word32 a7_694;
		word32 s10_696;
		word32 s2_695;
		word32 s11_697;
		word32 t4_698;
		word32 a1_690;
		word32 a0_689;
		word32 a2_691;
		word32 a4_692;
		printf(ra_140, s7_145 + -936, a3_154, s6, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_218, out a0_689, out a1_690, out a2_691, out a3_214, out a4_692, out a5_693, out a7_694, out s2_695, out s3_222, out s4_223, out s5_224, out s6_225, out s7_226, out s8_227, out s9_228, out s10_696, out s11_697, out t4_698);
		int32 a5_234 = *(int32 *) 0x400010C0 & s1_218;
		*(int32 *) 0x400010C0 = a5_234;
		int32 a4_236 = *(int32 *) 0x400010B8;
		*(int32 *) 0x400010B8 = a4_236 | 0x10000000;
		struct Eq_18236 * s0_243;
		ui32 s1_244;
		ui32 s2_245;
		word32 s6_246;
		word32 s7_247;
		word32 s8_248;
		word32 s9_249;
		word32 s3_250;
		word32 s4_251;
		word32 s5_252;
		word32 a3_256;
		g_t4200C506();
		s0_243->dw00C0 |= s2_245;
		int32 a5_271 = s0_243->dw00B8 & s1_244;
		s0_243->dw00B8 = a5_271;
		g_t4200C506();
	}
	Eq_13224 s1_302 = (word32) (word16) ((word32) s0_160 + 1);
	word32 a3_699;
	word32 a0_304;
	Eq_2 ra_309 = rf_pri_fcal_meas(ra_140, s0_160, s1_302, out a0_304, out a3_699);
	g_w42012AF0 = (word16) a0_304;
	word16 * s4_314 = g_a42011AF2;
	word32 s2_315 = (word32) (word16) ((word32) s0_160 - 38);
	do
	{
		word32 s1_318 = (word32) s1_302 - 1;
		s1_302 = (word32) (word16) s1_318;
		up32 a0_324;
		word32 a3_700;
		ra_309 = rf_pri_fcal_meas(ra_309, s0_160, s1_302, out a0_324, out a3_700);
		*s4_314 = (word16) a0_324;
		if (s3_148 < a0_324)
			break;
		++s4_314;
	} while ((word32) (word16) s1_318 != s2_315);
	struct Eq_18286 * a3_337 = null;
	int32 a5_338 = 0x00;
	up32 s0_342 = (word32) s0_160 + 2;
	do
	{
		up32 a0_348 = (word32) a3_337[553674652];
		while (true)
		{
			uint32 a4_355 = a5_338 << 0x10;
			if ((word32) g_a42011AF0[a5_338 * 0x02] >= a0_348)
				break;
			a5_338 = (int32) (word16) ((a4_355 >> 16) + 1);
		}
		a3_337[553684384] = (struct Eq_18286) (word16) (s0_342 - (a4_355 >> 16));
		if (a5_338 > 0x00)
			a5_338 = (int32) (word16) ((a4_355 >> 16) + -1);
		else
			a5_338 = 0x00;
		++a3_337;
	} while (a3_337 != (struct Eq_18286 *) 42);
	rf_pri_restore_state_for_cal();
	uint16 * s0_379 = g_a42011B40;
	word32 s1_382 = 0x00;
	struct Eq_18354 * s4_383 = &g_t4200F000;
	word32 s3_384 = 0x230AB000;
	do
	{
		struct Eq_18358 * a4_392 = s4_383->dwFFFFFB1C + (s1_382 + 8 << 1);
		ui32 a2_394 = (word32) *s0_379;
		a4_392->w000C = (word16) ((word32) a4_392->w000C & -0x0100 | a2_394 & 0x00FF);
		word32 a7_705;
		word32 s11_711;
		struct Eq_18387 * a5_407;
		struct Eq_12461 * a3_411;
		word32 s2_418;
		ptr32 s6_422;
		word32 t4_712;
		word32 s5_706;
		word32 s8_708;
		word32 s7_707;
		word32 s9_709;
		word32 s10_710;
		word32 a1_702;
		word32 a0_701;
		word32 a2_703;
		word32 a4_704;
		ra_309 = printf(ra_309, s3_384 + -916, a2_394 & 0x00FF, s6, dwLoc08, dwArg40, dwArg44, dwArg68, dwArg8C, out s1_382, out a0_701, out a1_702, out a2_703, out a3_411, out a4_704, out a5_407, out a7_705, out s2_418, out s3_384, out s4_383, out s5_706, out s6_422, out s7_707, out s8_708, out s9_709, out s10_710, out s11_711, out t4_712);
		++s0_379;
	} while (s1_382 != s2_418);
	(a5_407 | 48)->dw0014 = a5_407->dw0014;
	0x00 = dwArg0128;
	a5Out = a5_407 | 48;
	s6Out = s6_422;
	return a3_411;
}

// 23006C62: Register word32 rf_pri_full_cal(Register Eq_2 s6, Register ptr32 fflags, Register ptr32 frm, Stack Eq_2 dwArg00, Stack Eq_2 dwArg04, Stack Eq_2 dwArg08, Stack Eq_2 dwArg1C, Stack Eq_2 dwArg28, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg4C, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgE8, Stack word32 dwArg0118, Register out ptr32 s1Out, Register out ptr32 s2Out, Register out ptr32 fflagsOut, Register out ptr32 frmOut)
// Called from:
//      rf_pri_init
word32 rf_pri_full_cal(Eq_2 s6, ptr32 fflags, ptr32 frm, Eq_2 dwArg00, Eq_2 dwArg04, Eq_2 dwArg08, Eq_2 dwArg1C, Eq_2 dwArg28, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg4C, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArg9C, Eq_2 dwArgB8, Eq_2 dwArgE8, word32 dwArg0118, ptr32 & s1Out, ptr32 & s2Out, ptr32 & fflagsOut, ptr32 & frmOut)
{
	*(struct Eq_10212 **) 0x40001220 &= -97;
	*(struct Eq_10212 **) 0x40001220 |= 33;
	*(struct Eq_10212 **) 0x40001220 |= 64;
	struct Eq_17766 * a5_27;
	Eq_2 s6_39;
	Eq_2 s3_61;
	Eq_2 s6_64;
	struct Eq_16086 * a5_104;
	Eq_2 s2_113;
	Eq_2 s6_117;
	Eq_2 s9_120;
	word32 a5_195;
	struct Eq_18502 * a5_134 = rf_pri_txcal(rf_pri_rccal(rf_pri_roscal(rf_pri_lo_acal(rf_pri_fcal(rf_pri_start_txdfe(out a5_195), s6, dwArg30, dwArg34, dwArg58, dwArg7C, dwArg0118, out a5_27, out s6_39), a5_27, s6_39, dwArg30, dwArg34, dwArg58, dwArg7C, dwArg0118, out s3_61, out s6_64), s3_61, s6_64, dwArg00, dwArg04, dwArg28, dwArg30, dwArg34, dwArg58, dwArg7C, dwArgE8, dwArg0118), fflags, frm, dwArg08, dwArg28, dwArg50, dwArg54, dwArg78, dwArg88, dwArg9C, out a5_104, out s2_113, out s6_117, out s9_120), a5_104, s2_113, s6_117, s9_120, dwLoc08, dwArg00, dwArg04, dwArg1C, dwArg4C, dwArg9C, dwArgB8);
	struct Eq_18530 * s0_155 = a5_134->ptr000C;
	(a5_134 | 6)->ptr000C = s0_155;
	s0_155->dw0220 &= -98;
	s0_155->dw0220 &= 0xFE00067D;
	s1Out = s1_139;
	s2Out = s2_142;
	fflagsOut = fflags_107;
	frmOut = frm_108;
	return ra_137;
}

