pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0000.c
// 23007090: void intc_spurious()
void intc_spurious()
{
	assert_err();
}

// 230070A8: void intc_enable_irq(Register int32 a0)
// Called from:
//      intc_init
void intc_enable_irq(int32 a0)
{
	*(0x01 << a0) = (a0 >> 5) + 0x11244004 << 2;
}

// 230070BE: void intc_init()
// Called from:
//      wifi_main
void intc_init()
{
	intc_enable_irq(63);
	intc_enable_irq(62);
	intc_enable_irq(61);
	intc_enable_irq(0x18);
	intc_enable_irq(0x19);
	intc_enable_irq(0x1A);
	intc_enable_irq(0x1B);
	intc_enable_irq(0x1C);
	intc_enable_irq(0x1D);
	intc_enable_irq(0x1E);
	intc_enable_irq(0x1F);
	intc_enable_irq(32);
	intc_enable_irq(33);
	intc_enable_irq(35);
	intc_enable_irq(55);
	intc_enable_irq(53);
	intc_enable_irq(50);
	intc_enable_irq(52);
	intc_enable_irq(54);
	intc_enable_irq(0x0A);
	intc_enable_irq(11);
}

// 2300715A: void mac_irq(Register word32 ra, Register (ptr32 code) s0, Register (ptr32 (ptr32 Eq_19150)) a4, Register ptr32 mstatus, Stack word32 dwArg10, Stack Eq_2 dwArg18, Stack Eq_2 dwArg38, Stack Eq_2 dwArgC4, Stack Eq_2 dwArgE0, Stack Eq_2 dwArgE4, Stack Eq_2 dwArg0108)
void mac_irq(word32 ra, <anonymous> * s0, struct Eq_19150 ** a4, ptr32 mstatus, word32 dwArg10, Eq_2 dwArg18, Eq_2 dwArg38, Eq_2 dwArgC4, Eq_2 dwArgE0, Eq_2 dwArgE4, Eq_2 dwArg0108)
{
	struct Eq_19150 * a5_5 = *a4;
	if (a4 == null && a5_5->dw0004 == 0x00)
		return;
	word32 a5_16 = *(word32 *) 0x44910040;
	if (s0 != null)
	{
		word32 a3_58;
		Eq_2 ra_30;
		word32 a1_31;
		Eq_2 a0_32;
		word32 s1_59;
		word32 s2_60;
		word32 s3_61;
		word32 s4_62;
		word32 s8_63;
		word32 t3_64;
		word32 tp_65;
		s0();
		ipc_emb_notify(ra_30, a0_32, mstatus, dwArg18, dwArg38, dwArgC4, dwArgE0, dwArgE4, dwArg0108);
	}
	else
		assert_err();
}

// 230071AA: void bl_irq_handler(Register Eq_2 ra, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArg38, Stack Eq_2 dwArgC4, Stack Eq_2 dwArgE0, Stack Eq_2 dwArgE4, Stack Eq_2 dwArg0108)
// Called from:
//      bl_output
void bl_irq_handler(Eq_2 ra, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArg38, Eq_2 dwArgC4, Eq_2 dwArgE0, Eq_2 dwArgE4, Eq_2 dwArg0108)
{
	word32 a5_38;
	ke_evt_set(0x40000000, ipc_host_disable_irq_e2a(), mstatus, out a5_38);
	ipc_emb_notify(ra, 0x40000000, mstatus, dwArg18, dwArg38, dwArgC4, dwArgE0, dwArgE4, dwArg0108);
}

// 230071C2: Register ui32 blmac_soft_reset_getf(Register ui32 s0)
// Called from:
//      hal_machw_stop
//      hal_machw_init
ui32 blmac_soft_reset_getf(ui32 s0)
{
	if ((s0 & -2) == 0x00)
		return s0 & 0x00FF;
	assert_err();
}

// 230071F8: void blmac_wt_2_crypt_clk_ratio_setf(Register ui32 a0)
// Called from:
//      hal_machw_init
void blmac_wt_2_crypt_clk_ratio_setf(ui32 a0)
{
	*(int32 *) 0x44B000F0 = a0 | *((int32 *) 0x44B000F0) & ~0x03;
}

// 2300720A: Register Eq_2 blmac_rx_flow_cntrl_en_setf.constprop.9(Register Eq_2 a5)
// Called from:
//      hal_machw_init
//      hal_machw_reset
Eq_2 blmac_rx_flow_cntrl_en_setf.constprop.9(Eq_2 a5)
{
	Eq_2 a3_5 = *((word32) a5 + 84);
	(a5 & ~0x10000000 | 0x10000000)->t0054 = a3_5;
	return a3_5;
}

// 2300721E: Register word32 blmac_key_sto_ram_reset_setf.constprop.12(Register (ptr32 Eq_19233) a5)
// Called from:
//      hal_machw_init
//      hal_machw_monitor_mode
word32 blmac_key_sto_ram_reset_setf.constprop.12(struct Eq_19233 * a5)
{
	(a5 & ~0x02000000 | 0x02000000)->dw004C = a5->dw004C;
	return 0x02000000;
}

// 23007232: void hal_machw_idle_req(Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus)
// Called from:
//      mm_set_idle_req_handler
//      mm_start_req_handler
//      mm_force_idle_req_handler
//      mm_hw_config_handler
void hal_machw_idle_req(Eq_2 a3, Eq_2 a4, ptr32 mstatus)
{
	Eq_2 a5_5 = *((word32) a4 + 56);
	if ((a4 & 0x0F) != 0x00)
	{
		__csrrc(mstatus, 0x08);
		*((word32) a5_5 + 316) = (word32) *((word32) a5_5 + 288) + 0x0C000350;
		((union Eq_19267 *) 0x44B08088)->u0 = 32;
		*(union Eq_2 *) 0x44B0808C |= 32;
		((word32) a5_5 + 56)->u0 = 0x00;
		*(struct Eq_19281 **) 0x44B08008 = *(struct Eq_19281 **) 0x44B08004;
		__csrrs(mstatus, 0x08);
	}
	else
	{
		word32 a2_45;
		word32 a3_46;
		word32 a4_47;
		word32 a5_48;
		assert_rec(a3, mstatus, out a2_45, out a3_46, out a4_47, out a5_48);
	}
}

// 2300729A: void hal_machw_stop(Register ui32 s0)
// Called from:
//      mm_reset_req_handler
void hal_machw_stop(ui32 s0)
{
	((union Eq_2 *) 0x51)->u0 = 0x44B08000;
	do
		;
	while (blmac_soft_reset_getf(s0) != 0x00);
}

// 230072B2: Register Eq_2 hal_machw_init(Register Eq_2 ra, Register ui32 s0, Stack Eq_2 dwArg18, Stack Eq_2 dwArg38, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg88, Stack Eq_2 dwArgAC)
// Called from:
//      mm_init
Eq_2 hal_machw_init(Eq_2 ra, ui32 s0, Eq_2 dwArg18, Eq_2 dwArg38, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg88, Eq_2 dwArgAC)
{
	((union Eq_2 *) 0x51)->u0 = 0x44B08000;
	do
		;
	while (blmac_soft_reset_getf(s0) != 0x00);
	*(word32 *) 0x44B00404 = 2422327;
	*(int32 *) 0x44B00400 = 0x01;
	*(int32 *) 0x44B00400 = 0x00;
	*(int32 *) 0x44B00400 = 0x0069;
	*(int32 *) 0x44B00400 &= -33;
	*(word32 *) 0x50100023 = 0x44920000;
	Eq_19343 a0_35 = phy_get_mac_freq();
	Eq_19347 s0_36 = *(union Eq_19347 *) 0x44B000E4;
	*(union Eq_19347 *) 0x44B000E4 = *(union Eq_19347 *) 0x44B000E4 & -0x0100 | 40;
	uint32 a5_50 = (word32) a0_35.u1 + (*((union Eq_19347 *) 0x44B000E4) >> 8 & 0x03FF) >> (s0_36 & 0x00FF);
	ui32 s2_52 = a5_50 << 8 & 0x00FFFF00;
	if ((a5_50 << 8 & 0x00FC0000) == 0x00)
	{
		*(union Eq_19347 *) 0x44B000E4 = *(union Eq_19347 *) 0x44B000E4 & ~0x0003FF00 | s2_52;
		*(union Eq_19347 *) 0x44B000E4 = *(union Eq_19347 *) 0x44B000E4 & ~0x0FFC0000 | 0x02200000;
		*(union Eq_19395 *) 0x44B000E8 = (word32) a0_35.u1 + (word32) ((word16) (*((union Eq_19395 *) 0x44B000E8) >> 8)) >> (s0_36 & 0x00FF) << 8 & 0x00FFFF00 | *((union Eq_19395 *) 0x44B000E8) & 0xFF0000FF;
		*(union Eq_19415 *) 0x44B000EC = *(union Eq_19415 *) 0x44B000EC & ~0x3FF00000 | 0x02700000;
		uint32 a5_104 = (word32) a0_35.u1 + (*((union Eq_19415 *) 0x44B000EC) >> 0x0A & 0x03FF) >> (s0_36 & 0x00FF);
		ui32 s2_106 = a5_104 << 0x0A & 0x03FFFC00;
		if ((a5_104 << 0x0A & 0x03F00000) == 0x00)
		{
			*(union Eq_19415 *) 0x44B000EC = *(union Eq_19415 *) 0x44B000EC & ~0x000FFC00 | s2_106;
			*(union Eq_19415 *) 0x44B000EC = *(union Eq_19415 *) 0x44B000EC & -0x0400 | 0x00B4;
			ui32 a0_122 = 0x03;
			if (a0_35 > 0x1D)
			{
				a0_122 = 0x02;
				if (a0_35 > 59)
					a0_122 = 0x01;
			}
			blmac_wt_2_crypt_clk_ratio_setf(a0_122);
			*(union Eq_19469 *) 0x44B000F4 = (word32) a0_35.u1 + (*((union Eq_19469 *) 0x44B000F4) >> 8 & 0x0FFFFFFF) >> (s0_36 & 0x00FF) << 8 & 0x00FFFF00 | *((union Eq_19469 *) 0x44B000F4) & 0xFF0000FF;
			*(union Eq_19489 *) 0x44B000F8 = (word32) a0_35.u1 + (*((union Eq_19489 *) 0x44B000F8) >> 8 & 0x0FFFFFFF) >> (s0_36 & 0x00FF) << 8 & 0x00FFFF00 | *((union Eq_19489 *) 0x44B000F8) & 0xFF0000FF;
			uint32 s2_171 = (word32) a0_35.u1 + (*((union Eq_19510 *) 0x44B00104) >> 0x14 & 0x03FF) >> (s0_36 & 0x00FF);
			if ((s2_171 << 20 & 0xC0000000) == 0x00)
			{
				*(union Eq_19510 *) 0x44B00104 = *(union Eq_19510 *) 0x44B00104 & ~0x3FF00000 | s2_171 << 20;
				uint32 a5_194 = (word32) a0_35.u1 + (*((union Eq_19510 *) 0x44B00104) >> 0x0A & 0x03FF) >> (s0_36 & 0x00FF);
				ui32 s2_196 = a5_194 << 0x0A & 0x03FFFC00;
				if ((a5_194 << 0x0A & 0x03F00000) == 0x00)
				{
					*(union Eq_19510 *) 0x44B00104 = *(union Eq_19510 *) 0x44B00104 & ~0x000FFC00 | s2_196;
					uint32 s0_214 = (word32) a0_35.u1 + (*((union Eq_19510 *) 0x44B00104) & 0x03FF) >> (s0_36 & 0x00FF);
					ui32 s2_219 = (word32) (word16) s0_214;
					if ((s0_214 & 0x0FFFFC00) == 0x00)
					{
						*(union Eq_19510 *) 0x44B00104 = *(union Eq_19510 *) 0x44B00104 & -0x0400 | s2_219;
						*(word32 *) 0x8373F1C0 = 0x44B08000;
						struct Eq_19592 * a5_235 = *(struct Eq_19592 **) 0x8373F198;
						*(struct Eq_19592 **) 0x83000198 = a5_235;
						if (a5_235->t00D8 >> 24 > 0x10)
						{
							word32 s11_402;
							struct Eq_8437 * a0_257;
							word32 t4_403;
							word32 s9_400;
							word32 s10_401;
							word32 s7_398;
							word32 s8_399;
							word32 s5_396;
							word32 s6_397;
							word32 s3_394;
							word32 s4_395;
							word32 a7_392;
							word32 s2_393;
							word32 a4_390;
							word32 a5_391;
							word32 a2_388;
							word32 a3_389;
							word32 s1_386;
							word32 a1_387;
							Eq_2 ra_265 = printf(ra, &g_t230AB960, 0x08, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_386, out a0_257, out a1_387, out a2_388, out a3_389, out a4_390, out a5_391, out a7_392, out s2_393, out s3_394, out s4_395, out s5_396, out s6_397, out s7_398, out s8_399, out s9_400, out s10_401, out s11_402, out t4_403);
							((union Eq_19650 *) 0x44B000D8)->u0 = 0x00021108;
							*(word32 *) 0x44B08080 = 0x800A07C0;
							struct Eq_19656 * s0_287 = *(struct Eq_19656 **) 0x800A080C;
							*(struct Eq_19656 **) 0x840A080C = s0_287;
							blmac_rx_flow_cntrl_en_setf.constprop.9(0x840A07C0);
							*(struct Eq_19656 **) 0x8000003E = s0_287;
							s0_287->dw0114 = 0x0003010A;
							*(struct Eq_19656 **) 0xFF9000C8 = s0_287;
							s0_287->dw0150 = 0x01000000;
							s0_287->dw0224 = 0x00;
							s0_287->dw00A0 = 0x02000020;
							struct Eq_19685 * s0_310 = *(struct Eq_19685 **) 0x0200006C;
							*(struct Eq_19685 **) 0x0300006C = s0_310;
							blmac_key_sto_ram_reset_setf.constprop.12((struct Eq_19233 *) 0x03000020);
							s0_310->dw0510 = 33553445;
							s0_310->dw0310 |= 0x0080;
							ui32 s0_327 = phy_get_ntx(a0_257) + 0x01 << 0x1A;
							if ((s0_327 & 0xE0000000) == 0x00)
							{
								*(int32 *) 0x44B0009C = *(int32 *) 0x44B0009C & ~0x1C000000 | s0_327;
								*(word32 *) 0xE400004B = *(word32 *) 0xE400004B;
								0x00 = (int8) dwArg38;
								return ra_265;
							}
							else
								assert_err();
						}
						else
							assert_err();
					}
					else
						assert_err();
				}
				else
					assert_err();
			}
			else
				assert_err();
		}
		else
			assert_err();
	}
	else
		assert_err();
}

// 230076F4: Register Eq_2 hal_machw_disable_int(Register Eq_2 a3, Register out Eq_5842 a4Out)
// Called from:
//      assert_rec
Eq_2 hal_machw_disable_int(Eq_2 a3, union Eq_5842 & a4Out)
{
	Eq_2 a5_5 = *((word32) a3 + 116);
	(a3 & 0x7FFFFFFF)->t0074 = a5_5;
	Eq_2 a3_10 = *((word32) a5_5 + 0x0080);
	*((word32) a5_5 + 0x0080) = a3_10 & 0x7FFFFFFF;
	a4Out = a3_10 & 0x7FFFFFFF;
	return a3_10;
}

// 23007712: Register Eq_2 hal_machw_reset(Register Eq_2 a4, Stack Eq_2 dwArg28)
// Called from:
//      mm_force_idle_req
//      bl_reset_evt
Eq_2 hal_machw_reset(Eq_2 a4, Eq_2 dwArg28)
{
	if ((*(ui32 *) 0x44B00038 & 0x0F) != 0x00)
		a4 = helper_record_all_states(&g_t230AB3F0, dwArg28);
	Eq_2 a5_25 = *((word32) a4 + 76);
	(a4 & -0x0081)->t004C = a5_25;
	((word32) a5_25 + 56)->u0 = 0x00;
	*(union Eq_2 *) 0xD0 = a5_25;
	do
		a5_25 &= 0x0F;
	while (a5_25 != 0x00);
	Eq_2 a5_38 = *(union Eq_2 *) 0x0080;
	*(union Eq_2 *) 0x7C = a5_38;
	struct Eq_19664 * a3_41 = blmac_rx_flow_cntrl_en_setf.constprop.9(a5_38);
	*(union Eq_2 *) 0x44B0808C &= -64;
	*(word32 *) 0x7B = 0x44B08000;
	*(word32 *) 0x037FF1F7 = 0x44B08000;
	struct Eq_19806 * a5_55 = a3_41->ptr0074;
	(a3_41 & 0x7FFFFFFF | 0x80000000)->ptr0074 = a5_55;
	Eq_2 a4_61 = a5_55->t0080 & 0x7FFFFFFF | 0x80000000;
	a5_55->t0080 = a4_61;
	(a5_55 | 0x0080)->dw004C = a5_55->dw004C;
	return a4_61;
}

// 230077AA: Register (ptr32 Eq_19836) hal_machw_search_addr(Register (ptr32 Eq_19836) a0, Register out Eq_19837 a3Out, Register out Eq_19838 a4Out)
// Called from:
//      rxu_cntrl_frame_handle
//      apm_auth_handler
struct Eq_19836 * hal_machw_search_addr(struct Eq_19836 * a0, union Eq_19837 & a3Out, union Eq_19838 & a4Out)
{
	*(ui32 *) 0x44B000BC = (word32) a0->b0003 << 24 | (((word32) a0->b0001 << 8 | (word32) a0->b0000) | (word32) a0->b0002 << 16);
	*(ui32 *) 0x44B000C0 = (word32) a0->b0005 << 8 | (word32) a0->b0004;
	((union Eq_19879 *) 0x44B000C4)->u0 = 0x20000000;
	do
	{
		Eq_19879 a5_26 = *(union Eq_19879 *) 0x44B000C4;
	} while (a5_26 << 0x02 < 0x00);
	struct Eq_19836 * a0_29 = (struct Eq_19836 *) 0x00FF;
	if (a5_26 << 0x03 >= 0x00)
		a0_29 = (a5_26 >> 0x10) + ~0x07 & 0x00FF;
	a3Out = a5_26 << 0x02;
	a4Out = a5_26 << 0x03;
	return a0_29;
}

// 2300780A: Register Eq_2 hal_machw_monitor_mode(Register Eq_2 a4)
// Called from:
//      mm_hw_config_handler
Eq_2 hal_machw_monitor_mode(Eq_2 a4)
{
	(a4 & ~0x01)->t0074 = *((word32) a4 + 116);
	struct Eq_19912 * a4_11 = a4 & ~0x01 & ~0x02;
	a4_11->dw0074 = (a4 & ~0x01)->dw0074;
	word32 a5_13 = a4_11->dw004C;
	(a4_11 | 0x0700)->dw004C = a5_13;
	*(word32 *) 0x7FFFFFDE = 1107421572;
	int32 a3_19 = g_dw4201E988;
	(a3_19 | 0x7FFFFFDE)->dw0060 = a5_13;
	struct Eq_19233 * a5_22 = (a3_19 | 0x7FFFFFDE)->ptr004C;
	((a3_19 | 0x7FFFFFDE) & ~0x1C000000 | 0x0C000000)->ptr004C = a5_22;
	return blmac_key_sto_ram_reset_setf.constprop.12(a5_22);
}

// 23007850: Register word32 hal_machw_sleep_check(Register out Eq_2 a3Out)
// Called from:
//      bl_sleep
word32 hal_machw_sleep_check(union Eq_2 & a3Out)
{
	Eq_2 a0_10 = *(union Eq_2 *) 0x44B0808C;
	ui32 a5_12;
	for (a5_12 = 0x00; a5_12 != 0x09; ++a5_12)
	{
		word32 s0_35;
		if ((0x01 << a5_12 & a0_10) != 0x00)
		{
			struct Eq_19969 * a3_21 = a5_12 << 0x02;
			a3 = &a3_21->dw44B00128;
			int32 a4_30 = -2000 - *((union Eq_2 *) 0x44B00120) + a3_21->dw44B00128;
			if (a4_30 < 0x00)
			{
				a3 = *(union Eq_2 *) 0x44B00120;
				s0_35 = 0x00;
				if (0x01000388 - a3 + a4_30 >= 0x00)
					goto l230078BE;
				assert_err();
			}
		}
	}
	s0_35 = 0x01;
l230078BE:
	a3Out = a3;
	return s0_35;
}

