pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0000.c
// 230078D2: void hal_machw_gen_handler(Register (ptr32 Eq_20002) s0, Register Eq_2 a3, Register Eq_2 a4, Register ptr32 mstatus)
void hal_machw_gen_handler(struct Eq_20002 * s0, Eq_2 a3, Eq_2 a4, ptr32 mstatus)
{
	struct Eq_20006 * s0_13 = s0 & a4;
	s0_13->dw0070 = s0->dw0074;
	if ((s0_13 & 0x00040001) != 0x00)
	{
		word32 a5_338;
		a4 = ke_evt_set(0x00400000, a4, mstatus, out a5_338);
	}
	if ((s0_13 & 0x00080002) != 0x00)
	{
		word32 a5_339;
		a4 = ke_evt_set(0x00200000, a4, mstatus, out a5_339);
	}
	if ((s0_13 & 4) != 0x00)
	{
		if ((*(ui32 *) 0x44B00038 & 0x0F) != 0x00)
		{
			word32 a5_342;
			word32 a2_341;
			assert_rec(a3, mstatus, out a2_341, out a3, out a4, out a5_342);
		}
		else
		{
			*(union Eq_2 *) 0x44B0808C &= -33;
			*(struct Eq_19281 **) 0x44B08004 = *(struct Eq_19281 **) 0x44B08004;
			word32 a5_340;
			a4 = ke_evt_set(0x00800000, 0x44B08000, mstatus, out a5_340);
		}
	}
	if ((s0_13 & 8) != 0x00)
	{
		Eq_19267 s1_67 = *(union Eq_19267 *) 0x44B08084;
		*(union Eq_19267 *) 0x44B08088 = s1_67;
		if ((s1_67 & 0x0100) != 0x00)
		{
			word32 a5_343;
			a4 = ke_evt_set(0x04000000, a4, mstatus, out a5_343);
		}
		if ((s1_67 & 64) != 0x00)
			a4 = rxl_timeout_int_handler();
		if ((s1_67 & 0x0080) != 0x00)
		{
			word32 a5_348;
			ke_evt_set(0x08000000, a4, mstatus, out a5_348);
		}
		if ((s1_67 & 1) != 0x00)
		{
			word32 a5_351;
			word32 a4_350;
			word32 a2_349;
			assert_rec(a3, mstatus, out a2_349, out a3, out a4_350, out a5_351);
		}
		if ((s1_67 & 2) != 0x00 || ((s1_67 & 4) != 0x00 || ((s1_67 & 8) != 0x00 || ((s1_67 & 16) != 0x00 || (s1_67 & 32) != 0x00))))
		{
			word32 a2_352;
			word32 a4_353;
			word32 a5_354;
			assert_rec(a3, mstatus, out a2_352, out a3, out a4_353, out a5_354);
		}
	}
	if ((s0_13 & 0x0080) == 0x00 && ((s0_13 & 0x0100) == 0x00 && (s0_13 << 0x13 >= 0x00 && (s0_13 << 0x12 >= 0x00 && (s0_13 << 0x11 >= 0x00 && (s0_13 << 0x10 >= 0x00 && (s0_13 << 0x0F >= 0x00 && (s0_13 << 0x0E >= 0x00 && (s0_13 << 0x0A >= 0x00 && (s0_13 << 0x09 >= 0x00 && (s0_13 << 0x07 >= 0x00 && (s0_13 << 0x06 >= 0x00 && s0_13 << 11 >= 0x00))))))))))))
		return;
	word32 a5_347;
	word32 a2_344;
	word32 a4_346;
	word32 a3_345;
	assert_rec(a3, mstatus, out a2_344, out a3_345, out a4_346, out a5_347);
}

// 23007BD4: Register (ptr32 (ptr32 Eq_20209)) mm_rx_filter_set(Register (ptr32 (ptr32 Eq_20209)) a4, Register out (ptr32 Eq_20205) a5Out)
// Called from:
//      mm_env_init
//      mm_hw_info_set
//      mm_hw_ap_info_set
//      mm_hw_ap_info_reset
struct Eq_20209 ** mm_rx_filter_set(struct Eq_20209 ** a4, struct Eq_20205 & a5Out)
{
	struct Eq_20205 * a5_8 = *((char *) *a4 + 4) | a4;
	a5_8->dw0060 = 0x44B00000;
	a5Out = a5_8;
	return (struct Eq_20209 **) 0x44B00000;
}

// 23007BEA: void element_notify_status_enabled()
void element_notify_status_enabled()
{
}

// 23007BEE: Register Eq_2 blmac_ap_setf(Register ui32 a0, Register Eq_2 a5)
// Called from:
//      mm_hw_info_set
//      mm_hw_ap_info_set
//      mm_hw_ap_info_reset
Eq_2 blmac_ap_setf(ui32 a0, Eq_2 a5)
{
	Eq_2 a4_5 = *((word32) a5 + 76);
	(a0 << 1 | a5 & ~0x02)->t004C = a4_5;
	return a4_5;
}

// 23007BFE: Register uint32 ascii_to_hex(Register uint32 a0)
// Called from:
//      mm_sta_add
uint32 ascii_to_hex(uint32 a0)
{
	uint32 a0_13 = a0 + -48 & 0x00FF;
	if (a0_13 <= 0x09)
		return a0_13;
	ui32 a5_14;
	if ((a0 + -97 & 0x00FF) <= 0x05)
		a5_14 = a0 + -87;
	else
	{
		a0_13 = 0x00;
		if ((a0 + -65 & 0x00FF) > 0x05)
			return a0_13;
		a5_14 = a0 + -55;
	}
	a0_13 = a5_14 & 0x00FF;
	return a0_13;
}

// 23007C3A: void element_notify_time_last_received_set()
void element_notify_time_last_received_set()
{
}

// 23007C3E: Register word32 blmac_encr_cntrl_pack.constprop.8(Register ui32 a0, Register ui32 a1, Register (ptr32 Eq_20265) a2, Register ui32 a3, Register ui32 a4, Register ui32 a5, Register Eq_20269 a6, Register ui32 a7, Stack Eq_2 dwArg0128, Register out Eq_20272 s1Out, Register out Eq_20269 s2Out, Register out Eq_20274 s3Out, Register out ptr32 s4Out, Register out Eq_20276 s5Out, Register out Eq_20277 s6Out)
// Called from:
//      mm_sec_machwaddr_wr
//      mm_sec_machwkey_wr
//      mm_sec_machwaddr_del
//      RemoveAPKeyInfo
word32 blmac_encr_cntrl_pack.constprop.8(ui32 a0, ui32 a1, struct Eq_20265 * a2, ui32 a3, ui32 a4, ui32 a5, Eq_20269 a6, ui32 a7, Eq_2 dwArg0128, union Eq_20272 & s1Out, union Eq_20269 & s2Out, union Eq_20274 & s3Out, ptr32 & s4Out, union Eq_20276 & s5Out, union Eq_20277 & s6Out)
{
	if ((a4 << 0x04 & -0x00F1) == 0x00)
	{
		if ((a5 << 2 & -0x0D) == 0x00)
		{
			*(union Eq_19879 *) 0x44B000C4 = a0 << 31 | a7 | a6 << 0x01 | a5 << 2 | a4 << 0x04 | a3 << 0x08 | a2 << 0x10 | a1 << 0x1E;
			0x00 = (int8) dwArg0128;
			s1Out = a5 << 2;
			s2Out = a6;
			s3Out = a1 << 0x1E;
			s4Out = dwArg78;
			s5Out = a3 << 0x08;
			s6Out = a4 << 0x04;
			return dwArgE4;
		}
		else
			assert_err();
	}
	else
		assert_err();
}

// 23007CEA: void element_notify_keepalive_received()
void element_notify_keepalive_received()
{
}

// 23007CEE: Register ui32 hal_machw_rx_duration(Register Eq_20323 a1, Register (ptr32 Eq_20324) a4, Register ptr32 mstatus, Stack word32 dwArg38, Register out Eq_20327 a0Out, Register out ptr32 a4Out, Register out Eq_20323 s2Out)
// Called from:
//      mm_check_beacon
ui32 hal_machw_rx_duration(Eq_20323 a1, struct Eq_20324 * a4, ptr32 mstatus, word32 dwArg38, union Eq_20327 & a0Out, ptr32 & a4Out, union Eq_20323 & s2Out)
{
	word32 a0_13 = a4->dw0028;
	ui32 s1_19 = (word32) (a4 >> 0x0C & 0x0F)->b230ABA0C;
	if ((s1_19 & -0x0080) == 0x00)
	{
		*(ui32 *) 1152418148 = s1_19;
		*(ui32 *) 1152418144 = (a1 >> 0x0F & 0x01) << 24 | a1;
		*(int32 *) 1152418152 = 0x80000000;
		ptr32 a4_40 = 0x44B08000;
		do
			;
		while (*(int32 *) 1152418152 << 0x01 >= 0x00);
		Eq_20327 a0_51;
		if (false)
		{
			word32 a2_100;
			word32 a3_101;
			word32 a5_102;
			assert_rec(0x89610000, mstatus, out a2_100, out a3_101, out a4_40, out a5_102);
			a0_51.u0 = 500;
		}
		else
			a0_51 = (word32) (word16) a0_13;
		0x00 = dwArg38;
		a0Out = a0_51;
		a4Out = a4_40;
		s2Out = a1;
		return s1_19;
	}
	else
		assert_err();
}

// 23007D9E: Register word32 mm_env_max_ampdu_duration_set()
// Called from:
//      mm_env_init
//      mm_hw_config_handler
word32 mm_env_max_ampdu_duration_set()
{
	int32 a5_17 = 0x0096;
	if ((word32) (word16) (*(union Eq_2 *) 0x44B00200 >> 0x0C) != 0x00 && (word32) ((word16) (*((union Eq_2 *) 0x44B00200) >> 0x0C)) <= 0x0096)
		a5_17 = (word32) (word16) (*(union Eq_2 *) 0x44B00200 >> 0x0C);
	g_w4201E98C = (word16) a5_17;
	int32 a5_25 = 0x0096;
	if ((word32) (word16) (*(union Eq_2 *) 0x44B00204 >> 0x0C) != 0x00 && (word32) ((word16) (*((union Eq_2 *) 0x44B00204) >> 0x0C)) <= 0x0096)
		a5_25 = (word32) (word16) (*(union Eq_2 *) 0x44B00204 >> 0x0C);
	g_w4201E98E = (word16) a5_25;
	int32 a5_42 = 0x0096;
	if ((word32) (word16) (*(union Eq_2 *) 0x44B00208 >> 0x0C) != 0x00 && (word32) ((word16) (*((union Eq_2 *) 0x44B00208) >> 0x0C)) <= 0x0096)
		a5_42 = (word32) (word16) (*(union Eq_2 *) 0x44B00208 >> 0x0C);
	g_w4201E990 = (word16) a5_42;
	int32 a5_59 = 0x0096;
	if ((word32) (word16) (*(union Eq_2 *) 0x44B0020C >> 0x0C) != 0x00 && (word32) ((word16) (*((union Eq_2 *) 0x44B0020C) >> 0x0C)) <= 0x0096)
		a5_59 = (word32) (word16) (*(union Eq_2 *) 0x44B0020C >> 0x0C);
	g_w4201E992 = (word16) a5_59;
	g_w4201E994 = (word16) a5_59;
	return 1107421572;
}

// 23007E70: Register Eq_2 mm_env_init(Register Eq_2 ra)
// Called from:
//      mm_init
Eq_2 mm_env_init(Eq_2 ra)
{
	word32 t1_41;
	word32 a0_42;
	word32 a1_43;
	word32 a2_44;
	word32 a3_45;
	word32 a4_46;
	word32 a5_47;
	Eq_2 ra_18 = memset(ra, 1107421572, 0x00, 44, out t1_41, out a0_42, out a1_43, out a2_44, out a3_45, out a4_46, out a5_47);
	g_t4201E9A6.u1 = 0x0101;
	g_t4201E996.u1 = 0x00;
	g_dw4201E988 = 0x00;
	*(word32 *) 0x7FFFFFDE = 1107421572;
	word32 a5_48;
	mm_rx_filter_set((struct Eq_20209 **) 0x7FFFFFDE, out a5_48);
	mm_env_max_ampdu_duration_set();
	return ra_18;
}

// 23007EB4: Register Eq_2 mm_init(Register Eq_2 ra, Register ui32 s0, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg48, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg68, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgAC, Stack word32 dwArgF8, Stack Eq_2 dwArg0108, Stack word32 dwArg0118, Stack Eq_2 dwArg0168, Register out ptr32 s0Out, Register out ptr32 a3Out, Register out ptr32 a4Out)
// Called from:
//      bl_init
//      mm_reset_req_handler
Eq_2 mm_init(Eq_2 ra, ui32 s0, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg48, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg68, Eq_2 dwArg6C, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArg9C, Eq_2 dwArgAC, word32 dwArgF8, Eq_2 dwArg0108, word32 dwArg0118, Eq_2 dwArg0168, ptr32 & s0Out, ptr32 & a3Out, ptr32 & a4Out)
{
	Eq_2 a4_44;
	Eq_2 s2_50;
	Eq_2 a3_62;
	struct Eq_8437 * a0_109;
	Eq_2 a4_122;
	Eq_2 ra_151 = rxl_init(txl_cntrl_init(ps_init(td_init(sta_mgmt_init(vif_mgmt_init(mm_env_init(hal_machw_init(ra, s0, dwArg08, dwArg28, dwArg50, dwArg54, dwArg78, dwArg9C)), out a4_44, out s2_50), a4_44, s2_50, dwLoc08, dwArg18, dwArg40, dwArg44, dwArg60, dwArg64, dwArg68, dwArg88, dwArg8C, dwArgAC, out a3_62), a3_62, dwLoc08, dwArg08, dwArg18, dwArg28, dwArg40, dwArg44, dwArg50, dwArg54, dwArg68, dwArg78, dwArg8C, dwArg9C), out a0_109), a0_109, dwArgF8, dwArg0168, out a4_122), a4_122, mstatus, dwArg20, dwArg24, dwArg48, dwArg6C, dwArg0108);
	mm_timer_init();
	ptr32 s0_194;
	Eq_2 ra_193 = chan_init(scan_init(ra_151, mstatus), dwArg0118, out s0_194);
	hal_dma_init();
	ptr32 a3_217;
	ptr32 a4_218;
	Eq_2 ra_220 = mm_bcn_init(ra_193, out a3_217, out a4_218);
	s0Out = s0_194;
	a3Out = a3_217;
	a4Out = a4_218;
	return ra_220;
}

// 23007EF0: Register Eq_2 mm_active(Register ptr32 mstatus, Register out ptr32 a4Out, Register out ptr32 s2Out)
// Called from:
//      mm_reset
//      chan_goto_idle_cb
//      chan_tx_cfm
//      chan_ctxt_op_evt
//      mm_monitor_enable_req_handler
//      mm_set_idle_req_handler
//      mm_start_req_handler
Eq_2 mm_active(ptr32 mstatus, ptr32 & a4Out, ptr32 & s2Out)
{
	((union Eq_2 *) 0x68)->u0 = 0x44B00000;
	ptr32 a4_11;
	ptr32 s2_16;
	word32 s1_24;
	word32 a0_25;
	word32 a1_26;
	word32 a5_27;
	word32 s3_28;
	word32 s4_29;
	Eq_2 s0_14 = ke_state_set(0x00, 0x01, mstatus, out s1_24, out a0_25, out a1_26, out a4_11, out a5_27, out s2_16, out s3_28, out s4_29);
	a4Out = a4_11;
	s2Out = s2_16;
	return s0_14;
}

// 23007F02: void mm_reset(Register ptr32 mstatus, Stack Eq_2 dwArg28)
// Called from:
//      bl_reset_evt
void mm_reset(ptr32 mstatus, Eq_2 dwArg28)
{
	word32 a0_7;
	word32 a2_66;
	word32 a4_67;
	word32 s2_68;
	ke_state_get(0x00, dwArg28, out a0_7, out a2_66, out a4_67, out s2_68);
	if (a0_7 != 0x01)
	{
		word32 s1_71;
		word32 a0_72;
		word32 a1_73;
		word32 a4_74;
		word32 a5_75;
		word32 s2_76;
		word32 s3_77;
		word32 s4_78;
		ke_state_set(0x00, 0x00, mstatus, out s1_71, out a0_72, out a1_73, out a4_74, out a5_75, out s2_76, out s3_77, out s4_78);
	}
	else
	{
		word32 a4_69;
		word32 s2_70;
		mm_active(mstatus, out a4_69, out s2_70);
	}
}

// 23007F26: void mm_tbtt_evt(Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 s2, Register ptr32 fflags, Register ptr32 frm, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg48, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArgBC, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0158)
void mm_tbtt_evt(Eq_2 a3, Eq_2 a4, Eq_2 s2, ptr32 fflags, ptr32 frm, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg48, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArgBC, Eq_2 dwArgF8, Eq_2 dwArg0128, Eq_2 dwArg0158)
{
	struct Eq_5817 * s0_7 = g_ptr420217C8;
	if ((s0_7 & 0x00600000) != 0x00600000)
	{
		ke_evt_clear(s0_7 & 0x00600000, a4, mstatus);
		__csrrc(mstatus, 0x08);
		txl_cntrl_halt_ac(0x04);
		word32 s2_213;
		word32 a1_211;
		word32 mstatus_214;
		word32 a5_212;
		Eq_2 s0_103;
		Eq_2 s5_110;
		Eq_2 a4_162;
		Eq_2 ra_102 = txl_cntrl_flush_ac(0x04, dwArg88, out s0_103, out a1_211, out a4_162, out a5_212, out s2_213, out s5_110, out mstatus_214);
		__csrrs(mstatus, 0x08);
		Eq_2 s1_104 = 0x02;
		while (s0_103 != 0x00)
		{
			if ((word32) *((word32) s0_103 + 86) == s1_104)
			{
				ui32 a5_63 = (word32) *((word32) s0_103 + 833) + ~0x00 & 0x00FF;
				*((word32) s0_103 + 833) = (byte) a5_63;
				if (a5_63 == 0x00)
				{
					*((word32) s0_103 + 833) = (byte) (word32) *((word32) s0_103 + 832);
					struct Eq_20889 * s2_78;
					struct Eq_20890 * s3_79;
					word32 a5_216;
					s1_104 = vif_mgmt_bcn_to_prog(s0_103, a4_162, mstatus, out a5_216, out s2_78, out s3_79);
					s0_103 = *((word32) a3 + 64);
					a4_162 = s2_78->t0120;
					int32 a5_86 = s3_79->dw0040;
					if (a3 != 0x00)
					{
						struct Eq_20916 * a5_89 = (word32) a4_162 + (a5_86 << 5);
						word32 a1_217;
						word32 s9_223;
						word32 s10_224;
						word32 s6_221;
						word32 s7_222;
						word32 s3_219;
						word32 s4_220;
						word32 a2_218;
						ra_102 = chan_tbtt_switch_update(ra_102, a5_89 + ((word32) (*((word32) s0_103 + 0x033E)) << 0x0A) / 0x0044, a3, a5_89, mstatus, s2, dwArg88, dwArgF8, dwArg0158, out s0_103, out s1_104, out a1_217, out a2_218, out a3, out a4_162, out s3_219, out s4_220, out s5_110, out s6_221, out s7_222, out s9_223, out s10_224);
					}
				}
			}
			s0_103 = *s0_103;
		}
		word32 s8_215;
		mm_bcn_transmit(ra_102, s5_110, fflags, frm, mstatus, dwArg08, dwArg48, dwArg88, dwArg8C, dwArgBC, dwArgF8, dwArg0128, out s8_215);
	}
	else
		assert_err();
}

// 23007FE6: Register word32 mm_sec_machwaddr_wr(Register (ptr32 Eq_20976) a0, Register ui32 a1, Stack Eq_2 dwArg0118, Register out (ptr32 Eq_20979) a0Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out)
// Called from:
//      mm_sta_add
word32 mm_sec_machwaddr_wr(struct Eq_20976 * a0, ui32 a1, Eq_2 dwArg0118, struct Eq_20979 & a0Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out)
{
	*(ui32 *) 0x44B000BC = (word32) a0->w4201EC30 << 16 | (word32) a0->w4201EC2E;
	*(ui32 *) 0x44B000C0 = (word32) a0->w4201EC32;
	*(byte **) 0x44B000AC = null;
	*(byte **) 0x44B000B0 = null;
	*(byte **) 0x44B000B4 = null;
	*(byte **) 0x44B000B8 = null;
	word32 s1_42;
	ptr32 s2_43;
	ptr32 s3_44;
	ptr32 s4_45;
	word32 s6_87;
	word32 s5_86;
	word32 s0_41 = blmac_encr_cntrl_pack.constprop.8(0x00, 0x01, a0 + 8 & 0x00FF, 0x00, a1, 0x00, 0x01, 0x00, dwArg0118, out s1_42, out s2_43, out s3_44, out s4_45, out s5_86, out s6_87);
	do
		;
	while (*(union Eq_19879 *) 0x44B000C4 << 0x01 < 0x00);
	a0Out = s0_41;
	s2Out = s2_43;
	s3Out = s3_44;
	s4Out = s4_45;
	return s1_42;
}

