pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0000.c
// 23008060: Register Eq_2 mm_sec_machwkey_wr(Register Eq_2 ra, Register (ptr32 Eq_21047) a0, Stack Eq_2 dwArg0108, Register out (ptr32 Eq_20979) s0Out, Register out (ptr32 Eq_21050) s1Out, Register out (ptr32 Eq_20979) a0Out, Register out Eq_21052 a3Out, Register out ptr32 a4Out, Register out Eq_19879 a5Out, Register out ptr32 s2Out, Register out (ptr32 byte) s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out)
// Called from:
//      mm_sta_add
//      add_key_to_mac
//      add_mfp_key_to_mac
//      mm_key_add_req_handler
Eq_2 mm_sec_machwkey_wr(Eq_2 ra, struct Eq_21047 * a0, Eq_2 dwArg0108, struct Eq_20979 & s0Out, struct Eq_20979 & s1Out, struct Eq_20979 & a0Out, union Eq_21052 & a3Out, ptr32 & a4Out, union Eq_19879 & a5Out, ptr32 & s2Out, byte & s3Out, ptr32 & s4Out, ptr32 & s5Out)
{
	Eq_2 ra_176;
	ui32 s3_119;
	struct Eq_20265 * s0_109;
	struct Eq_21062 * s1_38;
	Eq_21063 s2_15 = (word32) a0->b0001;
	ui32 s3_18 = (word32) a0->b0029;
	if (s2_15 == 0x00FF)
	{
		ui32 s0_62 = (s3_18 << 0x02) + (word32) a0->b0000;
		*(ui32 *) 0x44B000BC = ~0x00;
		*(ui32 *) 0x44B000C0 = ~0x00;
		ra_176 = vif_mgmt_add_key(ra, a0, s0_62 & 0x00FF, out s0_109, out s1_38, out s3_119);
	}
	else
	{
		if (s2_15 > 11)
			assert_err();
		struct Eq_21133 * s2_39;
		ra_176 = sta_mgmt_add_key(ra, a0, (word32) s2_15.u1 + 8 & 0x00FF, out s0_109, out s1_38, out s2_39, out s3_119);
		*(ui32 *) 0x44B000BC = (word32) s2_39->w4201EC30 << 16 | (word32) s2_39->w4201EC2E;
		*(ui32 *) 0x44B000C0 = (word32) s2_39->w4201EC32;
	}
	struct Eq_21108 * a3_89 = (word32) s1_38->b0028;
	if (a3_89 > (struct Eq_21108 *) 0x03)
		assert_err();
	else
	{
		ui32 a7_102 = (word32) a3_89->b230CB874;
		ui32 a3_103 = (word32) a3_89->b230CB878;
		*(byte **) 0x44B000AC = &a3_89->b230CB874;
		*(byte **) 0x44B000B0 = &a3_89->b230CB874;
		*(byte **) 0x44B000B4 = &a3_89->b230CB874;
		struct Eq_21188 * s1_116 = a3_89->ptr230CB888;
		*(byte **) 0x44B000B8 = &a3_89->b230CB874;
		struct Eq_20979 * s1_127;
		ptr32 s2_128;
		byte * s3_129;
		ptr32 s5_131;
		word32 s6_199;
		word32 s4_198;
		struct Eq_20979 * s0_126 = blmac_encr_cntrl_pack.constprop.8(0x00, 0x01, s0_109, a3_103, s3_119, (word32) s1_116->b002A, 0x00, a7_102, dwArg0108, out s1_127, out s2_128, out s3_129, out s4_198, out s5_131, out s6_199);
		do
		{
			Eq_19879 a5_140 = *(union Eq_19879 *) 0x44B000C4;
		} while (a5_140 << 0x01 < 0x00);
		s0Out = s0_126;
		s1Out = s1_127;
		a0Out = s0_126;
		a3Out = a5_140 << 0x01;
		a4Out = 0x44B00000;
		a5Out = a5_140;
		s2Out = s2_128;
		s3Out = s3_129;
		s4Out = dwArg04;
		s5Out = s5_131;
		return ra_176;
	}
}

// 23008190: Register word32 mm_sec_machwkey_del(Register (ptr32 Eq_20265) a0, Stack Eq_2 dwArg0118, Register out ptr32 a2Out, Register out ptr32 a4Out, Register out ptr32 s2Out, Register out (ptr32 Eq_21218) s3Out, Register out (ptr32 Eq_21219) s6Out)
// Called from:
//      mm_sta_del
//      apm_sta_remove
//      keyMgmtKeyGroupTxDone.isra.1
//      RemoveAPKeyInfo
//      mm_key_del_req_handler
word32 mm_sec_machwkey_del(struct Eq_20265 * a0, Eq_2 dwArg0118, ptr32 & a2Out, ptr32 & a4Out, ptr32 & s2Out, struct Eq_21218 & s3Out, struct Eq_21219 & s6Out)
{
	if (a0 > (struct Eq_20265 *) 0x07)
	{
		struct Eq_21222 * a5_24 = (char *) a0 - 8 & 0x00FF;
		*(ui32 *) 0x44B000BC = (word32) a5_24->w4201EC30 << 16 | (word32) a5_24->w4201EC2E;
		*(ui32 *) 0x44B000C0 = (word32) a5_24->w4201EC32;
		sta_mgmt_del_key(a0);
	}
	else
	{
		*(ui32 *) 0x44B000BC = ~0x00;
		*(ui32 *) 0x44B000C0 = ~0x00;
		vif_mgmt_del_key(a0, a1);
	}
	*(byte **) 0x44B000AC = null;
	*(byte **) 0x44B000B0 = null;
	*(byte **) 0x44B000B4 = null;
	*(byte **) 0x44B000B8 = null;
	word32 s1_57;
	ptr32 s2_58;
	struct Eq_21218 * s3_59;
	struct Eq_21219 * s6_62;
	word32 s5_105;
	word32 s4_104;
	blmac_encr_cntrl_pack.constprop.8(0x00, 0x01, a0, 0x00, 0x00, 0x00, 0x00, 0x00, dwArg0118, out s1_57, out s2_58, out s3_59, out s4_104, out s5_105, out s6_62);
	do
		;
	while (*(union Eq_19879 *) 0x44B000C4 << 0x01 < 0x00);
	a2Out = dwArg10;
	a4Out = 0x44B00000;
	s2Out = s2_58;
	s3Out = s3_59;
	s6Out = s6_62;
	return s1_57;
}

// 23008246: Register word32 mm_sec_machwaddr_del(Register (ptr32 Eq_21304) a0, Stack Eq_2 dwArg0118, Register out ptr32 s3Out)
// Called from:
//      mm_sta_del
word32 mm_sec_machwaddr_del(struct Eq_21304 * a0, Eq_2 dwArg0118, ptr32 & s3Out)
{
	*(ui32 *) 0x44B000BC = ~0x00;
	*(ui32 *) 0x44B000C0 = ~0x00;
	*(byte **) 0x44B000AC = null;
	*(byte **) 0x44B000B0 = null;
	*(byte **) 0x44B000B4 = null;
	*(byte **) 0x44B000B8 = null;
	ptr32 s3_31;
	word32 s6_71;
	word32 s5_70;
	word32 s4_69;
	word32 s2_68;
	word32 s1_67;
	blmac_encr_cntrl_pack.constprop.8(0x00, 0x01, (char *) a0 + 8 & 0x00FF, 0x00, 0x00, 0x00, 0x00, 0x00, dwArg0118, out s1_67, out s2_68, out s3_31, out s4_69, out s5_70, out s6_71);
	do
		;
	while (*(union Eq_19879 *) 0x44B000C4 << 0x01 < 0x00);
	s3Out = s3_31;
	return 0x44B00000;
}

// 23008298: void mm_hw_idle_evt(Register Eq_2 a4, Register ptr32 mstatus)
void mm_hw_idle_evt(Eq_2 a4, ptr32 mstatus)
{
	ke_evt_clear(0x00800000, a4, mstatus);
	word32 s1_30;
	word32 a0_31;
	word32 a1_32;
	word32 a4_33;
	word32 a5_34;
	word32 s2_35;
	word32 s3_36;
	word32 s4_37;
	ke_state_set(0x00, 0x00, mstatus, out s1_30, out a0_31, out a1_32, out a4_33, out a5_34, out s2_35, out s3_36, out s4_37);
}

// 230082B0: Register word32 mm_hw_info_set(Register Eq_2 a0, Register Eq_2 a5, Register out ptr32 a5Out)
// Called from:
//      vif_mgmt_register
word32 mm_hw_info_set(Eq_2 a0, Eq_2 a5, ptr32 & a5Out)
{
	struct Eq_21386 * a4_13 = blmac_ap_setf(0x00, a5);
	word32 a5_15 = a4_13->dw004C;
	(a4_13 | 1)->dw004C = a5_15;
	*(word32 *) 0x011C = a5_15;
	((union Eq_2 *) 0x44B080A4)->u0 = 0x00;
	*(struct Eq_21405 **) 0x44B080A8 = null;
	((word32) *((word32) a0 + 3) << 24 | (((word32) (*((word32) a0 + 1)) << 8 | (word32) (*a0)) | (word32) (*((word32) a0 + 2)) << 16))->dw0010 = a5_15;
	struct Eq_21436 * a4_37 = (word32) *((word32) a0 + 5) << 8 | (word32) (*((word32) a0 + 4));
	a4_37->dw0014 = a5_15;
	(a4_37 & -0x0701)->dw004C = a4_37->dw004C;
	g_dw4201F984 = 889423244;
	ptr32 a5_50;
	word32 a4_49 = mm_rx_filter_set(&g_ptr4201F000, out a5_50);
	a5Out = a5_50;
	return a4_49;
}

// 2300832A: void mm_hw_ap_info_set(Register (ptr32 Eq_21468) a3, Register Eq_2 a5)
// Called from:
//      vif_mgmt_register
void mm_hw_ap_info_set(struct Eq_21468 * a3, Eq_2 a5)
{
	blmac_ap_setf(0x01, a5);
	g_dw4201F984 = 889693580;
	word32 a5_29;
	mm_rx_filter_set(&g_ptr4201F000, out a5_29);
	*(word32 *) 0x00040071 = 0x44B08000;
	(a3 | 0x00040001)->dw0074 = a3->dw0074;
}

