pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0000.c
// 23008360: Register word32 mm_hw_ap_info_reset(Register Eq_2 a5)
// Called from:
//      vif_mgmt_unregister
word32 mm_hw_ap_info_reset(Eq_2 a5)
{
	blmac_ap_setf(0x00, a5);
	g_dw4201F984 = 889423244;
	word32 a5_30;
	mm_rx_filter_set(&g_ptr4201F000, out a5_30);
	*(word32 *) 0x00040071 = 0x44B08000;
	*(union Eq_2 *) 116 = *(union Eq_2 *) 262261;
	return ~0x00040001;
}

// 2300839C: Register Eq_2 mm_back_to_host_idle(Register ptr32 mstatus, Stack Eq_2 dwArg28, Register out ptr32 s2Out)
// Called from:
//      chan_ctxt_op_evt
Eq_2 mm_back_to_host_idle(ptr32 mstatus, Eq_2 dwArg28, ptr32 & s2Out)
{
	word32 a0_7;
	word32 a2_74;
	word32 a4_75;
	word32 s2_76;
	ke_state_get(0x00, dwArg28, out a0_7, out a2_74, out a4_75, out s2_76);
	if (a0_7 == 0x03)
	{
		if ((word32) g_t4201E9A6 != 0x00)
		{
			ptr32 s2_34;
			word32 s1_78;
			word32 a0_79;
			word32 a1_80;
			word32 a4_81;
			word32 a5_82;
			word32 s3_83;
			word32 s4_84;
			Eq_2 s0_32 = ke_state_set(0x00, 0x00, mstatus, out s1_78, out a0_79, out a1_80, out a4_81, out a5_82, out s2_34, out s3_83, out s4_84);
			s2Out = s2_34;
			return s0_32;
		}
		else
		{
			ptr32 s2_50;
			word32 a4_77;
			Eq_2 s0_48 = mm_active(mstatus, out a4_77, out s2_50);
			s2Out = s2_50;
			return s0_48;
		}
	}
	else
		assert_err();
}

// 230083E2: Register Eq_2 mm_force_idle_req(Register Eq_2 ra, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg48, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Register out ptr32 s1Out, Register out ptr32 a4Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out)
// Called from:
//      chan_goto_idle_cb
//      chan_tx_cfm
//      chan_ctxt_op_evt
Eq_2 mm_force_idle_req(Eq_2 ra, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg48, Eq_2 dwArg6C, Eq_2 dwArg0108, Eq_2 dwArg0118, ptr32 & s1Out, ptr32 & a4Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out)
{
	__csrrc(mstatus, 0x08);
	Eq_2 a4_17;
	word32 s5_94;
	Eq_2 ra_46 = txl_reset(rxl_reset(ra, hal_machw_reset(a4, dwArg18), mstatus, dwArg20, dwArg24, dwArg48, dwArg6C, dwArg0108, out a4_17), a4_17, mstatus, dwArg0118, out s5_94);
	ptr32 a4_65;
	ptr32 s1_69;
	ptr32 s2_70;
	ptr32 s3_71;
	ptr32 s4_72;
	word32 a0_95;
	word32 a1_96;
	word32 a5_97;
	ke_state_set(0x00, 0x03, mstatus, out s1_69, out a0_95, out a1_96, out a4_65, out a5_97, out s2_70, out s3_71, out s4_72);
	g_w4201F996 = 0x00;
	__csrrs(mstatus, 0x08);
	s1Out = s1_69;
	a4Out = a4_65;
	s2Out = s2_70;
	s3Out = s3_71;
	s4Out = s4_72;
	return ra_46;
}

// 23008410: Register Eq_2 mm_sta_add(Register Eq_2 ra, Register (ptr32 Eq_21638) s1, Register (ptr32 Eq_21638) a0, Register (ptr32 byte) a1, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s2, Register Eq_2 s7, Register ptr32 mstatus, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg38, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0118, Register out (ptr32 Eq_21660) s0Out, Register out ptr32 a0Out, Register out ptr32 s4Out, Register out ptr32 s5Out)
// Called from:
//      mm_sta_add_req_handler
//      me_sta_add_req_handler
Eq_2 mm_sta_add(Eq_2 ra, struct Eq_21638 * s1, struct Eq_21638 * a0, byte * a1, Eq_2 a4, Eq_2 a5, Eq_2 s2, Eq_2 s7, ptr32 mstatus, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg38, Eq_2 dwArg5C, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgD8, Eq_2 dwArgF8, Eq_2 dwArg0118, struct Eq_20979 & s0Out, ptr32 & a0Out, ptr32 & s4Out, ptr32 & s5Out)
{
	word24 nLoc57_450 = SLICE(dwLoc58, word24, 8);
	ptr32 a0_32;
	byte * s3_38;
	struct Eq_21669 * s7_52;
	ptr32 s4_187;
	struct Eq_20979 * s0_294;
	Eq_2 ra_46 = sta_mgmt_register(ra, a0, a1, a4, a5, s2, dwLoc58, dwLoc10, dwLoc0C, dwArg18, s7, out s0_294, out a0_32, out s3_38, out s4_187, out s7_52);
	ptr32 s2_196 = a0_32;
	if (a0_32 != 0x00)
	{
l2300847C:
		s0Out = s0_294;
		a0Out = s2_196;
		s4Out = s4_187;
		s5Out = s4;
		return dwArg68;
	}
	else
	{
		word32 a0_64;
		byte * s3_297;
		struct Eq_21705 * s1_295 = mm_sec_machwaddr_wr((word32) *s3_38, (word32) s7_52->b0011, dwArgB8, out a0_64, out s2_196, out s3_297, out s4_187);
		s0_294->b0000 = (byte) a0_64;
		s0_294 = (struct Eq_20979 *) &g_t4201FF78;
		if ((word32) s1_295->b420205A6 != 0x00)
			goto l2300847C;
		if ((word32) s1_295->b42020938 == 0x00)
		{
l23008468:
			s0_294 += s1_295 + 0x05D8;
			s0_294->b0060 = (byte) (word32) *s3_297;
			s2_196 = 0x00;
			goto l2300847C;
		}
		g_b42021441 = (byte) (word32) *s3_297;
		s4_187 = 0x42021000;
		if ((s1_295->b42020938 & 0x12FFF800) != 0x00)
		{
			(word32) *((word32) g_t42021740 + 0x0181) == 0x00;
			s0_294 = set_psk(ra_46, mstatus, dwLoc28, dwArg18, dwArg68, dwArg78, dwArg88, dwArg98, dwArgA8, dwArgB8, dwArgD8, dwArgF8, dwArg0118, out s1_295, out s2_196, out s3_297, out s4_187);
			goto l230084D4;
		}
		if (((word32) s1_295->b42020939 & 0x02) == 0x00)
			goto l230084D4;
		Eq_2 a3_107;
		word32 a1_715;
		word32 a2_716;
		word32 a4_717;
		word32 a5_718;
		strlen((word32) g_t42021740 + 0x0141, out a1_715, out a2_716, out a3_107, out a4_717, out a5_718);
		int32 * s5_132;
		int32 * s6_133;
		word32 a0_720;
		word32 a2_722;
		word32 a3_723;
		word32 s1_719;
		word32 a1_721;
		word32 a7_726;
		word32 a4_724;
		word32 a5_725;
		word32 s3_728;
		word32 s9_732;
		word32 s10_733;
		word32 s8_731;
		word32 a5_742;
		word32 a3_740;
		word32 a0_737;
		word32 s2_727;
		word32 s7_730;
		word32 s4_729;
		word32 s11_734;
		word32 t4_735;
		word32 a4_741;
		word32 t1_736;
		word32 a2_739;
		word32 a1_738;
		Eq_2 ra_148 = memset(printf(ra_46, &g_t230ABB38, a3_107, dwLoc58, s2, dwArg10, dwArg14, dwArg38, dwArg5C, out s1_719, out a0_720, out a1_721, out a2_722, out a3_723, out a4_724, out a5_725, out a7_726, out s2_727, out s3_728, out s4_729, out s5_132, out s6_133, out s7_730, out s8_731, out s9_732, out s10_733, out s11_734, out t4_735), fp + -92, 0x00, 44, out t1_736, out a0_737, out a1_738, out a2_739, out a3_740, out a4_741, out a5_742);
		Eq_2 a3_158;
		word32 a4_745;
		word32 a5_746;
		word32 a1_743;
		word32 a2_744;
		Eq_2 a0_157 = strlen(*s6_133 + 0x0141, out a1_743, out a2_744, out a3_158, out a4_745, out a5_746);
		Eq_2 dwLoc58_451 = SEQ(nLoc57_450, (byte) (a0_157 & 0x00FF));
		if ((a0_157 & 0x00FF) != 0x05 && (a0_157 & 0x00FF) != 0x0D)
		{
			if ((a0_157 & 0x00FF) != 0x0A && (a0_157 & 0x00FF) != 0x1A)
			{
				Eq_2 a4_179;
				byte * s3_186;
				word32 a3_770;
				word32 a4_771;
				word32 a3_758;
				word32 a5_759;
				word32 a7_760;
				word32 s5_762;
				word32 t4_769;
				word32 s6_763;
				word32 s11_768;
				word32 s7_764;
				word32 s9_766;
				word32 s10_767;
				word32 s8_765;
				word32 s2_761;
				word32 a2_757;
				word32 a1_756;
				word32 s1_754;
				word32 a0_755;
				sta_mgmt_unregister(printf(ra_148, &g_t230ABB50, a3_158, dwLoc58_451, s2, dwArg10, dwArg14, dwArg38, dwArg5C, out s1_754, out a0_755, out a1_756, out a2_757, out a3_758, out a4_179, out a5_759, out a7_760, out s2_761, out s3_186, out s4_187, out s5_762, out s6_763, out s7_764, out s8_765, out s9_766, out s10_767, out s11_768, out t4_769), 1107427192, (word32) *s3_186, a4_179, out a3_770, out a4_771);
				s2_196 = 0x01;
				goto l2300847C;
			}
			int32 s8_214 = a0_157 & 0x00FF;
			if ((a0_157 & 1) != 0x00)
				s8_214 = a0_157 & 0x00FE;
			if (s8_214 != 0x00)
			{
				int32 s7_221 = 0x00;
				struct Eq_22069 * s5_222 = *s5_132 + 0x0141;
				do
				{
					++s5_222;
					((s7_221 >> 0x01) + (fp + -48))->b0FDC = (byte) ((ascii_to_hex((word32) s5_222->b0000) << 4) + ascii_to_hex((word32) s5_222->bFFFFFFFF));
					s7_221 += 0x02;
				} while (s7_221 < s8_214);
			}
		}
		else
		{
			word32 a3_749;
			word32 a5_751;
			word32 a6_752;
			word32 a7_753;
			word32 a4_750;
			word32 a2_748;
			word32 a1_747;
			memcpy(fp + -84, *s5_132 + 0x0141, a0_157 & 0x00FF, out a1_747, out a2_748, out a3_749, out a4_750, out a5_751, out a6_752, out a7_753);
		}
		word32 a0_285;
		word32 a3_772;
		word32 a4_773;
		word32 s5_775;
		word32 a5_774;
		mm_sec_machwkey_wr(ra_148, fp + -92, dwArgA8, out s0_294, out s1_295, out a0_285, out a3_772, out a4_773, out a5_774, out s2_196, out s3_297, out s4_187, out s5_775);
		g_b4200FB20 = (byte) a0_285;
l230084D4:
		struct Eq_21793 * a4_356;
		word32 a5_348 = s0_294 + (s1_295 + 0x05D8);
		if ((a5_348->dw03E8 & 0x12000000) != 0x00)
			a4_356 = (word32) a5_348->b03EF;
		else
		{
			if (((word32) a5_348->b03E9 & 0x08) == 0x00)
				goto l23008506;
			a4_356 = (word32) a5_348->b03EF;
		}
		s0_294 = supplicantEnable(a4_356, s1, dwArgF8, dwArg0118, out s1_295, out s2_196, out s3_297, out s4_187);
l23008506:
		if (CONVERT(Mem349[s1_295 + 0x05D8 + s0_294 + 86:byte], byte, word32) == 0x00)
			goto l23008468;
		goto l2300847C;
	}
}

