pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0000.c
// 2300865E: Register Eq_2 mm_sta_del(Register Eq_2 ra, Register word32 s1, Register (ptr32 Eq_21304) a0, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg8C, Stack word32 dwArgA8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0158, Register out ptr32 a3Out, Register out ptr32 a4Out)
// Called from:
//      mm_sta_del_req_handler
Eq_2 mm_sta_del(Eq_2 ra, word32 s1, struct Eq_21304 * a0, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg8C, word32 dwArgA8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0118, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0158, ptr32 & a3Out, ptr32 & a4Out)
{
	struct Eq_22146 * s6_140 = (word32) a0->b4201EC2A;
	struct Eq_21304 * s3_102 = a0;
	if ((word32) s6_140->b420205A6 == 0x00)
	{
		s6_140->b420205B0 = ~0x00;
		if ((word32) s6_140->b42020938 != 0x00)
		{
			Eq_2 s1_121 = 1107427192;
			if ((s6_140->b42020938 & 0x12FFF800) != 0x00)
			{
				struct Eq_22199 * s2_157;
				word32 s3_368;
				word32 s6_369;
				word32 a4_367;
				word32 a2_366;
				mm_sec_machwkey_del((word32) g_b42021444, dwArgF8, out a2_366, out a4_367, out s2_157, out s3_368, out s6_369);
				struct Eq_22215 * s2_176;
				word32 s3_372;
				word32 s6_373;
				word32 a2_370;
				word32 a4_371;
				mm_sec_machwkey_del((word32) s2_157->b0003, dwArgF8, out a2_370, out a4_371, out s2_176, out s3_372, out s6_373);
				Eq_2 a4_190;
				word32 a2_374;
				word32 s2_375;
				word32 s3_376;
				word32 s6_377;
				mm_sec_machwkey_del((word32) s2_176->b0005, dwArgF8, out a2_374, out a4_190, out s2_375, out s3_376, out s6_377);
				struct Eq_22247 * s2_212;
				word32 t1_378;
				word32 a0_379;
				word32 a1_380;
				word32 a2_381;
				word32 a3_382;
				word32 a4_383;
				word32 a5_384;
				ra = memset(supplicantDisable(ra, a4_190, dwArg0118, dwArg0138, dwArg0158, out s2_212), s2_212->dw0008 + 0x04, 0x00, 0x0022, out t1_378, out a0_379, out a1_380, out a2_381, out a3_382, out a4_383, out a5_384);
				s1_121 = remove_psk(ra, dwArgD8, dwArgE8, dwArgF8, dwArg0128, dwArg0138, dwArg0158, out s3_102, out s6_140);
			}
			else if (((word32) s6_140->b42020939 & 0x02) != 0x00)
			{
				struct Eq_20265 * a0_125 = (word32) g_b4200EB20;
				if (a0_125 != (struct Eq_20265 *) 0x00FF)
				{
					word32 a2_418;
					word32 a4_419;
					word32 s2_420;
					s1_121 = mm_sec_machwkey_del(a0_125, dwArgF8, out a2_418, out a4_419, out s2_420, out s3_102, out s6_140);
				}
			}
			Mem265[s1_121 + (s6_140 + 0x05D8) + 1000:byte] = 0x00;
		}
	}
	else
	{
		Eq_2 a4_34 = (word32) a0->b4201EC2C;
		if (a4_34 == 0x01)
		{
			ui32 a5_38 = (word32) s6_140->b4202089A + ~0x00 & 0x00FF;
			s6_140->b4202089A = (byte) a5_38;
			if (a5_38 == 0x00)
			{
				ui32 s1_44 = (word32) s6_140->b420205A7 + 0x0A & 0x00FF;
				Eq_2 a0_49;
				word32 s1_58;
				ptr32 s2_59;
				word32 s0_385;
				word32 a1_386;
				word32 a2_387;
				word32 a3_388;
				word32 a4_389;
				word32 a5_390;
				word32 a6_391;
				word32 s3_392;
				word32 s4_393;
				word32 s8_394;
				Eq_2 ra_56 = ke_msg_alloc(ra, 73, 0x0D, 0x02, a4_34, mstatus, dwLoc08, out s0_385, out s1_58, out a0_49, out a1_386, out a2_387, out a3_388, out a4_389, out a5_390, out a6_391, out s2_59, out s3_392, out s4_393, out s8_394);
				(s2_59 + (s1_44 + 432))->b001C = 0x00;
				*a0_49 = (byte) s1_58;
				*((word32) a0_49 + 1) = 0x00;
				word32 s1_395;
				word32 a0_396;
				word32 a1_397;
				word32 a2_398;
				word32 a3_399;
				word32 a4_400;
				word32 a5_401;
				word32 s2_402;
				word32 s3_403;
				word32 s4_404;
				word32 s8_405;
				Eq_2 s0_77 = ke_msg_send(a0_49, mstatus, out s1_395, out a0_396, out a1_397, out a2_398, out a3_399, out a4_400, out a5_401, out s2_402, out s3_403, out s4_404, out s8_405);
				word32 s0_406;
				word32 s1_407;
				word32 a1_408;
				word32 a2_409;
				word32 a4_410;
				word32 s4_411;
				word32 s5_412;
				word32 s6_413;
				word32 s7_414;
				word32 s9_415;
				word32 s10_416;
				word32 s11_417;
				ra = apm_tx_int_ps_clear(ra_56, s0_77, (word32) *((word32) s0_77 + 87) + 0x0A & 0x00FF, s1_44 + 432, mstatus, s2, dwArg48, dwArg58, dwArg8C, dwArgF8, out s0_406, out s1_407, out a1_408, out a2_409, out a4_410, out s3_102, out s4_411, out s5_412, out s6_413, out s7_414, out s9_415, out s10_416, out s11_417);
			}
		}
	}
	struct Eq_22021 * s3_283;
	Eq_2 a4_276 = mm_sec_machwaddr_del(s3_102, dwArgF8, out s3_283);
	0x00 = dwArgA8;
	ptr32 a3_305;
	ptr32 a4_306;
	Eq_2 ra_308 = sta_mgmt_unregister(ra, s1, s3_283, a4_276, out a3_305, out a4_306);
	a3Out = a3_305;
	a4Out = a4_306;
	return ra_308;
}

// 230087A8: Register Eq_2 mm_cfg_element_keepalive_timestamp_update(Register Eq_2 a4, Register out Eq_2 a5Out)
// Called from:
//      rxu_cntrl_frame_handle
Eq_2 mm_cfg_element_keepalive_timestamp_update(Eq_2 a4, union Eq_2 & a5Out)
{
	word32 a5_19;
	Eq_2 a0_6 = xTaskGetTickCount(out a5_19);
	Eq_2 a5_10 = *((word32) a4 + 36);
	*((word32) a0_6 + 40) = a5_10;
	*((word32) a4 + 37) = a5_10;
	a5Out = a5_10;
	return (word32) a4 + 1;
}

// 230087C6: Register Eq_2 mm_send_connection_loss_ind(Register Eq_2 ra, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg08, Register out (ptr32 Eq_22526) s1Out, Register out ptr32 a4Out)
// Called from:
//      mm_ap_probe_cfm
//      ps_enable_cfm
//      ps_disable_cfm
//      vif_mgmt_switch_channel
Eq_2 mm_send_connection_loss_ind(Eq_2 ra, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg08, struct Eq_22526 & s1Out, ptr32 & a4Out)
{
	Eq_2 a0_16;
	struct Eq_22529 * s0_24;
	word32 s1_60;
	word32 a1_61;
	word32 a2_62;
	word32 a3_63;
	word32 a4_64;
	word32 a5_65;
	word32 a6_66;
	word32 s2_67;
	word32 s3_68;
	word32 s4_69;
	word32 s8_70;
	Eq_2 ra_23 = ke_msg_alloc(ra, 67, 0x06, 0x01, a4, mstatus, dwArg08, out s0_24, out s1_60, out a0_16, out a1_61, out a2_62, out a3_63, out a4_64, out a5_65, out a6_66, out s2_67, out s3_68, out s4_69, out s8_70);
	*a0_16 = (byte) (word32) s0_24->b0057;
	ptr32 a4_42;
	struct Eq_22526 * s1_46;
	word32 a0_71;
	word32 a1_72;
	word32 a2_73;
	word32 a3_74;
	word32 a5_75;
	word32 s2_76;
	word32 s3_77;
	word32 s4_78;
	word32 s8_79;
	ke_msg_send(a0_16, mstatus, out s1_46, out a0_71, out a1_72, out a2_73, out a3_74, out a4_42, out a5_75, out s2_76, out s3_77, out s4_78, out s8_79);
	s1Out = s1_46;
	a4Out = a4_42;
	return ra_23;
}

// 230087EE: void mm_ap_probe_cfm(Register Eq_2 ra, Register (ptr32 Eq_22593) a0, Register ui32 a1, Register ptr32 mstatus, Stack Eq_2 dwArg08)
void mm_ap_probe_cfm(Eq_2 ra, struct Eq_22593 * a0, ui32 a1, ptr32 mstatus, Eq_2 dwArg08)
{
	if (a1 << 0x08 >= 0x00)
	{
		word32 s1_62;
		word32 a4_63;
		mm_send_connection_loss_ind(ra, a1 << 0x08, mstatus, dwArg08, out s1_62, out a4_63);
	}
	else
		a0->b0074 = 0x00;
}

// 23008800: Register word32 mm_check_rssi(Register Eq_2 ra, Register Eq_2 a0, Register Eq_22616 a1, Register Eq_2 a3, Register ptr32 mstatus, Stack Eq_2 dwArg74, Stack word32 dwArgB4, Stack Eq_2 dwArg0128, Register out Eq_22616 s1Out, Register out Eq_22623 s2Out, Register out Eq_22616 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out Eq_22616 s6Out)
// Called from:
//      mm_check_beacon
word32 mm_check_rssi(Eq_2 ra, Eq_2 a0, Eq_22616 a1, Eq_2 a3, ptr32 mstatus, Eq_2 dwArg74, word32 dwArgB4, Eq_2 dwArg0128, union Eq_22616 & s1Out, union Eq_22623 & s2Out, union Eq_22616 & s3Out, ptr32 & s4Out, ptr32 & s5Out, union Eq_22616 & s6Out)
{
	Eq_2 s0_115;
	Eq_22616 s6_21 = (int32) *((word32) a0 + 117);
	Eq_22616 s1_100 = (int32) *((word32) a0 + 118);
	ptr32 s5_23 = (word32) *((word32) a0 + 0x0077);
	Eq_22623 s2_105 = (word32) *((word32) a0 + 0x0078);
	((word32) a0 + 117)->u0 = (byte) a1;
	Eq_22616 s3_108 = a1;
	word32 a5_37;
	Eq_2 a4_129 = bl60x_current_time_us(fp + -40, out a5_37);
	if (s6_21 != 0x00)
	{
		a4_129 = a3 - g_dw4200F318;
		s0_115 = dwArg74;
		int32 a5_46 = a5_37 - dwArgB4 - (word32) (a3 < a4_129);
		if (a5_46 <= 0x00 && (a5_46 != 0x00 || a4_129 <= 2000000))
		{
l2300889C:
			if (s1_100 != 0x00)
			{
				int32 a5_104 = (int32) (byte) s5_23;
				if (s2_105 == 0x00)
				{
					if (s3_108 < s6_21)
					{
						s1_100 -= a5_104;
						s2_105 = (word32) (s3_108 < s1_100);
					}
				}
				else if (s6_21 < s3_108)
				{
					s1_100 = (word32) ((word32) s1_100.u0 + a5_104 < s3_108);
					s2_105 = s1_100 ^ 1;
				}
				if ((word32) *((word32) s0_115 + 0x0078) != s2_105)
				{
					Eq_2 a0_132;
					struct Eq_22781 * s0_140;
					word32 s2_142;
					word32 s3_143;
					word32 s1_311;
					word32 a1_312;
					word32 a2_313;
					word32 a3_314;
					word32 a4_315;
					word32 a5_316;
					word32 a6_317;
					word32 s4_318;
					word32 s8_319;
					ke_msg_alloc(ra, 87, 0x0D, 0x03, a4_129, mstatus, dwLoc18, out s0_140, out s1_311, out a0_132, out a1_312, out a2_313, out a3_314, out a4_315, out a5_316, out a6_317, out s2_142, out s3_143, out s4_318, out s8_319);
					word32 a4_150 = (word32) s0_140->b0057;
					*((word32) a0_132 + 1) = (byte) s2_142;
					*((word32) a0_132 + 2) = (byte) s3_143;
					*a0_132 = (byte) a4_150;
					word32 a0_320;
					word32 a1_321;
					word32 a2_322;
					word32 a3_323;
					word32 a4_324;
					word32 a5_325;
					word32 s4_326;
					word32 s8_327;
					s0_115 = ke_msg_send(a0_132, mstatus, out s1_100, out a0_320, out a1_321, out a2_322, out a3_323, out a4_324, out a5_325, out s2_105, out s3_108, out s4_326, out s8_327);
				}
				*((word32) s0_115 + 0x0078) = (byte) s2_105;
			}
			0x00 = (int8) dwArg0128;
			s1Out = s1_100;
			s2Out = s2_105;
			s3Out = s3_108;
			s4Out = dwArg78;
			s5Out = s5_23;
			s6Out = s6_21;
			return dwArgE4;
		}
	}
	word32 s8_303;
	Eq_2 a0_59;
	word32 a5_64;
	struct Eq_22670 * s0_67;
	word32 s2_69;
	word32 s3_70;
	struct Eq_22673 * s4_71;
	word32 a2_299;
	word32 a1_298;
	word32 s1_297;
	word32 a3_300;
	word32 a4_301;
	word32 a6_302;
	ra = ke_msg_alloc(ra, 87, 0x0D, 0x03, a4_129, mstatus, dwLoc18, out s0_67, out s1_297, out a0_59, out a1_298, out a2_299, out a3_300, out a4_301, out a5_64, out a6_302, out s2_69, out s3_70, out s4_71, out s8_303);
	word32 a4_77 = (word32) s0_67->b0057;
	*((word32) a0_59 + 1) = (byte) s2_69;
	*((word32) a0_59 + 2) = (byte) s3_70;
	*a0_59 = (byte) a4_77;
	s4_71->dw0000 = a4_77;
	s4_71->dw0004 = a5_64;
	word32 a0_304;
	word32 a1_305;
	word32 a2_306;
	word32 a3_307;
	word32 a5_308;
	word32 s4_309;
	word32 s8_310;
	s0_115 = ke_msg_send(a0_59, mstatus, out s1_100, out a0_304, out a1_305, out a2_306, out a3_307, out a4_129, out a5_308, out s2_105, out s3_108, out s4_309, out s8_310);
	goto l2300889C;
}

// 23008904: Register Eq_2 mm_send_csa_traffic_ind(Register Eq_2 ra, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg08, Register out Eq_2 s0Out, Register out (ptr32 Eq_22859) s1Out, Register out ptr32 a3Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s8Out)
// Called from:
//      mm_check_beacon
//      mm_sta_tbtt
//      me_beacon_check
Eq_2 mm_send_csa_traffic_ind(Eq_2 ra, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg08, union Eq_2 & s0Out, struct Eq_22859 & s1Out, ptr32 & a3Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s8Out)
{
	Eq_2 a0_20;
	word32 s0_28;
	word32 s1_29;
	word32 a1_72;
	word32 a2_73;
	word32 a3_74;
	word32 a4_75;
	word32 a5_76;
	word32 a6_77;
	word32 s2_78;
	word32 s3_79;
	word32 s4_80;
	word32 s8_81;
	Eq_2 ra_27 = ke_msg_alloc(ra, 89, 0x0D, 0x02, a4, mstatus, dwArg08, out s0_28, out s1_29, out a0_20, out a1_72, out a2_73, out a3_74, out a4_75, out a5_76, out a6_77, out s2_78, out s3_79, out s4_80, out s8_81);
	*a0_20 = (byte) s1_29;
	*((word32) a0_20 + 1) = (byte) s0_28;
	ptr32 a3_46;
	struct Eq_22859 * s1_51;
	ptr32 s2_52;
	ptr32 s3_53;
	ptr32 s4_54;
	ptr32 s8_55;
	word32 a0_82;
	word32 a1_83;
	word32 a2_84;
	word32 a4_85;
	word32 a5_86;
	s0Out = ke_msg_send(a0_20, mstatus, out s1_51, out a0_82, out a1_83, out a2_84, out a3_46, out a4_85, out a5_86, out s2_52, out s3_53, out s4_54, out s8_55);
	s1Out = s1_51;
	a3Out = a3_46;
	s2Out = s2_52;
	s3Out = s3_53;
	s4Out = s4_54;
	s8Out = s8_55;
	return ra_27;
}

// 23008932: Register Eq_2 mm_check_beacon(Register Eq_2 ra, Register (ptr32 Eq_22930) a1, Register Eq_2 a3, Register (ptr32 Eq_22932) a4, Register (ptr32 Eq_22933) a5, Register ptr32 fflags, Register ptr32 frm, Register ptr32 mstatus, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg5C, Stack word32 dwArg64, Stack Eq_2 dwArg78, Stack Eq_2 dwArg98, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArg010C, Stack word32 dwArg0148, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out ptr32 s9Out, Register out Eq_22950 s10Out)
// Called from:
//      rxl_cntrl_evt
Eq_2 mm_check_beacon(Eq_2 ra, struct Eq_22930 * a1, Eq_2 a3, struct Eq_22932 * a4, struct Eq_22933 * a5, ptr32 fflags, ptr32 frm, ptr32 mstatus, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg5C, word32 dwArg64, Eq_2 dwArg78, Eq_2 dwArg98, Eq_2 dwArgB8, Eq_2 dwArgD8, Eq_2 dwArg010C, word32 dwArg0148, ptr32 & s1Out, ptr32 & a0Out, ptr32 & s9Out, union Eq_22950 & s10Out)
{
	struct Eq_22951 * a0_31 = a5->ptr0008;
	Eq_20323 s7_117 = (word32) a0_31->w001C;
	word32 a5_37 = a4->dw0000;
	a1->b0074 = 0x00;
	a4->dw0001 = a5_37;
	struct Eq_22951 * s5_104 = a0_31;
	if ((word32) a1->b007A != 0x00)
	{
		struct Eq_22990 * s0_60;
		word32 s1_661;
		word32 s2_662;
		word32 s3_663;
		word32 s8_665;
		word32 s4_664;
		ra = mm_send_csa_traffic_ind(ra, &a4->dw0001, mstatus, dwLoc48, out s0_60, out s1_661, out a3, out s2_662, out s3_663, out s4_664, out s8_665);
		s0_60->b007A = 0x00;
	}
	Eq_2 a4_73 = *(union Eq_2 *) 0x44B00120;
	Eq_2 s0_125 = *((word32) a4_73 + 0x006C);
	if ((word32) a4_73 + (30000000 - a4_73) < 0x00 && (word32) g_b4201E9A7 != 0x00)
	{
		word32 a0_91;
		struct Eq_23066 * s1_100;
		word32 s4_671;
		word32 s6_672;
		word32 a4_667;
		word32 a5_668;
		word32 s2_669;
		word32 s3_670;
		ra = txl_frame_send_null_frame(ra, (word32) *((word32) s0_125 + 96), null, fflags, frm, mstatus, dwLoc08, dwArg28, dwArg5C, dwArg78, dwArg98, dwArgB8, dwArg0148, out s0_125, out s1_100, out a0_91, out a3, out a4_667, out a5_668, out s2_669, out s3_670, out s4_671, out s5_104, out s6_672, out s7_117);
		if (a0_91 == 0x00)
			s1_100->ptr0120->t006C = s0_125;
	}
	word32 s1_144;
	struct Eq_23013 * s2_145;
	struct Eq_23014 * s3_146;
	struct Eq_23015 * s5_148;
	struct Eq_23046 ** s6_149;
	word32 s4_147;
	struct Eq_23018 * s0_143 = mm_check_rssi(ra, s0_125, (int32) s5_104->b0033, a3, mstatus, dwArg24, dwArg64, dwArgD8, out s1_144, out s2_145, out s3_146, out s4_147, out s5_148, out s6_149);
	word32 a4_666;
	struct Eq_23033 * a0_158 = co_crc32(&s2_145->b001F + 1, 0x04, null, out a4_666);
	*s6_149 = (struct Eq_23046 **) null;
	struct Eq_23046 * s8_165 = &s2_145->b001F + 5;
	Eq_23053 s1_166 = (word32) (word16) s1_144;
	word32 a5_169 = 0x05;
	Eq_23058 a4_170 = ~0x01;
	while (s1_166 > 0x01)
	{
		Eq_23037 s9_175 = (word32) s8_165->b0001;
		word32 a3_176 = (word32) s8_165->b0000;
		struct Eq_23033 * s10_177 = s8_165 + 1;
		if ((word32) s9_175 + 1 >= s1_166)
			break;
		if (a3_176 == a5_169)
			*s6_149 = (struct Eq_23046 **) s8_165;
		else
		{
			a0_158 = co_crc32(s10_177, s9_175, a0_158, out a4_170);
			a5_169 = 0x05;
		}
		s1_166 = CONVERT(SLICE(s1_166 + (a4_170 - s9_175), word16, 0), word16, word32);
		s8_165 = s10_177 + s9_175;
	}
	a0_158->ptr0070 = s0_143;
	struct Eq_20324 * a4_243 = (word32) s2_145->b001E << 16 | ((word32) s2_145->b001D << 8 | (word32) s2_145->b001C);
	ptr32 s9_218 = (word32) s3_146->w0016;
	Eq_2 s3_232 = (word32) s2_145->b001B << 24 | ((word32) s2_145->b001A << 16 | ((word32) s2_145->b0019 << 8 | (word32) s2_145->b0018));
	Eq_22950 s10_237 = s5_148->t0020;
	Eq_2 s8_247 = (word32) s2_145->b001F << 24 | a4_243;
	if ((word32) s0_143->w005C == 0x00)
	{
		struct Eq_23046 * a5_249 = *s6_149;
	}
	word32 a0_268;
	struct Eq_20324 * a4_272;
	word32 s2_673;
	hal_machw_rx_duration(s7_117, a4_243, mstatus, dwLoc18, out a0_268, out a4_272, out s2_673);
	ui32 a0_280;
	word32 s2_287;
	word32 a4_674;
	Eq_2 s1_286 = hal_machw_rx_duration(0x18, a4_272, mstatus, dwLoc18, out a0_280, out a4_674, out s2_287);
	word32 a1_297;
	word32 a3_675;
	word32 a5_677;
	word32 a4_676;
	Eq_2 a0_296 = __udivdi3(s3_232, s8_247, s1_286, s1_286 >> 0x1F, out a1_297, out a3_675, out a4_676, out a5_677);
	Eq_2 a5_309 = s3_232 - a0_280;
	word32 a0_313 = (word32) (a0_296 < s1_286);
	uint32 s8_311 = s8_247 - (word32) (s3_232 < a5_309);
	word32 a4_312 = a0_296 + s1_286;
	uint32 a1_314 = (word32) s1_286 + a1_297 + a0_313;
	if (a1_314 < s8_311 || s8_311 == a1_314 && a4_312 < a5_309)
		a5_309 = a4_312;
	Eq_23299 a5_348 = (word32) a5_309 + ((word32) s1_286 + s2_287) - ((s3_232 - s10_237) + (a0_268 - a0_280)) - (s9_218 + s2_287);
	Eq_2 a4_347 = 0xFF000380 - *((union Eq_2 *) 0x44B00120);
	Eq_23313 a3_349 = (word32) a5_348 - 400;
	if (a5_348 + a4_347 < 0x00)
		a3_349 = (word32) s1_286 + ((word32) a5_348 - 400);
	Eq_2 a5_356 = *(union Eq_2 *) 0x44B080A4;
	Eq_2 s0_358 = *((word32) a5_356 + 36);
	Eq_2 a1_360 = (word32) a3_349 + (*((union Eq_2 *) 0x44B00120) - a5_356);
	if (a1_360 != a5_356)
	{
		word32 a4_681;
		word32 a5_682;
		word32 s2_683;
		word32 a1_679;
		word32 s1_678;
		word32 s8_685;
		word32 a2_680;
		word32 s3_684;
		mm_timer_set((word32) s0_358 + 24, a1_360, a4_347, mstatus, out s1_678, out a0_313, out a1_679, out a2_680, out a4_681, out a5_682, out s2_683, out s3_684, out s4_147, out s8_685);
	}
	0x00 = (int8) dwArg010C;
	s1Out = dwLoc4C;
	a0Out = (word32) (a0_313 - s4_147 != 0x00);
	s9Out = s9_218;
	s10Out = s10_237;
	return dwLoc08;
}

// 23008B74: void mm_sta_tbtt(Register Eq_2 ra, Register Eq_2 s0, Register (ptr32 Eq_23380) s1, Register (ptr32 Eq_23381) a0, Register Eq_2 s2, Register ptr32 fflags, Register ptr32 frm, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg48, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg98, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0168, Stack word32 dwArg0198)
void mm_sta_tbtt(Eq_2 ra, Eq_2 s0, struct Eq_23380 * s1, struct Eq_23381 * a0, Eq_2 s2, ptr32 fflags, ptr32 frm, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg48, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg98, Eq_2 dwArgAC, Eq_2 dwArgC8, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0148, Eq_2 dwArg0168, word32 dwArg0198)
{
	if ((word32) a0->t0058 == 0x00)
		return;
	word32 a5_13 = (word32) a0->b0079;
	struct Eq_23381 * s0_14 = a0;
	if (a5_13 != 0x00)
	{
		uint32 a5_16 = a5_13 + ~0x00 & 0x00FF;
		a0->b0079 = (byte) a5_16;
		if (a5_16 <= 0x01)
		{
			vif_mgmt_switch_channel(ra, 0x01, s2, mstatus, dwArg08, dwArg18, dwArg78, dwArg88, dwArgE8, dwArg0148);
			return;
		}
		if (a5_16 == 0x02)
		{
			word32 a3_360;
			word32 s2_361;
			word32 s3_362;
			word32 s4_363;
			word32 s8_364;
			ra = mm_send_csa_traffic_ind(ra, 0x02, mstatus, dwLoc08, out s0_14, out s1, out a3_360, out s2_361, out s3_362, out s4_363, out s8_364);
		}
	}
	Eq_2 a4_67;
	struct Eq_20916 * a5_73;
	Eq_2 s0_94;
	word32 s9_356;
	word32 s10_357;
	word32 s7_355;
	word32 s6_354;
	word32 s5_353;
	word32 s4_352;
	word32 s3_351;
	word32 a4_350;
	word32 a3_349;
	word32 a2_348;
	word32 a1_347;
	word32 s1_346;
	word32 s3_345;
	word32 s2_344;
	word32 s8_343;
	word32 s4_342;
	word32 s3_341;
	word32 a5_339;
	word32 s2_340;
	word32 a1_337;
	word32 a2_338;
	word32 s1_335;
	word32 a0_336;
	Eq_2 ra_93 = chan_tbtt_switch_update(ra, vif_mgmt_bcn_to_prog(mm_timer_set((char *) s0_14 + 24, s1 + s1->dw0004 / 8, (word32) s0_14->t0060 + 432, mstatus, out s1_335, out a0_336, out a1_337, out a2_338, out a4_67, out a5_339, out s2_340, out s3_341, out s4_342, out s8_343), a4_67, mstatus, out a5_73, out s2_344, out s3_345), 432, a5_73, mstatus, dwLoc08, dwArg98, dwArg0108, dwArg0168, out s0_94, out s1_346, out a1_347, out a2_348, out a3_349, out a4_350, out s3_351, out s4_352, out s5_353, out s6_354, out s7_355, out s9_356, out s10_357);
	struct Eq_23486 * a5_112;
	word32 a4_359;
	word32 a3_358;
	if (chan_is_on_channel(s0_94, out a3_358, out a4_359, out a5_112) == 0x00)
		return;
	struct Eq_23543 * s0_115 = a5_112->ptr0004;
	(a5_112 | 1)->ptr0004 = s0_115;
	Eq_23552 a5_121 = (word32) s0_115->b0074 + 0x01 & 0x00FF;
	s0_115->b0074 = (byte) a5_121;
	if (a5_121 <= 100)
	{
		if (a5_121 != 100)
			return;
		word32 s0_377;
		word32 a3_378;
		word32 s3_379;
		chan_bcn_detect_start(ra_93, s0, mstatus, out s0_377, out a3_378, out s3_379);
	}
	else
	{
		struct Eq_23076 * a0_152 = (word32) s0_115->b0060;
		word32 s0_365;
		word32 s1_366;
		word32 a0_367;
		word32 a3_368;
		word32 a4_369;
		word32 a5_370;
		word32 s2_371;
		word32 s3_372;
		word32 s4_373;
		word32 s5_374;
		word32 s6_375;
		word32 s7_376;
		txl_frame_send_null_frame(ra_93, a0_152, &g_t230087EE, fflags, frm, mstatus, dwArg48, dwArg78, dwArgAC, dwArgC8, dwArgE8, dwArg0108, dwArg0198, out s0_365, out s1_366, out a0_367, out a3_368, out a4_369, out a5_370, out s2_371, out s3_372, out s4_373, out s5_374, out s6_375, out s7_376);
	}
}

Eq_2 g_t23008B90 = 
	{
		-93
	};
// 23008C48: Register (ptr32 Eq_23616) mm_get_rsn_wpa_ie(Register (ptr32 Eq_23616) a0, Register Eq_2 a1, Register out ptr32 a4Out)
// Called from:
//      keyMgmtFormatWpaRsnIe
struct Eq_23616 * mm_get_rsn_wpa_ie(struct Eq_23616 * a0, Eq_2 a1, ptr32 & a4Out)
{
	struct Eq_23619 * a5_19 = (word32) a0->b4201EC2A;
	ptr32 a4_26;
	word32 a1_47;
	word32 a2_48;
	word32 a3_49;
	word32 a5_50;
	word32 a6_51;
	word32 a7_52;
	memcpy(a1, (char *) a5_19 + 0x42020941, (word32) a5_19->b42020961, out a1_47, out a2_48, out a3_49, out a4_26, out a5_50, out a6_51, out a7_52);
	struct Eq_23616 * a0_39 = (word32) a5_19->b42020961;
	a4Out = a4_26;
	return a0_39;
}

