pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0000.c
// 23008C96: Register Eq_2 mm_tim_update_proceed(Register Eq_2 a0, Register out (ptr32 Eq_23653) a5Out)
// Called from:
//      mm_tim_update
//      mm_bcn_transmitted
Eq_2 mm_tim_update_proceed(Eq_2 a0, struct Eq_23653 & a5Out)
{
	Eq_2 a4_18;
	uint32 a3_9 = (word32) *a0;
	struct Eq_23653 * a5_11 = (word32) *((word32) a0 + 3);
	word32 t3_12 = (word32) *((word32) a0 + 2);
	if (a3_9 == 0x00)
	{
		a5_11 = (struct Eq_23653 *) ((char *) a5_11 + 0x05D8);
		a4_18 = (char *) a5_11 + 0x42020550;
		if (t3_12 != 0x00)
		{
			a5_11->b42020896 = 0x01;
			a5_11 = (struct Eq_23653 *) 0x01;
		}
		else
			a5_11->b42020896 = 0x00;
	}
	else
	{
		uint32 a6_22 = a3_9 >> 0x03 & 0x00FF;
		word32 a7_24 = a6_22 + (a5_11 + 0x42045264);
		ui32 a1_26 = (word32) *a7_24;
		ui32 a3_28 = 0x01 << (a3_9 & 7);
		a4_18 = (a5_11 << 0x03) + 0x42045360;
		ui32 t1_30 = a3_28 & 0x00FF & a1_26;
		if (t3_12 != 0x00)
		{
			if (t1_30 == 0x00)
			{
				*a7_24 = (byte) (a3_28 & 0x00FF | a1_26);
				uint32 t1_164 = (word32) a5_11->t42020894;
				a5_11->w4202088C = (word16) ((word32) a5_11->w4202088C + 0x01);
				if (a6_22 < t1_164)
				{
					a5_11->t42020894 = (byte) (a6_22 & 0x00FE);
					Mem175[a5_11 + 0x42045264 + (a6_22 & 0x00FE) + 28:word32] = a5_11 + 0x42045AB8;
				}
				if ((word32) a5_11->b42020895 < a6_22)
				{
					a5_11->b42020895 = (byte) a6_22;
					a5_11->ptr42045AD8 = a7_24;
				}
				word32 a2_202 = (word32) (word16) ((word32) a5_11->b42020895 + 0x06 - (word32) a5_11->t42020894);
				a5_11->t4202088A = (word16) a2_202;
				*((word32) a4_18 + 1) = (byte) (a2_202 + ~0x01);
				*((word32) a4_18 + 4) = (byte) (word32) a5_11->t42020894;
				*((word32) a4_18 + 16) = &a5_11->b42020896 + 0x00025222;
				a5_11->ptr42045AD0 = &a5_11->b42020896 + 0x00025222;
				a4_18 = &a5_11->b42020896 + 0x00025222;
				a5_11 = (struct Eq_23653 *) ((char *) a5_11 + 60);
			}
		}
		else if (t1_30 != 0x00)
		{
			*a7_24 = (byte) (~a3_28 & a1_26);
			uint32 a7_42 = (word32) a5_11->w4202088C + ~0x00 << 16;
			a5_11->w4202088C = (word16) (a7_42 >> 0x10);
			if (a7_42 >> 0x10 != 0x00)
			{
				if ((word32) a5_11->t42020894 == (a6_22 & 0x00FE))
				{
					while (true)
					{
						int32 a2_78 = (word32) a5_11->t42020894;
						if (a2_78 == 0x00FB || CONVERT(Mem77[a2_78 + (a5_11 + 0x42045264):byte], byte, word32) != 0x00)
							break;
						a5_11->t42020894 = (byte) (a2_78 + 0x01);
					}
					a5_11->t42020894 = (byte) (a2_78 & 0x00FE);
					Mem102[(a2_78 & 0x00FE) + (a5_11 + 0x42045264) + 28:word32] = a5_11 + 0x42045AB8;
				}
				if ((word32) a5_11->b42020895 == a6_22)
				{
					while (true)
					{
						word32 a2_115 = (word32) a5_11->b42020895;
						word32 a6_117 = a2_115 + (a5_11 + 0x42045264);
						if (a2_115 == 0x00 || (word32) (*a6_117) != 0x00)
							break;
						a5_11->b42020895 = (byte) (a2_115 + ~0x00);
					}
					a5_11->ptr42045AD8 = a6_117;
				}
				word32 a3_143 = (word32) (word16) ((word32) a5_11->b42020895 + 0x06 - (word32) a5_11->t42020894);
				a5_11->t4202088A = (word16) a3_143;
				*((word32) a4_18 + 1) = (byte) (a3_143 + ~0x01);
				a5_11 = (word32) a5_11->t42020894;
				*((word32) a4_18 + 4) = (byte) a5_11;
			}
			else
			{
				a5_11->t4202088A.u1 = 0x06;
				a5_11->t42020894.u1 = 0xFF;
				word32 a2_54 = (word32) a5_11->t4202088A;
				*((word32) a4_18 + 4100) = 0x00;
				*((word32) a4_18 + 0x00001001) = (byte) (a2_54 + ~0x01);
				Mem62[a4_18 + 0x11:word32] = a5_11 + 0x42045AB8;
				Mem69[CONVERT(Mem62[a0 + 3:byte], byte, word32) + 0x42045A80:word32] = a5_11 + 0x42045AB8;
				a4_18 = (word32) a5_11->b42020895;
				Mem72[a5_11 + 0x42045264 + a4_18 + 32:word32] = a5_11 + 0x42045AB8;
				a5_11 += 0x42045AB8;
			}
		}
	}
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	Eq_2 stackArg8 = <invalid>;
	word32 s1_313;
	word32 s0_312;
	word32 a3_315;
	word32 a0_314;
	word32 s4_318;
	word32 s3_317;
	word32 s8_319;
	word32 s2_316;
	ke_msg_send_basic(ra, a0, a1, a4, mstatus, stackArg8, out s0_312, out s1_313, out a0_314, out a3_315, out s2_316, out s3_317, out s4_318, out s8_319);
	word32 a3_321;
	word32 a4_322;
	word32 s2_324;
	word32 s4_325;
	word32 s1_320;
	word32 a5_323;
	ke_msg_free(a0, mstatus, out s1_320, out a3_321, out a4_322, out a5_323, out s2_324, out s4_325);
	a5Out = a5_11;
	return a4_18;
}

// 23008F42: Register Eq_2 mm_bcn_init(Register Eq_2 ra, Register out ptr32 a3Out, Register out ptr32 a4Out)
// Called from:
//      mm_init
Eq_2 mm_bcn_init(Eq_2 ra, ptr32 & a3Out, ptr32 & a4Out)
{
	ptr32 a3_15;
	ptr32 a4_16;
	word32 t1_38;
	word32 a0_39;
	word32 a1_40;
	word32 a2_41;
	word32 a5_42;
	Eq_2 ra_18 = memset(ra, 1107421616, 0x00, 36, out t1_38, out a0_39, out a1_40, out a2_41, out a3_15, out a4_16, out a5_42);
	g_dw42044120 = 1107421616;
	g_dw23009342 = 1107421616;
	co_list_init(&g_t4201E9CC);
	a3Out = a3_15;
	a4Out = a4_16;
	return ra_18;
}

// 23008F84: Register Eq_2 mm_bcn_init_vif(Register Eq_2 ra, Register Eq_2 a0, Stack Eq_2 dwArg38, Register out ptr32 a3Out)
// Called from:
//      vif_mgmt_register
Eq_2 mm_bcn_init_vif(Eq_2 ra, Eq_2 a0, Eq_2 dwArg38, ptr32 & a3Out)
{
	word32 a1_13 = (word32) *((word32) a0 + 87);
	struct Eq_24085 * s0_40;
	word32 * s2_42;
	Eq_2 ra_39 = txl_frame_init_desc(ra, (word32) a0 + 96, a1_13 + 1107580600, a1_13 + 0x42045C98, out s0_40, out s2_42);
	*s2_42 = (word32) s0_40->b0057 + 0x42045A18;
	struct Eq_24114 * s1_58 = (word32) s0_40->b0057;
	s0_40->b0343 = 0x00;
	s0_40->w033C = 0x00;
	s0_40->b0346 = 0x00;
	s0_40->w033A = 0x06;
	s0_40->w0344 = 0xFF;
	struct Eq_24139 * a4_63 = (s1_58 << 0x03) + 0x42045360;
	a4_63->dw0011 = &s1_58->dw42045AB8;
	s1_58->dw42045AB8 = ~0x35010521;
	a4_63->ptr0008 = &s1_58->dw42045AB8;
	s1_58->dw42045AC8 = 0x00;
	s1_58->ptr42045A80 = &s1_58->dw42045AB8;
	a4_63->b0000 = 0x05;
	a4_63->b0001 = 0x04;
	word32 a3_95 = (word32) s0_40->b0343;
	a4_63->b0004 = 0x00;
	a4_63->b0002 = (byte) a3_95;
	a4_63->b0003 = 0x01;
	a4_63->b0005 = ~0x00;
	s1_58->dw42045ACC = ~0x35010521;
	int32 a4_103 = (word32) s0_40->b0345;
	s1_58->ptr42045A94 = &s1_58->dw42045AB8;
	((char *) s1_58 + 0x42045264 + a4_103)[32] = (char) &s1_58->dw42045AB8;
	ptr32 a3_110;
	word32 t1_139;
	word32 a0_140;
	word32 a1_141;
	word32 a2_142;
	word32 a4_143;
	word32 a5_144;
	Eq_2 ra_113 = memset(ra_39, (char *) s1_58 + 0x42045264, 0x00, 252, out t1_139, out a0_140, out a1_141, out a2_142, out a3_110, out a4_143, out a5_144);
	s1_58->dw42045A7C = ~0x35010521;
	s1_58->ptr42045A80 = null;
	s1_58->dw42045A8C = 0x00;
	struct Eq_24245 * a5_119 = s0_40->ptr00CC;
	a5_119->dw0024 = 0x00;
	a5_119->dw003C = 0x00;
	a5_119->dw0010 = 0x00;
	s0_40->dw032C = 0x230094F6;
	s0_40->ptr0330 = s0_40;
	0x00 = (int8) dwArg38;
	a3Out = a3_110;
	return ra_113;
}

// 230090D8: void mm_tim_update(Register Eq_2 a0)
// Called from:
//      mm_tim_update_req_handler
void mm_tim_update(Eq_2 a0)
{
	Eq_2 a5_5 = g_t4201E9B4;
	if (a5_5 == 0x00)
	{
		word32 a5_44;
		mm_tim_update_proceed(a0, out a5_44);
	}
	else
		co_list_push_back((word32) a0 - 0x0C, a5_5);
}

// 230090F6: Register (ptr32 Eq_24287) mm_bcn_transmit(Register Eq_2 ra, Register Eq_2 s5, Register ptr32 fflags, Register ptr32 frm, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg48, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArgBC, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0128, Register out Eq_2 s8Out)
// Called from:
//      mm_tbtt_evt
//      mm_bcn_change
struct Eq_24287 * mm_bcn_transmit(Eq_2 ra, Eq_2 s5, ptr32 fflags, ptr32 frm, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg48, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArgBC, Eq_2 dwArgF8, Eq_2 dwArg0128, union Eq_2 & s8Out)
{
	Eq_2 s0_172 = g_t42020B30;
	struct Eq_24287 * s2_174 = &g_t4201E9B0;
	if (g_t4201E9B4 == 0x00)
	{
		if ((word32) g_b4201E9B9 != 0x00)
			g_b4201E9B8 = 0x01;
		else
		{
			g_b4201E9B8 = 0x00;
			Eq_2 s5_295 = 0x42045360;
			struct Eq_24309 * s3_175 = g_a4201FF10;
			struct Eq_24311 * s4_176 = &g_t4201E950;
			while (s0_172 != 0x00)
			{
				if ((word32) *((word32) s0_172 + 86) == 0x02 && ((word32) (*((word32) s0_172 + 834)) != 0x00 && (word32) (*((word32) s0_172 + 833)) == (word32) (*((word32) s0_172 + 832))))
				{
					ui32 a4_100;
					struct Eq_24342 * a5_59 = (word32) s5_295 + ((word32) (*((word32) s0_172 + 87)) << 3);
					struct Eq_24350 * a1_52 = (word32) *((word32) s0_172 + 0x033A);
					ui32 a2_61 = (word32) a5_59->b0004;
					(&(a1_52 + (word32) (*((word32) s0_172 + 0x0338)) / 24)->w0016)[5] = (word16) *((word32) s0_172 + 0x00CC);
					uint32 a4_68 = (word32) s3_175->t0054 + 0x01 << 16;
					s3_175->t0054 = (word16) (a4_68 >> 16);
					a1_52->w0016 = (word16) (a4_68 >> 16 << 4);
					word32 a4_73 = (word32) *((word32) s0_172 + 0x0343);
					a5_59->b0002 = (byte) a4_73;
					if (a4_73 == 0x00)
					{
						if ((word32) *((word32) s0_172 + 838) == 0x00)
						{
							a4_100 = a2_61 & 0x00FE;
							if (s4_176->t001C != 0x00)
								goto l23009212;
						}
						else
						{
l23009212:
							a4_100 = a2_61 | 1;
						}
						*((word32) s0_172 + 0x0343) = (byte) (word32) a5_59->b0003;
					}
					else
					{
						a4_100 = a2_61 & 0x00FE;
						if (((word32) *((word32) s0_172 + 838) & 0x02) != 0x00)
							a4_100 = a2_61 | 1;
					}
					Eq_2 a4_102 = a4_100 | 1;
					a5_59->b0004 = (byte) a4_102;
					*((word32) s0_172 + 0x0343) = (byte) ((word32) *((word32) s0_172 + 0x0343) + ~0x00);
					word32 a5_109 = (word32) *((word32) s0_172 + 839);
					if (a5_109 != 0x00)
					{
						int32 a2_111 = (word32) *((word32) s0_172 + 840);
						int32 a5_112 = a5_109 + ~0x00 & 0x00FF;
						*((word32) s0_172 + 839) = (byte) a5_112;
						if (a2_111 != 0x00)
						{
							*((word32) a4_102 + a2_111) = (byte) a5_112;
							a4_102 = (word32) *((word32) s0_172 + 841);
							if (a4_102 != 0x00)
								*((word32) a4_102 + a5_112) = (byte) (word32) *((word32) s0_172 + 839);
						}
						word32 s7_124 = (word32) *((word32) s0_172 + 839);
						if (s7_124 == 0x00)
						{
l23009268:
							*((word32) s0_172 + 839) = 0x01;
							goto l2300926E;
						}
						word32 a2_705;
						word32 a1_704;
						Eq_2 a0_146;
						word32 s8_159;
						word32 s0_702;
						word32 s4_712;
						word32 a5_708;
						word32 a6_709;
						word32 s1_703;
						word32 a3_706;
						word32 a4_707;
						word32 s2_710;
						word32 s3_711;
						ra = ke_msg_alloc(ra, 78, 0x0D, 0x02, a4_102, mstatus, dwLoc18, out s0_702, out s1_703, out a0_146, out a1_704, out a2_705, out a3_706, out a4_707, out a5_708, out a6_709, out s2_710, out s3_711, out s4_712, out s8_159);
						*a0_146 = (byte) s8_159;
						*((word32) a0_146 + 1) = (byte) s7_124;
						word32 a3_717;
						word32 a0_714;
						word32 s1_713;
						word32 a5_719;
						word32 a1_715;
						word32 a2_716;
						word32 s8_720;
						word32 a4_718;
						s0_172 = ke_msg_send(a0_146, mstatus, out s1_713, out a0_714, out a1_715, out a2_716, out a3_717, out a4_718, out a5_719, out s2_174, out s3_175, out s4_176, out s8_720);
						if ((word32) *((word32) s0_172 + 839) == 0x00)
							goto l23009268;
					}
l2300926E:
					word32 a4_701;
					tpc_update_frame_tx_power(ra, s0_172, fflags, frm, out a4_701);
					Eq_2 a4_222;
					if (chan_is_on_operational_channel(out a4_222) != 0x00)
					{
						word32 s7_227 = (word32) *((word32) s0_172 + 87);
						Eq_2 a0_237;
						word32 s1_722;
						word32 a1_723;
						word32 a3_725;
						word32 a2_724;
						word32 s0_721;
						word32 s4_731;
						word32 s8_732;
						word32 s2_729;
						word32 a4_726;
						word32 a5_727;
						word32 a6_728;
						word32 s3_730;
						Eq_2 ra_244 = ke_msg_alloc(ra, 74, 0x0D, 0x03, a4_222, mstatus, dwLoc18, out s0_721, out s1_722, out a0_237, out a1_723, out a2_724, out a3_725, out a4_726, out a5_727, out a6_728, out s2_729, out s3_730, out s4_731, out s8_732);
						*a0_237 = (byte) (s7_227 + 0x0A & 0x00FF);
						*((word32) a0_237 + 1) = 0x00;
						*((word32) a0_237 + 2) = 0x00;
						struct Eq_24474 * a3_261;
						word32 s2_739;
						word32 a2_736;
						word32 s1_733;
						word32 a0_734;
						word32 a1_735;
						word32 s4_741;
						word32 s8_742;
						word32 a5_738;
						word32 a4_737;
						word32 s3_740;
						Eq_2 s0_265 = ke_msg_send(a0_237, mstatus, out s1_733, out a0_734, out a1_735, out a2_736, out a3_261, out a4_737, out a5_738, out s2_739, out s3_740, out s4_741, out s8_742);
						*((word32) s0_265 + 0x008F) = (byte) (word32) *((word32) s0_265 + 87);
						((word32) s0_265 + 144)->u0 = ~0x00;
						word32 s7_748;
						word32 s11_751;
						word32 s9_749;
						word32 s10_750;
						word32 a5_747;
						word32 a4_746;
						word32 a0_280;
						word32 s6_296;
						word32 s1_743;
						word32 a1_744;
						word32 a3_745;
						ra = txl_frame_push(ra_244, s0_265, 0x04, a3_261, (struct Eq_24700 *) ~0x00, mstatus, dwArg08, s5, dwArg88, dwArgBC, out s0_172, out s1_743, out a0_280, out a1_744, out a3_745, out a4_746, out a5_747, out s2_174, out s3_175, out s4_176, out s5_295, out s6_296, out s7_748, out s9_749, out s10_750, out s11_751);
						if (a0_280 != 0x00)
							++s2_174->dw0004;
						Eq_2 s1_314 = (word32) *((word32) s0_172 + 87) + 442 + s6_296;
						if (((word32) *((word32) s1_314 + 50) & 0x02) != 0x00)
						{
							*(union Eq_2 *) 0x3D = s1_314;
							word32 a0_752;
							word32 a3_755;
							word32 a2_754;
							word32 a1_753;
							word32 s11_761;
							word32 s7_758;
							word32 s9_759;
							word32 a6_756;
							word32 s6_757;
							word32 s10_760;
							struct Eq_24779 * s1_329;
							ra = sta_mgmt_send_postponed_frame(ra, s0_172, s1_314, s5_295, mstatus, dwArg48, s5, dwArg8C, dwArgF8, out s0_172, out s1_329, out a0_752, out a1_753, out a2_754, out a3_755, out a6_756, out s2_174, out s3_175, out s4_176, out s5_295, out s6_757, out s7_758, out s9_759, out s10_760, out s11_761);
							s1_329->dw0034 = 0x00;
						}
					}
				}
				s0_172 = *s0_172;
			}
		}
		0x00 = (int8) dwArg0128;
		s8Out = s5;
		return s2_174;
	}
	else
		assert_err();
}

