pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0000.c
// 2300932E: Register Eq_2 mm_bcn_updated(Register Eq_2 ra, Register Eq_2 a4, Register (ptr32 Eq_24830) a5, Register Eq_2 s3, Register Eq_2 s5, Register Eq_2 s6, Register ptr32 fflags, Register ptr32 frm, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArg8C, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgF8, Stack word32 dwArg0128, Register out ptr32 s1Out, Register out ptr32 a4Out, Register out ptr32 a5Out)
// Called from:
//      mm_bcn_update
Eq_2 mm_bcn_updated(Eq_2 ra, Eq_2 a4, struct Eq_24830 * a5, Eq_2 s3, Eq_2 s5, Eq_2 s6, ptr32 fflags, ptr32 frm, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArg8C, Eq_2 dwArgC8, Eq_2 dwArgF8, word32 dwArg0128, ptr32 & s1Out, ptr32 & a4Out, ptr32 & a5Out)
{
	struct Eq_24845 * a5_106;
	struct Eq_24846 * s0_45;
	struct Eq_24870 ** s1_46;
	struct Eq_24848 * s8_50;
	word32 a0_316;
	word32 a3_317;
	word32 s3_318;
	word32 s4_319;
	Eq_2 s2_160;
	Eq_2 ra_175 = ke_msg_send_basic(ra, 64, (word32) a5->wFFFFFFFC, a4, mstatus, s6, out s0_45, out s1_46, out a0_316, out a3_317, out s2_160, out s3_318, out s4_319, out s8_50);
	struct Eq_24870 * s3_56 = *s1_46;
	struct Eq_24874 * a5_62 = (word32) s3_56->w0004;
	struct Eq_24879 * s7_55 = (word32) s0_45->b0057;
	word32 s6_64 = (word32) s3_56->w0006;
	word32 s9_65 = a5_62 - (word32) s3_56->b0008;
	int32 s5_66 = s0_45->ptr00CC->dw0014;
	s0_45->w0338 = (word16) s9_65;
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	Eq_2 stackArg104 = <invalid>;
	Eq_2 stackArg408 = <invalid>;
	word32 s7_330;
	word32 a3_324;
	word32 a4_325;
	word32 s3_326;
	word32 s4_327;
	word32 s5_328;
	word32 s6_329;
	me_beacon_check(ra, a0, a1, a2, s2, s8, fflags, frm, mstatus, stackArg104, stackArg408, out a3_324, out a4_325, out s3_326, out s4_327, out s5_328, out s6_329, out s7_330);
	struct Eq_24948 * s1_73 = a5_62->ptr0014;
	struct Eq_24952 * a5_76 = a5_62 + ((word32) s3_56->w0006 + ~0x00) / 24;
	a5_76->ptr0018 = s1_73;
	struct Eq_24963 * a4_82 = a5_76 + ((word32) s3_56->b0008 + 0x01) / 28;
	a4_82->dw0008 = (char *) s7_55 + 1107581564;
	word32 a5_87 = (word32) s3_56->w0006;
	s7_55->dw42045A8C = 0x00;
	struct Eq_24985 * a5_91 = a4_82 + (~a5_87 + s9_65) / 0x0C;
	a5_91->ptr000C = (char *) s7_55 + 1107581564;
	struct Eq_24993 * s4_61 = (s7_55 << 0x03) + 0x42045360;
	word32 * s8_165 = &s8_50->ptrFFFFF9B0;
	struct Eq_25001 * s0_93 = a5_91->ptr0040;
	if ((word32) a5_91->b0004 != 0x00)
		a5_106 = (struct Eq_24845 *) &g_dw42045A2C;
	else
		a5_106 = (struct Eq_24845 *) &g_dw420450B4;
	(*(int32 *) 0x44B000A0 & 0x00FF)->ptr0024 = a5_106;
	a5_106->ptr0028 = s1_73;
	s1_73->dw0024 = 0x00;
	s1_73->dw003C = 0x00;
	*((char *) g_a42045AC8 + (word32) s0_93->b0057) = (struct Eq_24948 **) s1_73;
	s0_93->b0342 = 0x01;
	Eq_2 s5_104 = s5_66 + (s6_64 + 0x03);
	s4_61->b0003 = (byte) (word32) *s5_104;
	struct Eq_25053 * a5_126 = s8_50->ptrFFFFF9B0;
	s0_93->b0347 = 0x00;
	s0_93->b0348 = (byte) (word32) a5_126->b000A;
	s0_93->b0349 = (byte) (word32) a5_126->b000B;
	int32 a4_133 = (word32) a5_126->b000A;
	if (a4_133 != 0x00)
		s0_93->b0347 = (byte) ((word32) a5_126[a4_133 / 0x0C] + 0x01);
	word32 a5_141 = (word32) s8_50->bFFFFF9B8;
	s8_50->bFFFFF9B9 = 0x00;
	if (a5_141 != 0x00)
		s2_160 = mm_bcn_transmit(ra_175, s5_104, fflags, frm, mstatus, s6, dwArg18, s5, s3, dwArg8C, dwArgC8, dwArgF8, out s8_165);
	*s8_165 = 0x00;
	0x00 = dwArg0128;
	ptr32 a4_203;
	ptr32 a5_204;
	ptr32 s1_207;
	word32 s2_332;
	word32 s4_333;
	word32 a3_331;
	ke_msg_free(s2_160, mstatus, out s1_207, out a3_331, out a4_203, out a5_204, out s2_332, out s4_333);
	s1Out = s1_207;
	a4Out = a4_203;
	a5Out = a5_204;
	return ra_175;
}

word32 g_dw23009342 = 3361393238;
// 2300949A: Register Eq_2 mm_bcn_update(Register Eq_2 ra, Register (ptr32 Eq_25127) a0, Register Eq_2 s3, Register Eq_2 s5, Register Eq_2 s6, Register ptr32 fflags, Register ptr32 frm, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArg8C, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgF8, Stack word32 dwArg0128, Register out ptr32 s1Out, Register out ptr32 a4Out, Register out ptr32 a5Out)
// Called from:
//      mm_bcn_transmitted
//      mm_bcn_change
Eq_2 mm_bcn_update(Eq_2 ra, struct Eq_25127 * a0, Eq_2 s3, Eq_2 s5, Eq_2 s6, ptr32 fflags, ptr32 frm, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArg8C, Eq_2 dwArgC8, Eq_2 dwArgF8, word32 dwArg0128, ptr32 & s1Out, ptr32 & a4Out, ptr32 & a5Out)
{
	word32 a1_84;
	word32 a2_85;
	word32 a3_86;
	word32 a4_87;
	word32 a5_88;
	word32 a6_89;
	word32 a7_90;
	memcpy((word32) a0->b0009 + 0x42045804, &a0->b0009 + 3, (word32) a0->w0004, out a1_84, out a2_85, out a3_86, out a4_87, out a5_88, out a6_89, out a7_90);
	g_b4201E9BA = 0x00;
	g_b4201E9B9 = 0x01;
	ptr32 a4_55;
	ptr32 a5_56;
	ptr32 s1_60;
	Eq_2 ra_58 = mm_bcn_updated(ra, 0x01, &g_t4201E9B0, s3, s5, s6, fflags, frm, mstatus, dwArg18, dwArg8C, dwArgC8, dwArgF8, dwArg0128, out s1_60, out a4_55, out a5_56);
	s1Out = s1_60;
	a4Out = a4_55;
	a5Out = a5_56;
	return ra_58;
}

// 230094F6: void mm_bcn_transmitted(Register Eq_2 ra, Register (ptr32 Eq_25127) a0, Register Eq_2 a4, Register Eq_2 s3, Register Eq_2 s5, Register Eq_2 s6, Register ptr32 fflags, Register ptr32 frm, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack word32 dwArg38, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg88, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgE8, Stack word32 dwArg0118, Stack Eq_2 dwArg0148)
void mm_bcn_transmitted(Eq_2 ra, struct Eq_25127 * a0, Eq_2 a4, Eq_2 s3, Eq_2 s5, Eq_2 s6, ptr32 fflags, ptr32 frm, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg18, word32 dwArg38, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg88, Eq_2 dwArgB8, Eq_2 dwArgE8, word32 dwArg0118, Eq_2 dwArg0148)
{
	Eq_2 a5_14 = g_t4201E9B4;
	struct Eq_25127 * s1_16 = a0;
	if (a5_14 != 0x00)
	{
		Eq_21410 s0_23 = *((word32) a5_14 + 4);
		*((word32) a5_14 + 3) = s0_23;
		if (a5_14 == ~0x00)
		{
			Eq_2 a5_125 = (word32) *((word32) s0_23 + 0x0A);
			if (a5_125 != 0x00)
				ra = mm_bcn_update(ra, a0, s3, s5, s6, fflags, frm, mstatus, dwArg08, dwArg7C, dwArgB8, dwArgE8, dwArg0118, out s1_16, out a4, out a5_125);
			while (a5_125 != 0x00)
			{
				word32 a5_279;
				a4 = mm_tim_update_proceed((word32) co_list_pop_front(a4, a5_125, out a5_279) + 0x0C, out a5_125);
			}
			Eq_2 a4_82 = (word32) s1_16->b0347;
			if (a4_82 == 0x01)
			{
				0x00 = dwArg38;
				vif_mgmt_switch_channel(ra, a4_82, 0x4201F000, mstatus, dwArg08, dwArg18, dwArg78, dwArg88, dwArgE8, dwArg0148);
				return;
			}
		}
		0x00 = dwArg38;
	}
	else
		assert_err();
}

// 2300957C: void mm_bcn_change(Register Eq_2 ra, Register (ptr32 Eq_25127) a0, Register (ptr32 Eq_25266) a4, Register Eq_2 s3, Register Eq_2 s5, Register Eq_2 s6, Register ptr32 fflags, Register ptr32 frm, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArg8C, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgF8, Stack word32 dwArg0128)
// Called from:
//      mm_bcn_change_req_handler
void mm_bcn_change(Eq_2 ra, struct Eq_25127 * a0, struct Eq_25266 * a4, Eq_2 s3, Eq_2 s5, Eq_2 s6, ptr32 fflags, ptr32 frm, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArg8C, Eq_2 dwArgC8, Eq_2 dwArgF8, word32 dwArg0128)
{
	struct Eq_25278 * a5_6 = a4->ptr0004;
	a0->ptr0000 = a5_6;
	if (a4 == null)
	{
		word32 s1_95;
		word32 a4_96;
		word32 a5_97;
		mm_bcn_update(ra, a0, s3, s5, s6, fflags, frm, mstatus, dwArg18, dwArg8C, dwArgC8, dwArgF8, dwArg0128, out s1_95, out a4_96, out a5_97);
	}
	else
		a5_6->b000A = 0x01;
}

// 23009596: Register Eq_2 mm_timer_hw_set(Register Eq_2 a0, Register Eq_2 a4, Register ptr32 mstatus)
// Called from:
//      mm_timer_schedule
//      chan_upd_ctxt_status
Eq_2 mm_timer_hw_set(Eq_2 a0, Eq_2 a4, ptr32 mstatus)
{
	Eq_2 a5_14;
	__csrrc(mstatus, 0x08);
	if (a0 != 0x00)
	{
		*(union Eq_2 *) 0x44B00144 = a4;
		a5_14 = *(union Eq_2 *) 0x44B0808C;
		if ((a5_14 & 0x0080) != 0x00)
			goto l230095C4;
		((union Eq_19267 *) 0x44B08088)->u0 = 0x0080;
		a5_14 |= 0x0080;
	}
	else
		a5_14 = *(union Eq_2 *) 0x44B0808C & -0x0081;
	*(union Eq_2 *) 0x44B0808C = a5_14;
l230095C4:
	__csrrs(mstatus, 0x08);
	return a5_14;
}

// 230095D8: void cmp_abs_time()
void cmp_abs_time()
{
}

// 230095E2: void mm_timer_init()
// Called from:
//      mm_init
void mm_timer_init()
{
	co_list_init(&g_t4201E9D4);
}

// 230095EE: Register Eq_2 mm_timer_set(Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a4, Register ptr32 mstatus, Register out Eq_2 s1Out, Register out Eq_2 a0Out, Register out Eq_2 a1Out, Register out Eq_2 a2Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out Eq_2 s4Out, Register out Eq_2 s8Out)
// Called from:
//      mm_check_beacon
//      mm_sta_tbtt
//      ps_uapsd_timer_handle
//      ps_enable_cfm
//      ps_uapsd_set
//      td_timer_end
//      td_start
//      vif_mgmt_bcn_to_prog
//      vif_mgmt_switch_channel
//      keyMgmtSta_StartSession_internal
//      chan_upd_ctxt_status
//      chan_tbtt_schedule
//      chan_cde_evt
//      chan_scan_req
//      mm_hw_config_handler
Eq_2 mm_timer_set(Eq_2 a0, Eq_2 a1, Eq_2 a4, ptr32 mstatus, union Eq_2 & s1Out, union Eq_2 & a0Out, union Eq_2 & a1Out, union Eq_2 & a2Out, union Eq_2 & a4Out, union Eq_2 & a5Out, union Eq_2 & s2Out, union Eq_2 & s3Out, union Eq_2 & s4Out, union Eq_2 & s8Out)
{
	Eq_2 a4_28;
	Eq_2 s0_19 = a1;
	a4_28 = a4;
	if (a1 - *((union Eq_2 *) 0x44B00120) < 0x00)
	{
		word32 s8_170;
		word32 a2_167;
		word32 a1_166;
		word32 a0_165;
		word32 a5_168;
		word32 s4_169;
		s0_19 = (word32) *((word32) puts(587906076, out a0_165, out a1_166, out a2_167, out a4_28, out a5_168, out s4_169, out s8_170) + 288) + 0x00FFFBB8;
	}
	word32 s3_43;
	Eq_2 a5_39 = g_t4201E9D4;
	if (a0 == a5_39)
	{
		word32 a5_171;
		co_list_pop_front(a4_28, a5_39, out a5_171);
		s3_43 = 0x01;
	}
	else
	{
		word32 a5_178;
		co_list_extract(a0, a1, a4, a5, out a5_178);
		s3_43 = 0x00;
	}
	*((word32) a0 + 0x0C) = s0_19;
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	Eq_2 stackArg296 = <invalid>;
	word32 s1_174;
	word32 s2_175;
	word32 s3_176;
	co_list_insert(ra, s0, a1, a2, stackArg296, out s1_174, out s2_175, out s3_176);
	Eq_2 a0_128 = 0x4201E9D4;
	if (s3_43 != 0x00 || a0 == g_t4201E9D4)
	{
		a0_128 = g_t4201E9D4;
		mm_timer_hw_set(a0, a4, mstatus);
	}
	Eq_2 a5_66 = *(union Eq_2 *) 0x44B00120;
	if (s0_19 - a5_66 >= 0x00)
	{
		s1Out.u0 = <invalid>;
		a0Out = a0_128;
		a1Out.u0 = <invalid>;
		a2Out.u0 = <invalid>;
		a4Out = a4_28;
		a5Out = a5_66;
		s2Out.u0 = <invalid>;
		s3Out.u0 = <invalid>;
		s4Out.u0 = <invalid>;
		s8Out.u0 = <invalid>;
		return <invalid>;
	}
	else
	{
		Eq_2 a5_96;
		Eq_2 a4_95 = ke_evt_set(0x08000000, a4_28, mstatus, out a5_96);
		s1Out.u0 = <invalid>;
		a0Out.u0 = 0x08000000;
		a1Out.u0 = <invalid>;
		a2Out.u0 = <invalid>;
		a4Out = a4_95;
		a5Out = a5_96;
		s2Out.u0 = <invalid>;
		s3Out.u0 = <invalid>;
		s4Out.u0 = <invalid>;
		s8Out.u0 = <invalid>;
		return <invalid>;
	}
}

// 230096A4: Register Eq_2 mm_timer_clear(Register Eq_2 a0, Register Eq_2 a4, Register out Eq_2 a2Out, Register out Eq_2 a5Out)
// Called from:
//      ps_disable_cfm
//      td_reset
//      vif_mgmt_unregister
//      vif_mgmt_bcn_recv
//      vif_mgmt_switch_channel
//      supplicantDisable
//      ProcessRxEAPOL_PwkMsg3
//      ProcessRxEAPOL_GrpMsg1
//      chan_tbtt_insert
//      chan_upd_ctxt_status
//      chan_tx_cfm
//      chan_roc_req
//      mm_hw_config_handler
Eq_2 mm_timer_clear(Eq_2 a0, Eq_2 a4, union Eq_2 & a2Out, union Eq_2 & a5Out)
{
	Eq_2 a5_7 = g_t4201E9D4;
	if (a0 != a5_7)
	{
		word32 a5_38;
		co_list_extract(a0, a1, a4, a5, out a5_38);
		a2Out.u0 = <invalid>;
		a5Out = a5_7;
		return a0;
	}
	else
	{
		Eq_2 a5_19;
		co_list_pop_front(a4, a5_7, out a5_19);
		mm_timer_hw_set(a0, a4, mstatus);
		a2Out.u0 = <invalid>;
		a5Out = a5_19;
		return a1;
	}
}

