pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0000.c
// 230096DC: void mm_timer_schedule(Register Eq_2 a4, Register ptr32 mstatus)
void mm_timer_schedule(Eq_2 a4, ptr32 mstatus)
{
	while (true)
	{
		Eq_2 a5_27 = ke_evt_clear(0x08000000, a4, mstatus);
		if (g_t4201E9D4 == 0x00)
			break;
		a4 = *(union Eq_2 *) 0x44B00120;
		int32 a5_34 = a5_27 - a4;
		Eq_2 s0_33 = *((word32) a5_27 + 0x0C);
		Eq_2 a5_35 = a5_34 + -50;
		if (a5_34 >= ~0x31)
		{
			word32 a5_38 = mm_timer_hw_set(s0_33, a4, mstatus);
			a4 = *(union Eq_2 *) 0x44B00120;
			a5_35 = a5_38 - a4;
			if (a5_35 >= 0x00)
				return;
		}
		<anonymous> * a5_59;
		co_list_pop_front(a4, a5_35, out a5_59);
		if (a5_59 == null)
			assert_err();
		a5_59();
	}
	mm_timer_hw_set(0x00, a4, mstatus);
}

// 2300977A: void ps_uapsd_timer_handle(Register Eq_2 s9, Register Eq_2 s10, Register ptr32 fflags, Register ptr32 frm, Register ptr32 mstatus, Stack Eq_2 dwArg58, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg0178)
void ps_uapsd_timer_handle(Eq_2 s9, Eq_2 s10, ptr32 fflags, ptr32 frm, ptr32 mstatus, Eq_2 dwArg58, Eq_2 dwArg8C, Eq_2 dwArg0178)
{
	Eq_2 s0_20 = g_t42020B30;
	Eq_2 s2_17 = 0x00;
	struct Eq_25509 * s3_119 = (struct Eq_25509 *) 0x44B00000;
	while (s0_20 != 0x00)
	{
		if ((word32) *((word32) s0_20 + 86) == 0x00 && ((word32) (*((word32) s0_20 + 88)) != 0x00 && (word32) (*((word32) s0_20 + 0x0068)) != 0x00))
		{
			uint32 a5_27;
			word32 a4_249;
			word32 a3_248;
			Eq_2 a0_26 = chan_is_on_channel(s0_20, out a3_248, out a4_249, out a5_27);
			if (a0_26 != 0x00)
			{
				struct Eq_25578 * a4_32 = s3_119->ptr0120;
				s2_17 = a0_26;
				s0_20 = a4_32->t0064;
				struct Eq_25585 * a5_37 = a4_32 + ((a5_27 >> 1) - a4_32) / 0x0068;
				if (a5_37 < null)
				{
					(a5_37 | 8)->dw0004 = a5_37->dw0004;
					word32 a1_252;
					word32 a0_251;
					word32 s1_250;
					word32 a2_253;
					word32 a3_254;
					word32 a5_255;
					word32 s4_256;
					word32 s5_257;
					word32 s6_258;
					word32 s7_259;
					word32 s11_260;
					txl_frame_send_qosnull_frame(s9, s10, fflags, frm, mstatus, dwArg58, dwArg8C, dwArg0178, out s0_20, out s1_250, out a0_251, out a1_252, out a2_253, out a3_254, out a5_255, out s2_17, out s3_119, out s4_256, out s5_257, out s6_258, out s7_259, out s9, out s10, out s11_260);
					s3_119->ptr0120->t0064 = s0_20;
				}
			}
		}
		s0_20 = *s0_20;
	}
	if (s2_17 == 0x00)
		g_b4201E9F8 = 0x00;
	else
	{
		word32 a1_103 = Mem21[0x44B00120:int32] + Mem21[1107421692:word32];
		word32 s8_247;
		word32 s4_246;
		word32 s3_245;
		word32 s2_244;
		word32 a5_243;
		word32 a4_242;
		word32 a2_241;
		word32 a1_240;
		word32 a0_239;
		word32 s1_238;
		mm_timer_set(1107421672, a1_103, 0x44B00000, mstatus, out s1_238, out a0_239, out a1_240, out a2_241, out a4_242, out a5_243, out s2_244, out s3_245, out s4_246, out s8_247);
	}
}

word32 g_dw2300978A = 3360309761;
// 2300982E: void blmac_pwr_mgt_setf(Register ui32 a0, Register (ptr32 Eq_25663) a5)
// Called from:
//      ps_set_mode
//      ps_traffic_status_update
void blmac_pwr_mgt_setf(ui32 a0, struct Eq_25663 * a5)
{
	(a0 << 2 | a5 & ~0x04)->dw004C = a5->dw004C;
}

// 2300983E: Register Eq_2 ps_dpsm_update(Register Eq_2 ra, Register Eq_2 s0, Register word32 a0, Register ptr32 fflags, Register ptr32 frm, Register ptr32 mstatus, Stack word32 dwArg10, Stack word32 dwArg14, Stack Eq_2 dwArg38, Stack Eq_2 dwArg68, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgF8, Stack word32 dwArg0188, Register out Eq_2 s1Out, Register out (ptr32 Eq_23077) s2Out, Register out ptr32 mstatusOut)
// Called from:
//      ps_traffic_status_update
Eq_2 ps_dpsm_update(Eq_2 ra, Eq_2 s0, word32 a0, ptr32 fflags, ptr32 frm, ptr32 mstatus, word32 dwArg10, word32 dwArg14, Eq_2 dwArg38, Eq_2 dwArg68, Eq_2 dwArg9C, Eq_2 dwArgB8, Eq_2 dwArgD8, Eq_2 dwArgF8, word32 dwArg0188, union Eq_2 & s1Out, struct Eq_23077 & s2Out, ptr32 & mstatusOut)
{
	struct Eq_23077 * s2_140;
	struct Eq_25663 * a5_19;
	ui32 a4_14 = (word32) g_b4201EA00;
	struct Eq_25699 * s0_139 = &g_b4201E9DC;
	ui32 a5_16 = g_dw4201E9E0;
	if (a0 != 0x00)
	{
		g_b4201EA00 = (byte) (a4_14 | 2);
		(a5_16 | 8)->dw0004 = 1107421660;
		a5_19 = a5_16 | 8;
		s2_140 = &g_t23009BCC;
	}
	else
	{
		g_b4201EA00 = (byte) (a4_14 | 4);
		(a5_16 & ~0x08)->dw0004 = 1107421660;
		a5_19 = a5_16 & ~0x08;
		s2_140 = &g_t23009ACA;
	}
	blmac_pwr_mgt_setf(a0 ^ 1, a5_19);
	Eq_2 s1_38 = g_t42020B30;
	g_b4201E9E4 = 0x00;
	while (s1_38 != 0x00)
	{
		if ((word32) *((word32) s1_38 + 86) == 0x00 && (word32) (*((word32) s1_38 + 88)) != 0x00)
		{
			word32 a5_316;
			word32 a4_315;
			word32 a3_314;
			if (chan_is_on_channel(s1_38, out a3_314, out a4_315, out a5_316) != 0x00)
			{
				word32 a5_51 = (word32) s0_139->b0008;
				struct Eq_23076 * a0_52 = (word32) *((word32) s1_38 + 96);
				*((word32) s1_38 + 95) = 0x00;
				s0_139->b0008 = (byte) (a5_51 + 0x01);
				word32 s7_325;
				word32 s6_324;
				word32 s5_323;
				word32 s4_322;
				word32 s3_321;
				word32 a5_320;
				word32 a4_319;
				word32 a3_318;
				word32 a0_317;
				ra = txl_frame_send_null_frame(ra, a0_52, s2_140, fflags, frm, mstatus, dwArg38, dwArg68, dwArg9C, dwArgB8, dwArgD8, dwArgF8, dwArg0188, out s0_139, out s1_38, out a0_317, out a3_318, out a4_319, out a5_320, out s2_140, out s3_321, out s4_322, out s5_323, out s6_324, out s7_325);
			}
		}
		s1_38 = *s1_38;
	}
	if ((word32) s0_139->b0008 != 0x00)
	{
		0x00 = (int8) dwArg38;
		s1Out = s1_38;
		s2Out = s2_140;
		mstatusOut = mstatus;
		return s0;
	}
	else
	{
		0x00 = (int8) dwArg38;
		Eq_2 s0_108;
		Eq_2 s1_111;
		struct Eq_23077 * s2_112;
		word32 t1_117;
		word32 a3_119;
		word32 frm_120;
		word32 fflags_121;
		ptr32 mstatus_122;
		word32 a6_123;
		word32 a7_124;
		word32 s3_125;
		word32 s4_126;
		word32 s5_127;
		word32 s6_128;
		word32 s8_129;
		word32 t0_130;
		word32 t3_131;
		word32 t4_132;
		word32 t5_133;
		word32 t6_134;
		word32 s10_135;
		word32 s11_136;
		word32 s7_137;
		word32 s9_138;
		s2_140();
		s1Out = s1_111;
		s2Out = s2_112;
		mstatusOut = mstatus_122;
		return s0_108;
	}
}

// 230098F6: Register Eq_2 ps_send_pspoll(Register Eq_2 ra, Register ptr32 fflags, Register ptr32 frm, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg58, Stack Eq_2 dwArg88, Stack Eq_2 dwArgBC, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Register out ptr32 s0Out, Register out Eq_25858 s1Out, Register out ptr32 a0Out, Register out Eq_25860 a1Out, Register out ptr32 a3Out, Register out (ptr32 Eq_25862) a4Out, Register out (ptr32 Eq_25863) a5Out, Register out ptr32 s2Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 s7Out, Register out ptr32 s9Out, Register out ptr32 s10Out)
// Called from:
//      ps_polling_frame
//      ps_check_beacon
//      ps_check_frame
Eq_2 ps_send_pspoll(Eq_2 ra, ptr32 fflags, ptr32 frm, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg58, Eq_2 dwArg88, Eq_2 dwArgBC, Eq_2 dwArgD8, Eq_2 dwArgF8, Eq_2 dwArg0118, Eq_2 dwArg0128, ptr32 & s0Out, union Eq_25858 & s1Out, ptr32 & a0Out, union Eq_25860 & a1Out, ptr32 & a3Out, struct Eq_25862 & a4Out, struct Eq_25863 & a5Out, ptr32 & s2Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & s7Out, ptr32 & s9Out, ptr32 & s10Out)
{
	ptr32 a0_148;
	Eq_2 a4_22;
	Eq_2 a5_23;
	phy_get_channel(fp + -40, out a4_22, out a5_23);
	struct Eq_25881 * s4_36;
	struct Eq_25882 * a0_40;
	Eq_2 s3_45;
	word32 s0_224;
	word32 s5_225;
	word32 s6_226;
	word32 s7_227;
	word32 s8_228;
	word32 s9_229;
	word32 s10_230;
	word32 s11_231;
	struct Eq_25863 * a5_129;
	struct Eq_25862 * a4_128;
	ptr32 a3_127;
	Eq_25860 a1_125;
	Eq_25858 s1_133;
	ptr32 s2_136;
	txl_frame_get(ra, (word32) ((word32) bLoc28 != 0x00), (struct Eq_25902 *) 0x10, a4_22, a5_23, fflags, frm, mstatus, dwArgD8, dwArgF8, dwArg0118, out s0_224, out s1_133, out a0_40, out a1_125, out a3_127, out a4_128, out a5_129, out s2_136, out s3_45, out s4_36, out s5_225, out s6_226, out s7_227, out s8_228, out s9_229, out s10_230, out s11_231);
	if (a0_40 != null)
	{
		word32 a4_232;
		tpc_update_frame_tx_power(ra, s3_45, fflags, frm, out a4_232);
		struct Eq_25959 * s2_65 = a0_40->ptr0068;
		s2_65->b014C = 0xA4;
		s2_65->b014D = 0x00;
		ui32 a5_77 = (word32) s4_36->w4201EC28;
		s2_65->b014E = (byte) (a5_77 | 0x0C000000);
		s2_65->b014F = (byte) ((a5_77 | 0x0C000000) >> 8);
		word32 a1_233;
		word32 a2_234;
		word32 a3_235;
		word32 a4_236;
		word32 a5_237;
		word32 a6_238;
		word32 a7_239;
		memcpy(&s2_65->b014F + 1, &s4_36->b4201EC2B + 3, 0x06, out a1_233, out a2_234, out a3_235, out a4_236, out a5_237, out a6_238, out a7_239);
		struct Eq_26010 * a5_100;
		struct Eq_26011 * a3_104;
		word32 a1_240;
		word32 a2_241;
		word32 a4_242;
		word32 a6_243;
		word32 a7_244;
		memcpy(&s2_65->b014F + 7, (word32) s3_45 + 80, 0x06, out a1_240, out a2_241, out a3_104, out a4_242, out a5_100, out a6_243, out a7_244);
		struct Eq_26031 * s1_112 = a3_104->ptr006C;
		struct Eq_24474 * a3_115 = a5_100->ptr003C;
		(a5_100 | 0x10000053)->ptr003C = a3_115;
		s1_112->b002F = (byte) (word32) s4_36->b4201EC2A;
		struct Eq_24700 * a5_122 = (word32) s4_36->b4201EC2B;
		s1_112->b0030 = (byte) a5_122;
		word32 s0_245;
		word32 a0_246;
		word32 s3_247;
		word32 s4_248;
		word32 s11_249;
		ra = txl_frame_push(ra, (char *) s4_36 + 1107422224, 0x03, a3_115, a5_122, mstatus, dwArg08, dwArg58, dwArg88, dwArgBC, out s0_245, out s1_133, out a0_246, out a1_125, out a3_127, out a4_128, out a5_129, out s2_136, out s3_247, out s4_248, out s5, out s6, out s7, out s9, out s10, out s11_249);
		a0_148 = 0x00;
	}
	else
		a0_148 = 0x01;
	0x00 = (int8) dwArg0128;
	s0Out = dwArgE4;
	s1Out = s1_133;
	a0Out = a0_148;
	a1Out = a1_125;
	a3Out = a3_127;
	a4Out = a4_128;
	a5Out = a5_129;
	s2Out = s2_136;
	s5Out = s5;
	s6Out = s6;
	s7Out = s7;
	s9Out = s9;
	s10Out = s10;
	return ra;
}

// 230099BA: Register Eq_2 ps_init(Register Eq_2 ra, Register out ptr32 a0Out)
// Called from:
//      mm_init
Eq_2 ps_init(Eq_2 ra, ptr32 & a0Out)
{
	ptr32 a0_12;
	word32 t1_32;
	word32 a1_33;
	word32 a2_34;
	word32 a3_35;
	word32 a4_36;
	word32 a5_37;
	Eq_2 ra_18 = memset(ra, 1107421660, 0x00, 40, out t1_32, out a0_12, out a1_33, out a2_34, out a3_35, out a4_36, out a5_37);
	g_dw2300978A = 1107421660;
	a0Out = a0_12;
	return ra_18;
}

// 230099E8: void ps_set_mode(Register Eq_2 ra, Register ui32 a0, Register word32 a1, Register ptr32 fflags, Register ptr32 frm, Register ptr32 mstatus, Stack word32 dwArg00, Stack word32 dwArg04, Stack Eq_2 dwArg28, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg8C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8, Stack word32 dwArg0178)
// Called from:
//      ps_enable_cfm
//      ps_disable_cfm
//      mm_set_ps_mode_req_handler
void ps_set_mode(Eq_2 ra, ui32 a0, word32 a1, ptr32 fflags, ptr32 frm, ptr32 mstatus, word32 dwArg00, word32 dwArg04, Eq_2 dwArg28, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg8C, Eq_2 dwArgA8, Eq_2 dwArgC8, Eq_2 dwArgE8, word32 dwArg0178)
{
	struct Eq_25663 * a5_16 = (word32) g_b4201EA00;
	g_w4201E9DE = (word16) a1;
	struct Eq_26141 * s0_170 = &g_b4201E9DC;
	if ((a5_16 & 1) == 0x00 || (a5_16 & 6) == 0x00)
	{
		struct Eq_23077 * s2_172;
		if (a0 == 0x00)
		{
			g_b4201EA00 = 0x00;
			blmac_pwr_mgt_setf(a0, a5_16);
			s2_172 = &g_t23009BCC;
		}
		else
		{
			if (a0 == 0x02)
			{
				g_b4201EA00 = (byte) (a5_16 | 1);
				a5_16 |= 1;
			}
			blmac_pwr_mgt_setf(0x01, a5_16);
			s2_172 = &g_t23009ACA;
		}
		Eq_2 s1_114 = g_t42020B30;
		g_b4201E9E4 = 0x00;
		g_b4201E9F9 = 0x00;
		word32 s3_171 = 0x01;
		while (s1_114 != 0x00)
		{
			if ((word32) *((word32) s1_114 + 86) == 0x00 && (word32) (*((word32) s1_114 + 88)) != 0x00)
			{
				word32 a5_439;
				word32 a4_438;
				word32 a3_437;
				if (chan_is_on_channel(s1_114, out a3_437, out a4_438, out a5_439) != 0x00)
				{
					word32 a5_62 = (word32) s0_170->b0008;
					*((word32) s1_114 + 95) = 0x00;
					s0_170->b0008 = (byte) (a5_62 + 0x01);
					if ((word32) *((word32) s1_114 + 0x0068) != 0x00)
						s0_170->b001D = (byte) s3_171;
					word32 s5_445;
					word32 s7_447;
					word32 s6_446;
					word32 a4_442;
					word32 s4_444;
					word32 a5_443;
					word32 a3_441;
					word32 a0_440;
					ra = txl_frame_send_null_frame(ra, (word32) *((word32) s1_114 + 96), s2_172, fflags, frm, mstatus, dwArg28, dwArg58, dwArg8C, dwArgA8, dwArgC8, dwArgE8, dwArg0178, out s0_170, out s1_114, out a0_440, out a3_441, out a4_442, out a5_443, out s2_172, out s3_171, out s4_444, out s5_445, out s6_446, out s7_447);
				}
			}
			s1_114 = *s1_114;
		}
		if ((word32) s0_170->b0008 != 0x00)
			return;
		word32 t1_143;
		word32 frm_144;
		word32 fflags_145;
		word32 mstatus_146;
		word32 a7_147;
		word32 s5_148;
		word32 s6_149;
		word32 t0_150;
		word32 t4_151;
		word32 t5_152;
		word32 t6_153;
		word32 tp_154;
		word32 s10_155;
		word32 s11_156;
		word32 s7_157;
		word32 s9_158;
		s2_172();
	}
	else
	{
		g_b4201EA01 = (byte) a0;
		g_b4201EA00 = (byte) (a5_16 | 16);
	}
}

// 23009ACA: void ps_enable_cfm(Register Eq_2 ra, Register (ptr32 Eq_26292) a0, Register ui32 a1, Register Eq_2 a4, Register ptr32 fflags, Register ptr32 frm, Register ptr32 mstatus, Stack word32 dwArg00, Stack word32 dwArg04, Stack Eq_2 dwArg28, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg78, Stack Eq_2 dwArg8C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack word32 dwArg0178, Stack word32 dwArg0198)
void ps_enable_cfm(Eq_2 ra, struct Eq_26292 * a0, ui32 a1, Eq_2 a4, ptr32 fflags, ptr32 frm, ptr32 mstatus, word32 dwArg00, word32 dwArg04, Eq_2 dwArg28, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg78, Eq_2 dwArg8C, Eq_2 dwArgA8, Eq_2 dwArgAC, Eq_2 dwArgC8, Eq_2 dwArgE8, Eq_2 dwArg0108, word32 dwArg0178, word32 dwArg0198)
{
	if (a1 << 0x08 >= 0x00)
	{
		ui32 a5_17 = (word32) a0->b005F + 0x01 & 0x00FF;
		a0->b005F = (byte) a5_17;
		if (a5_17 != 0x03)
		{
			struct Eq_23076 * a0_22 = (word32) a0->b0060;
			word32 s7_573;
			word32 s3_569;
			word32 s6_572;
			word32 s4_570;
			word32 s5_571;
			word32 s2_568;
			word32 a4_566;
			word32 a5_567;
			word32 a3_565;
			word32 a0_564;
			word32 s0_562;
			word32 s1_563;
			txl_frame_send_null_frame(ra, a0_22, &g_t23009ACA, fflags, frm, mstatus, dwArg48, dwArg78, dwArgAC, dwArgC8, dwArgE8, dwArg0108, dwArg0198, out s0_562, out s1_563, out a0_564, out a3_565, out a4_566, out a5_567, out s2_568, out s3_569, out s4_570, out s5_571, out s6_572, out s7_573);
			return;
		}
		word32 s1_545;
		ra = mm_send_connection_loss_ind(ra, 0x03, mstatus, dwLoc08, out s1_545, out a4);
	}
	word32 a5_78 = (word32) g_b4201E9E4;
	Eq_2 s0_104 = 1107421660;
	if (a5_78 != 0x00)
	{
		ui32 a5_81 = a5_78 + ~0x00 & 0x00FF;
		g_b4201E9E4 = (byte) a5_81;
		if (a5_81 != 0x00)
			return;
	}
	if ((word32) g_b4201E9F9 != 0x00)
	{
		word32 s3_552;
		word32 s4_553;
		word32 s8_554;
		word32 s2_551;
		word32 a0_546;
		word32 a1_547;
		word32 a5_550;
		word32 a2_548;
		word32 a4_549;
		struct Eq_26384 * s1_105;
		s0_104 = mm_timer_set(1107421672, (word32) *(union Eq_2 *) 0x44B00120 + 0x44B00000, a4, mstatus, out s1_105, out a0_546, out a1_547, out a2_548, out a4_549, out a5_550, out s2_551, out s3_552, out s4_553, out s8_554);
		*((word32) s0_104 + 28) = 0x01;
		for (; s1_105 != null; s1_105 = s1_105->ptr0000)
		{
			if ((word32) s1_105->b0056 == 0x00 && (word32) s1_105->b0058 != 0x00)
			{
				struct Eq_26464 * a5_118 = (word32) s1_105->b0068;
				if (a5_118 != null)
				{
					s1_105 = a5_118->ptr0004;
					(a5_118 & ~0x08)->ptr0004 = s1_105;
				}
			}
		}
	}
	ui32 a5_129 = (word32) *((word32) s0_104 + 36);
	if ((a5_129 & 5) != 0x05)
	{
		Eq_2 a1_134 = (word32) *((word32) s0_104 + 2);
		s0_104->u0 = 0x01;
		word32 s3_559;
		word32 s4_560;
		word32 s8_561;
		word32 s2_558;
		word32 a3_557;
		word32 s1_555;
		word32 a0_556;
		ra = ke_msg_send_basic(ra, 50, a1_134, 0x05, mstatus, dwLoc08, out s0_104, out s1_555, out a0_556, out a3_557, out s2_558, out s3_559, out s4_560, out s8_561);
	}
	else
		*((word32) s0_104 + 36) = (byte) (a5_129 & ~0x0C);
	ui32 a5_172 = (word32) *((word32) s0_104 + 36);
	if ((a5_172 & 16) == 0x00)
		return;
	*((word32) s0_104 + 36) = (byte) (a5_172 & ~0x10);
	word32 a1_183 = (word32) *((word32) s0_104 + 2);
	ui32 a0_184 = (word32) *((word32) s0_104 + 37);
	ps_set_mode(ra, a0_184, a1_183, fflags, frm, mstatus, dwArg00, dwArg04, dwArg28, dwArg48, dwArg58, dwArg8C, dwArgA8, dwArgC8, dwArgE8, dwArg0178);
}

// 23009BCC: void ps_disable_cfm(Register Eq_2 ra, Register (ptr32 Eq_26528) a0, Register ui32 a1, Register Eq_2 a4, Register ptr32 fflags, Register ptr32 frm, Register ptr32 mstatus, Stack word32 dwArg00, Stack word32 dwArg04, Stack Eq_2 dwArg28, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg78, Stack Eq_2 dwArg8C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack word32 dwArg0178, Stack word32 dwArg0198)
void ps_disable_cfm(Eq_2 ra, struct Eq_26528 * a0, ui32 a1, Eq_2 a4, ptr32 fflags, ptr32 frm, ptr32 mstatus, word32 dwArg00, word32 dwArg04, Eq_2 dwArg28, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg78, Eq_2 dwArg8C, Eq_2 dwArgA8, Eq_2 dwArgAC, Eq_2 dwArgC8, Eq_2 dwArgE8, Eq_2 dwArg0108, word32 dwArg0178, word32 dwArg0198)
{
	if (a1 << 0x08 >= 0x00)
	{
		ui32 a5_15 = (word32) a0->b005F + 0x01 & 0x00FF;
		a0->b005F = (byte) a5_15;
		if (a5_15 != 0x03)
		{
			struct Eq_23076 * a0_19 = (word32) a0->b0060;
			word32 s7_409;
			word32 s6_408;
			word32 s2_404;
			word32 s5_407;
			word32 s3_405;
			word32 s4_406;
			word32 a5_403;
			word32 a4_402;
			word32 a3_401;
			word32 a0_400;
			word32 s0_398;
			word32 s1_399;
			txl_frame_send_null_frame(ra, a0_19, &g_t23009BCC, fflags, frm, mstatus, dwArg48, dwArg78, dwArgAC, dwArgC8, dwArgE8, dwArg0108, dwArg0198, out s0_398, out s1_399, out a0_400, out a3_401, out a4_402, out a5_403, out s2_404, out s3_405, out s4_406, out s5_407, out s6_408, out s7_409);
			return;
		}
		word32 s1_388;
		ra = mm_send_connection_loss_ind(ra, 0x03, mstatus, dwLoc08, out s1_388, out a4);
	}
	word32 a5_75 = (word32) g_b4201E9E4;
	struct Eq_26556 * s0_116 = &g_b4201E9DC;
	if (a5_75 != 0x00)
	{
		ui32 a5_78 = a5_75 + ~0x00 & 0x00FF;
		g_b4201E9E4 = (byte) a5_78;
		if (a5_78 != 0x00)
			return;
	}
	word32 a2_389;
	word32 a5_390;
	mm_timer_clear(1107421672, a4, out a2_389, out a5_390);
	ui32 a5_91 = (word32) g_b4201EA00;
	g_b4201E9F8 = 0x00;
	if ((a5_91 & 3) != 0x03)
	{
		Eq_2 a1_98 = (word32) g_w4201E9DE;
		g_b4201E9DC = 0x00;
		word32 s8_397;
		word32 a3_393;
		word32 s4_396;
		word32 s2_394;
		word32 s3_395;
		word32 a0_392;
		word32 s1_391;
		ra = ke_msg_send_basic(ra, 50, a1_98, 0x03, mstatus, dwLoc08, out s0_116, out s1_391, out a0_392, out a3_393, out s2_394, out s3_395, out s4_396, out s8_397);
	}
	else
		g_b4201EA00 = (byte) (a5_91 & ~0x02 | 8);
	ui32 a5_128 = (word32) s0_116->b0024;
	if ((a5_128 & 16) == 0x00)
		return;
	s0_116->b0024 = (byte) (a5_128 & ~0x10);
	word32 a1_138 = (word32) s0_116->w0002;
	ui32 a0_139 = (word32) s0_116->b0025;
	ps_set_mode(ra, a0_139, a1_138, fflags, frm, mstatus, dwArg00, dwArg04, dwArg28, dwArg48, dwArg58, dwArg8C, dwArgA8, dwArgC8, dwArgE8, dwArg0178);
}

// 23009C8E: Register Eq_2 ps_polling_frame(Register Eq_2 ra, Register ptr32 fflags, Register ptr32 frm, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg58, Stack Eq_2 dwArg88, Stack Eq_2 dwArgBC, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0128, Register out (ptr32 Eq_26715) s0Out, Register out ptr32 a4Out)
// Called from:
//      mm_set_ps_mode_req_handler
Eq_2 ps_polling_frame(Eq_2 ra, ptr32 fflags, ptr32 frm, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg58, Eq_2 dwArg88, Eq_2 dwArgBC, Eq_2 dwArgD8, Eq_2 dwArgF8, Eq_2 dwArg0118, Eq_2 dwArg0128, struct Eq_26715 & s0Out, ptr32 & a4Out)
{
	ptr32 a4_12;
	struct Eq_26715 * s0_16;
	word32 s1_46;
	word32 a0_47;
	word32 a1_48;
	word32 a3_49;
	word32 a5_50;
	word32 s2_51;
	word32 s5_52;
	word32 s6_53;
	word32 s7_54;
	word32 s9_55;
	word32 s10_56;
	Eq_2 ra_29 = ps_send_pspoll(ra, fflags, frm, mstatus, dwArg08, dwArg58, dwArg88, dwArgBC, dwArgD8, dwArgF8, dwArg0118, dwArg0128, out s0_16, out s1_46, out a0_47, out a1_48, out a3_49, out a4_12, out a5_50, out s2_51, out s5_52, out s6_53, out s7_54, out s9_55, out s10_56);
	s0Out = s0_16;
	a4Out = a4_12;
	return ra_29;
}

