pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0000.c
// 23009C92: Register Eq_2 ps_check_beacon(Register Eq_2 ra, Register (ptr32 Eq_26748) a0, Register (ptr32 Eq_26749) a2, Register Eq_2 s9, Register Eq_2 s10, Register ptr32 fflags, Register ptr32 frm, Register ptr32 mstatus, Stack Eq_2 dwArg48, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118, Stack Eq_2 dwArg0188, Register out (ptr32 Eq_26765) a3Out, Register out ptr32 s2Out)
// Called from:
//      rxl_cntrl_evt
Eq_2 ps_check_beacon(Eq_2 ra, struct Eq_26748 * a0, struct Eq_26749 * a2, Eq_2 s9, Eq_2 s10, ptr32 fflags, ptr32 frm, ptr32 mstatus, Eq_2 dwArg48, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg9C, Eq_2 dwArgAC, Eq_2 dwArgC8, Eq_2 dwArgE8, Eq_2 dwArg0108, Eq_2 dwArg0118, Eq_2 dwArg0188, struct Eq_26765 & a3Out, ptr32 & s2Out)
{
	struct Eq_26767 * a7_5 = (word32) a2->b0060;
	word32 a6_12 = (word32) g_b4201E9DC;
	uint32 a4_14 = (word32) a7_5->w4201EC28;
	struct Eq_26781 * a2_15 = a7_5->ptr4201EC14;
	word32 a3_16 = a7_5 + 1107422224 & -2;
	a3_16->ptr0004 = a2_15;
	if (a6_12 == 0x00 || (((word32) g_b4201EA00 & 0x08) != 0x00 || a0 == null))
	{
		a3Out = a3_16;
		s2Out = s2;
		return ra;
	}
	if ((word32) a2_15->b005E == 0x00)
	{
		if (((word32) a0->b0004 & 0x01) != 0x00)
			(a3_16 | 2)->ptr0004 = a2_15;
		else
			Mem25[(a7_5 + 1107422224 & ~0x03) + 4:word32] = a2_15;
	}
	ui32 a3_30 = (word32) a0->b0004;
	ui32 a6_32 = (word32) a2_15->b0068;
	struct Eq_26821 * a5_34 = a4_14 >> 0x03;
	struct Eq_26765 * a3_201 = a3_30 & 0x00FE;
	if (a4_14 >> 0x03 >= (a3_30 & 0x00FE) && ((word32) a0->b0001 + ~0x03) + (a3_30 & 0x00FE) >= a4_14 >> 0x03)
	{
		a3_201 = a4_14 & 7;
		a5_34 = (word32) (a0 + (a4_14 >> 0x03) / 5 - (a3_30 & 0x00FE))->b0005 & 0x01 << (a4_14 & 7);
		if (a5_34 != null)
		{
			ptr32 s2_126;
			Eq_2 ra_121;
			struct Eq_26765 * a3_116;
			struct Eq_26887 * a5_103;
			word32 s0_102;
			if ((a6_32 & 0x0F) == 0x0F)
			{
				word32 a0_113;
				struct Eq_26922 * a5_118;
				word32 s9_395;
				word32 s10_396;
				word32 s11_397;
				word32 s7_394;
				word32 s4_391;
				word32 s5_392;
				word32 s6_393;
				word32 s3_390;
				word32 s1_387;
				word32 a1_388;
				word32 a2_389;
				word32 s0_386;
				ra_121 = txl_frame_send_qosnull_frame(s9, s10, fflags, frm, mstatus, dwArg68, dwArg9C, dwArg0188, out s0_386, out s1_387, out a0_113, out a1_388, out a2_389, out a3_116, out a5_118, out s2_126, out s3_390, out s4_391, out s5_392, out s6_393, out s7_394, out s9_395, out s10_396, out s11_397);
				if (a0_113 != 0x00)
					goto l23009D40;
				s0_102 = a5_118->dw0004;
				a5_103 = a5_118 | 8;
			}
			else
			{
				word32 a0_74;
				struct Eq_26893 * a5_79;
				word32 s7_383;
				word32 s9_384;
				word32 s10_385;
				word32 s6_382;
				word32 a1_379;
				word32 a4_380;
				word32 s5_381;
				word32 s1_378;
				word32 s0_377;
				ra_121 = ps_send_pspoll(ra, fflags, frm, mstatus, dwLoc08, dwArg48, dwArg78, dwArgAC, dwArgC8, dwArgE8, dwArg0108, dwArg0118, out s0_377, out s1_378, out a0_74, out a1_379, out a3_116, out a4_380, out a5_79, out s2_126, out s5_381, out s6_382, out s7_383, out s9_384, out s10_385);
				if (a0_74 != 0x00)
					goto l23009D40;
				s0_102 = a5_79->dw0004;
				a5_103 = a5_79 | 4;
			}
			a5_103->dw0004 = s0_102;
l23009D40:
			a3Out = a3_116;
			s2Out = s2_126;
			return ra_121;
		}
	}
	struct Eq_26849 * a5_52;
	word32 a2_50 = a5_34->dw0004;
	if ((a6_32 & 0x0F) == 0x0F)
		a5_52 = a5_34 & ~0x08;
	else
		a5_52 = a5_34 & ~0x04;
	a5_52->dw0004 = a2_50;
	a3Out = a3_201;
	s2Out = s2;
	return ra;
}

// 23009D72: Register Eq_2 ps_check_frame(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register Eq_26978 a1, Register Eq_2 a2, Register Eq_2 s2, Register ptr32 fflags, Register ptr32 frm, Register ptr32 mstatus, Stack Eq_2 dwArg38, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Register out Eq_2 s1Out, Register out Eq_26978 a1Out, Register out Eq_26992 a2Out, Register out Eq_2 a4Out, Register out (ptr32 Eq_26994) s4Out, Register out Eq_26995 s5Out, Register out ptr32 s6Out, Register out Eq_26997 s7Out, Register out (ptr32 Eq_26998) s9Out, Register out (ptr32 Eq_26999) s10Out)
// Called from:
//      rxl_cntrl_evt
Eq_2 ps_check_frame(Eq_2 ra, Eq_2 s1, Eq_2 a0, Eq_26978 a1, Eq_2 a2, Eq_2 s2, ptr32 fflags, ptr32 frm, ptr32 mstatus, Eq_2 dwArg38, Eq_2 dwArg9C, Eq_2 dwArgB8, Eq_2 dwArgD8, Eq_2 dwArgF8, Eq_2 dwArg0108, union Eq_2 & s1Out, union Eq_26978 & a1Out, union Eq_26992 & a2Out, union Eq_2 & a4Out, struct Eq_26994 & s4Out, union Eq_26995 & s5Out, ptr32 & s6Out, union Eq_26997 & s7Out, struct Eq_26998 & s9Out, struct Eq_26999 & s10Out)
{
	if ((word32) g_b4201E9DC == 0x00)
	{
l23009DB0:
		s1Out = s1;
		a1Out = a1;
		a2Out = dwArg48;
		a4Out = a4;
		s4Out = dwArg04;
		s5Out = s5;
		s6Out = s6;
		s7Out = s7;
		s9Out = s9;
		s10Out = s10;
		return ra;
	}
	struct Eq_27013 * a5_134;
	word32 a2_133;
	s1 = (word32) *((word32) a0 + 1) << 8 | (word32) (*a0);
	if (((word32) *((word32) a0 + 4) & 0x01) != 0x00)
	{
		struct Eq_27039 * a5_135 = s1 << 0x12;
		if (s1 << 0x12 < 0x00)
		{
			a5_135 = (word32) *((word32) a2 + 94);
			if (a5_135 == null)
				goto l23009DB0;
		}
		a2_133 = a5_135->dw0004;
		a5_134 = a5_135 & ~0x02;
		goto l23009DAE;
	}
	a1 &= 0x0200;
	if ((a1 & 0x0200) != 0x00)
		goto l23009DB0;
	word32 s3_26 = (word32) g_b4201E9F9;
	if (s3_26 != 0x00)
	{
		if ((s1 & 0x0088) == 0x0088)
		{
			ui32 a4_38;
			ui32 a5_39;
			if ((s1 & 0x0300) == 0x0300)
			{
				a4_38 = (word32) *((word32) a0 + 30);
				a5_39 = (word32) *((word32) a0 + 31);
			}
			else
			{
				a4_38 = (word32) *((word32) a0 + 24);
				a5_39 = (word32) *((word32) a0 + 25);
			}
			ui32 a5_45 = a5_39 << 8 | a4_38;
			a1.u0 = 0x230AD230;
			if (((word32) *((word32) a2 + 0x0068) >> (word32) (a5_45 & 7)->b230AD230 & 0x01) != 0x00)
			{
				a4 = *(union Eq_2 *) 0x44B00120;
				*((word32) a4 + 100) = a2;
				if ((a5_45 & 0x10) == 0x00)
					goto l23009DB0;
				a2_133 = (a5_45 & 0x10)->dw0004;
				a5_134 = a5_45 & 0x10 & ~0x08;
l23009DAE:
				a5_134->dw0004 = a2_133;
				goto l23009DB0;
			}
l23009E78:
			s3_26 = 0x00;
			goto l23009E48;
		}
		if ((s1 & 0x0C) != 0x00 || ((word32) (*((word32) a2 + 0x0068)) & 0x08) == 0x00)
			goto l23009E78;
		*((word32) *(union Eq_2 *) 0x44B00120 + 100) = a2;
	}
l23009E48:
	a1.u0 = 0x01;
	a4 = td_pck_ps_ind(0x01);
	if (s3_26 != 0x00)
		goto l23009DB0;
	struct Eq_27121 * a5_101 = s1 << 0x12;
	if (s1 << 0x12 >= 0x00)
	{
l23009E70:
		(a5_101 & ~0x04)->dw0004 = a5_101->dw0004;
		goto l23009DB0;
	}
	if (((word32) g_b4201EA00 & 0x08) == 0x00)
	{
		word32 a0_96;
		word32 s2_389;
		word32 s0_387;
		word32 a3_388;
		ra = ps_send_pspoll(ra, fflags, frm, mstatus, s2, dwArg38, s1, dwArg9C, dwArgB8, dwArgD8, dwArgF8, dwArg0108, out s0_387, out s1, out a0_96, out a1, out a3_388, out a4, out a5_101, out s2_389, out s5, out s6, out s7, out s9, out s10);
		if (a0_96 != 0x00)
			goto l23009E70;
	}
	goto l23009DB0;
}

// 23009E7C: Register Eq_2 ps_check_tx_frame(Register (ptr32 Eq_27196) a0, Register (ptr32 Eq_27197) a1)
// Called from:
//      txl_cntrl_push
Eq_2 ps_check_tx_frame(struct Eq_27196 * a0, struct Eq_27197 * a1)
{
	if ((word32) g_b4201E9DC == 0x00 || (a0 == (struct Eq_27196 *) 0x00FF || a1 == (struct Eq_27197 *) 0x00FF))
		return a4;
	struct Eq_27207 * a4_15 = (word32) a0->b4201EC2A;
	a4 = (word32) a4_15->b420205A6;
	if (a4 != 0x00)
		return a4;
	a4 = (word32) a4_15->b420205A8;
	if (a4 == 0x00)
		return a4;
	uint32 a4_27 = (word32) a4_15->b420205B8 >> (word32) a1->b230AD230;
	if ((a4_27 & 0x01) == 0x00)
		return td_pck_ps_ind(0x00);
	Eq_2 a5_34 = (a4_27 & 0x01)->t0004;
	(a4_27 & 0x01 | 8)->t0004 = a5_34;
	Eq_2 a4_38 = *(union Eq_2 *) 0x44B00120;
	*((word32) a4_38 + 100) = a5_34;
	return a4_38;
}

// 23009F00: Register Eq_2 ps_uapsd_set(Register (ptr32 Eq_27259) a0, Register word32 a1, Register word32 a2, Register Eq_2 a4, Register ptr32 mstatus, Register out ptr32 s3Out)
// Called from:
//      mm_hw_config_handler
Eq_2 ps_uapsd_set(struct Eq_27259 * a0, word32 a1, word32 a2, Eq_2 a4, ptr32 mstatus, ptr32 & s3Out)
{
	ui32 a1_12 = 0x01 << a1;
	ui32 a5_14 = (word32) a0->b0068;
	if (a2 != 0x00)
	{
		a0->b0068 = (byte) (a5_14 | a1_12 & 0x00FF);
		if ((word32) g_b4201E9DC != 0x00 && (word32) g_b4201E9F8 == 0x00)
		{
			g_b4201E9F9 = 0x01;
			word32 s1_41;
			word32 a0_81;
			word32 a1_82;
			word32 a2_83;
			word32 a5_84;
			word32 s2_85;
			word32 s4_86;
			word32 s8_87;
			*((word32) mm_timer_set(1107421672, (word32) *(union Eq_2 *) 0x44B00120 + 0x44B00000, a4, mstatus, out s1_41, out a0_81, out a1_82, out a2_83, out a4, out a5_84, out s2_85, out s3, out s4_86, out s8_87) + 28) = (byte) s1_41;
		}
	}
	else
		a0->b0068 = (byte) (a5_14 & ~(a1_12 & 0x00FF));
	s3Out = s3;
	return a4;
}

// 23009F68: Register Eq_2 ps_traffic_status_update(Register Eq_2 ra, Register Eq_2 s0, Register (ptr32 Eq_27333) a0, Register ui32 a1, Register ptr32 fflags, Register ptr32 frm, Register ptr32 mstatus, Stack word32 dwArg10, Stack word32 dwArg14, Stack Eq_2 dwArg38, Stack Eq_2 dwArg68, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgF8, Stack word32 dwArg0188, Register out Eq_27347 s1Out, Register out Eq_27348 s2Out, Register out ptr32 mstatusOut)
// Called from:
//      td_timer_end
Eq_2 ps_traffic_status_update(Eq_2 ra, Eq_2 s0, struct Eq_27333 * a0, ui32 a1, ptr32 fflags, ptr32 frm, ptr32 mstatus, word32 dwArg10, word32 dwArg14, Eq_2 dwArg38, Eq_2 dwArg68, Eq_2 dwArg9C, Eq_2 dwArgB8, Eq_2 dwArgD8, Eq_2 dwArgF8, word32 dwArg0188, union Eq_27347 & s1Out, union Eq_27348 & s2Out, ptr32 & mstatusOut)
{
	if ((word32) g_b4201E9DC != 0x00)
	{
		ui32 a5_7 = (word32) g_b4201EA00;
		if ((a5_7 & 1) == 0x00 || (a5_7 & 6) != 0x00)
			goto l23009F8E;
		word32 a0_37;
		if (a1 != 0x00)
		{
l23009F8A:
			a0_37 = 0x01;
			if ((a5_7 & 0x08) != 0x00)
				goto l23009F8E;
			goto l23009FB0;
		}
		Eq_2 a4_12 = g_t42020B30;
		while (true)
		{
			word32 a2_20;
			if (a4_12 == 0x00)
				break;
			struct Eq_27333 * a3_18 = (word32) *((word32) a4_12 + 87);
			if (a3_18 != a0)
			{
				a2_20 = (word32) *((word32) a4_12 + 88);
				if (a2_20 != 0x00 && ((word32) (*((word32) a4_12 + 86)) == 0x00 && ((word32) a3_18->b4201FEE5 & 0x0C) != 0x00))
					goto l23009FA8;
			}
			a4_12 = *a4_12;
		}
		a2_20 = 0x00;
l23009FA8:
		if (a2_20 != 0x00)
			goto l23009F8A;
		if ((a5_7 & 0x08) != 0x00)
		{
			a0_37 = 0x00;
l23009FB0:
			Eq_27347 s1_89;
			Eq_27348 s2_92;
			ptr32 mstatus_109;
			Eq_2 s0_110 = ps_dpsm_update(ra, s0, a0_37, fflags, frm, mstatus, dwArg10, dwArg14, dwArg38, dwArg68, dwArg9C, dwArgB8, dwArgD8, dwArgF8, dwArg0188, out s1_89, out s2_92, out mstatus_109);
			s1Out = s1_89;
			s2Out = s2_92;
			mstatusOut = mstatus_109;
			return s0_110;
		}
	}
l23009F8E:
	s1Out = s1;
	s2Out = s2;
	mstatusOut = mstatus;
	return s0;
}

// 23009FDC: Register Eq_2 bl_init(Register Eq_2 ra, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg10, Stack Eq_2 dwArg14, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg38, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg58, Stack Eq_2 dwArg5C, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg8C, Stack Eq_2 dwArg9C, Stack word32 dwArgE8, Stack Eq_2 dwArgF8, Stack word32 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0138, Stack Eq_2 dwArg0148, Stack Eq_2 dwArg0158, Stack Eq_2 dwArg0168, Stack Eq_2 dwArg0178, Register out ptr32 s0Out, Register out ptr32 a0Out, Register out ptr32 a2Out, Register out ptr32 a3Out, Register out ptr32 s2Out, Register out ptr32 s3Out)
// Called from:
//      wifi_main
Eq_2 bl_init(Eq_2 ra, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg10, Eq_2 dwArg14, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg38, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg58, Eq_2 dwArg5C, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArg7C, Eq_2 dwArg8C, Eq_2 dwArg9C, word32 dwArgE8, Eq_2 dwArgF8, word32 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0138, Eq_2 dwArg0148, Eq_2 dwArg0158, Eq_2 dwArg0168, Eq_2 dwArg0178, ptr32 & s0Out, ptr32 & a0Out, ptr32 & a2Out, ptr32 & a3Out, ptr32 & s2Out, ptr32 & s3Out)
{
	g_dw4200F320 = 1107421708;
	g_dw4201FA08 = 0x00;
	ui32 s0_33;
	Eq_2 a4_46;
	struct Eq_27438 * s0_51;
	word32 a3_171;
	Eq_2 ra_50 = mm_init(me_init(dbg_init(ra), mstatus, out s0_33), s0_33, mstatus, dwLoc08, dwArg08, dwArg10, dwArg14, dwArg18, dwArg30, dwArg34, dwArg38, dwArg40, dwArg44, dwArg50, dwArg54, dwArg58, dwArg5C, dwArg68, dwArg78, dwArg7C, dwArg8C, dwArg9C, dwArgE8, dwArgF8, dwArg0108, dwArg0158, out s0_51, out a3_171, out a4_46);
	ke_init(a4_46, mstatus);
	word32 t1_172;
	word32 a0_173;
	word32 a1_174;
	word32 a2_175;
	word32 a3_176;
	word32 a4_177;
	word32 a5_178;
	Eq_2 ra_80 = memset(ra_50, &s0_51->b0440, 0x00, 0x00EC, out t1_172, out a0_173, out a1_174, out a2_175, out a3_176, out a4_177, out a5_178);
	s0_51->w0444 = ~0x00;
	s0_51->b0440 = 0x00;
	s0_51->b0443 = ~0x00;
	Eq_2 ra_95 = supplicantFuncInit(ra_80, dwArg08, dwArg18, dwArg28, dwArg0138, dwArg0148, dwArg0158, dwArg0168);
	ptr32 a0_113;
	ptr32 a2_115;
	ptr32 s2_119;
	ptr32 s3_120;
	ptr32 a3_128;
	ptr32 s0_131;
	Eq_2 ra_130 = allocSupplicantData(ra_95, dwArg38, dwArg0128, dwArg0138, dwArg0148, dwArg0168, dwArg0178, out s0_131, out a0_113, out a2_115, out a3_128, out s2_119, out s3_120);
	s0Out = s0_131;
	a0Out = a0_113;
	a2Out = a2_115;
	a3Out = a3_128;
	s2Out = s2_119;
	s3Out = s3_120;
	return ra_130;
}

// 2300A040: void bl_reset_evt(Register Eq_2 ra, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArg20, Stack Eq_2 dwArg24, Stack Eq_2 dwArg48, Stack Eq_2 dwArg58, Stack Eq_2 dwArg6C, Stack Eq_2 dwArg8C, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0118)
void bl_reset_evt(Eq_2 ra, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArg20, Eq_2 dwArg24, Eq_2 dwArg48, Eq_2 dwArg58, Eq_2 dwArg6C, Eq_2 dwArg8C, Eq_2 dwArgF8, Eq_2 dwArg0108, Eq_2 dwArg0118)
{
	__csrrc(mstatus, 0x08);
	ke_evt_clear(0x80000000, a4, mstatus);
	Eq_2 a4_20;
	Eq_2 s5_55;
	Eq_2 ra_49 = txl_reset(rxl_reset(ra, hal_machw_reset(a4, dwArg18), mstatus, dwArg20, dwArg24, dwArg48, dwArg6C, dwArg0108, out a4_20), a4_20, mstatus, dwArg0118, out s5_55);
	mm_reset(mstatus, dwArg18);
	vif_mgmt_reset(ra_49, s5_55, mstatus, dwArg48, dwArg58, dwArg8C, dwArgF8);
	__csrrs(mstatus, 0x08);
}

// 2300A06E: Register word32 bl_sleep(Stack Eq_2 dwArg28, Register out ptr32 a3Out)
// Called from:
//      wifi_main
word32 bl_sleep(Eq_2 dwArg28, ptr32 & a3Out)
{
	if (g_ptr420217C8 != null)
	{
		a3Out = a3;
		return 0x00;
	}
	word32 a0_38;
	word32 a0_12;
	word32 a4_142;
	word32 s2_143;
	word32 a2_141;
	ke_state_get(0x04, dwArg28, out a0_12, out a2_141, out a4_142, out s2_143);
	if (a0_12 == 0x00 && ((word32) g_b4201E9DC != 0x00 && g_dw4201E9E0 == 0x00))
	{
		Eq_2 s0_24 = g_t42020B30;
		while (s0_24 != 0x00)
		{
			struct Eq_27618 * a5_28;
			word32 a4_144;
			if (chan_is_on_channel(s0_24, out a3, out a4_144, out a5_28) != 0x00)
			{
				s0_24 = a5_28->t0004;
				if (a5_28 != null)
					goto l2300A07C;
			}
			s0_24 = *s0_24;
		}
		if (g_dw4201FF60 == 0x00)
		{
			a0_38 = hal_machw_sleep_check(out a3);
l2300A07E:
			a3Out = a3;
			return a0_38;
		}
	}
l2300A07C:
	a0_38 = 0x00;
	goto l2300A07E;
}

// 2300A0D0: void bl_nap_calculate()
// Called from:
//      cmd_wifi_coex_pta_force_on
void bl_nap_calculate()
{
	Eq_2 a6_5 = *(union Eq_2 *) 0x44B0808C;
	ui32 a4_13;
	Eq_27650 a0_29 = ~0x00;
	for (a4_13 = 0x00; a4_13 != 0x09; ++a4_13)
	{
		if ((0x01 << a4_13 & a6_5) != 0x00)
		{
			Eq_27650 a5_25;
			Eq_2 a5_21 = ((Eq_2[]) 0x44B00128)[a4_13];
			Eq_2 a3_23 = *(union Eq_2 *) 0x44B00120;
			if (a3_23 < a5_21)
				a5_25 = a5_21 - a3_23;
			else
				a5_25 = (word32) a3_23 - 1 - a5_21;
			if (a5_25 < a0_29)
				a0_29 = a5_25;
		}
	}
}

// 2300A11A: Register Eq_2 mm_ps_change_ind(Register Eq_2 ra, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg08, Register out Eq_2 s0Out, Register out (ptr32 Eq_27681) s1Out, Register out Eq_27682 a1Out, Register out Eq_27683 a2Out, Register out ptr32 a4Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out (ptr32 Eq_27687) s4Out)
// Called from:
//      rxl_cntrl_evt
Eq_2 mm_ps_change_ind(Eq_2 ra, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg08, union Eq_2 & s0Out, struct Eq_27681 & s1Out, union Eq_27682 & a1Out, union Eq_27683 & a2Out, ptr32 & a4Out, ptr32 & s2Out, ptr32 & s3Out, struct Eq_27687 & s4Out)
{
	Eq_2 a0_20;
	word32 s0_28;
	struct Eq_27690 * s1_29;
	word32 a1_79;
	word32 a2_80;
	word32 a3_81;
	word32 a4_82;
	word32 a5_83;
	word32 a6_84;
	word32 s2_85;
	word32 s3_86;
	word32 s4_87;
	word32 s8_88;
	Eq_2 ra_27 = ke_msg_alloc(ra, 73, 0x0D, 0x02, a4, mstatus, dwArg08, out s0_28, out s1_29, out a0_20, out a1_79, out a2_80, out a3_81, out a4_82, out a5_83, out a6_84, out s2_85, out s3_86, out s4_87, out s8_88);
	s1_29->b4201EC2C = (byte) s0_28;
	*a0_20 = (byte) s1_29;
	*((word32) a0_20 + 1) = (byte) s0_28;
	Eq_27683 a2_51;
	ptr32 a4_53;
	struct Eq_27681 * s1_57;
	ptr32 s2_58;
	ptr32 s3_59;
	struct Eq_27687 * s4_60;
	Eq_27682 a1_64;
	word32 a0_89;
	word32 a3_90;
	word32 a5_91;
	word32 s8_92;
	s0Out = ke_msg_send(a0_20, mstatus, out s1_57, out a0_89, out a1_64, out a2_51, out a3_90, out a4_53, out a5_91, out s2_58, out s3_59, out s4_60, out s8_92);
	s1Out = s1_57;
	a1Out = a1_64;
	a2Out = a2_51;
	a4Out = a4_53;
	s2Out = s2_58;
	s3Out = s3_59;
	s4Out = s4_60;
	return ra_27;
}

// 2300A15E: Register (ptr32 Eq_27756) rxl_mpdu_transfer(Register Eq_2 a0, Register ptr32 mstatus, Stack Eq_2 dwArg38, Register out Eq_27760 a5Out, Register out Eq_2 s2Out)
// Called from:
//      rxu_mpdu_upload_and_indicate.constprop.11
//      rxu_cntrl_frame_handle
struct Eq_27756 * rxl_mpdu_transfer(Eq_2 a0, ptr32 mstatus, Eq_2 dwArg38, union Eq_27760 & a5Out, union Eq_2 & s2Out)
{
	struct Eq_27762 * s2_13 = *((word32) a0 + 4);
	Eq_2 s1_17 = s2_13->t0008;
	word32 a4_89;
	word32 a5_90;
	Eq_2 a3_18 = phy_get_channel((char *) &s2_13->t0008 + 60, out a4_89, out a5_90);
	s2_13->dw0054 = g_dw420215A8;
	*((word32) a0 + 29) = 0x00;
	struct Eq_27756 * a4_23 = null;
	while (true)
	{
		ui32 a5_28 = (word32) *((word32) s1_17 + 16);
		if ((a5_28 & 0x01) != 0x00)
			break;
		a4_23 = (struct Eq_27756 *) *((word32) a3_18 + 4);
		*((word32) a0 + 29) = (byte) ((word32) *((word32) a0 + 29) + 0x01);
		if (a3_18 == 0x00)
		{
			0x00 = (int8) dwArg38;
			struct Eq_27756 * a4_57;
			Eq_27760 a5_58;
			word32 a2_91;
			word32 a3_92;
			assert_rec(a3_18, mstatus, out a2_91, out a3_92, out a4_57, out a5_58);
			a5Out = a5_58;
			s2Out.u0 = <invalid>;
			return a4_57;
		}
		s1_17 = a3_18;
	}
	*((word32) s1_17 + 16) = a0;
	a4_23->t000C = a0;
	0x00 = (int8) dwArg38;
	a5Out = a5_28 & 0x01;
	s2Out.u0 = <invalid>;
	return a4_23;
}

// 2300A1DC: Register Eq_2 rxl_init(Register Eq_2 ra, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg30, Stack Eq_2 dwArg34, Stack Eq_2 dwArg58, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg0118)
// Called from:
//      mm_init
Eq_2 rxl_init(Eq_2 ra, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg30, Eq_2 dwArg34, Eq_2 dwArg58, Eq_2 dwArg7C, Eq_2 dwArg0118)
{
	word32 a4_52;
	Eq_2 ra_17 = rxl_hwdesc_init(ra, (struct Eq_27838 *) 0x01, a4, mstatus, dwArg30, dwArg34, dwArg58, dwArg7C, dwArg0118, out a4_52);
	rx_swdesc_init();
	co_list_init(&g_t4201EA18);
	rxu_cntrl_init();
	return ra_17;
}

// 2300A1FC: void rxl_cntrl_dump(Register Eq_2 a5)
// Called from:
//      bl60x_fw_dump_statistic
void rxl_cntrl_dump(Eq_2 a5)
{
	word32 a5_33;
	if (co_list_cnt(a5, out a5_33) != null)
	{
		Eq_2 a5_13 = g_t4201EA18;
		while (a5_13 != 0x00)
			a5_13 = *a5_13;
	}
}

// 2300A222: Register Eq_2 rxl_timer_int_handler(Register Eq_2 a0, Register Eq_2 a1, Register ptr32 mstatus, Register out Eq_2 a4Out, Register out Eq_2 s3Out, Register out Eq_2 s4Out, Register out Eq_2 s8Out)
// Called from:
//      chan_ctxt_update
Eq_2 rxl_timer_int_handler(Eq_2 a0, Eq_2 a1, ptr32 mstatus, union Eq_2 & a4Out, union Eq_2 & s3Out, union Eq_2 & s4Out, union Eq_2 & s8Out)
{
	*(word32 *) 0x000A007C = 0x44B08000;
	Eq_2 a5_16 = 0x44B08000;
	Eq_2 a4_17 = 0x000A0000;
	Eq_2 s1_18 = 0x4201F000;
	while (true)
	{
		Eq_2 s0_26 = *((word32) a5_16 + 8);
		if (a5_16 == 0x00)
			break;
		Eq_2 a3_29 = a4_17 << 0x11;
		if (a3_29 >= 0x00)
			break;
		struct Eq_27904 * a5_58 = *((word32) a1 + 0x0C);
		*((word32) a4_17 + 8) = s0_26;
		a5_16 = a5_58->t0008;
		a1 = *((word32) a0 + 4);
		*((word32) a5_16 + 8) = a1;
		a4_17 = (word32) *((word32) a0 + 28);
		a0 = *((word32) a5_16 + 8);
		if (a4_17 == 0x00)
		{
			if (a5_16 == 0x00)
			{
				*((word32) a1 + 16) = 0x00;
				*((word32) a1 + 0x0C) = null;
				rxl_hd_append(a0, out a4_17, out a5_16);
				continue;
			}
l2300A286:
			a1.u0 = 0x230AA20C;
			word32 a2_162;
			word32 a3_163;
			a0 = assert_rec(a3_29, mstatus, out a2_162, out a3_163, out a4_17, out a5_16);
			continue;
		}
		if (a5_16 == 0x00)
			goto l2300A286;
		a0 = s0_26;
		s1_18 = co_list_push_back(a1, a5_16);
	}
	if (*((word32) s1_18 - 1512) == 0x00)
	{
		a4Out = a4_17;
		s3Out.u0 = <invalid>;
		s4Out.u0 = <invalid>;
		s8Out.u0 = <invalid>;
		return <invalid>;
	}
	else
	{
		word32 a5_161;
		a4Out = ke_evt_set(0x00040000, a4_17, mstatus, out a5_161);
		s3Out.u0 = <invalid>;
		s4Out.u0 = <invalid>;
		s8Out.u0 = <invalid>;
		return <invalid>;
	}
}

// 2300A2D6: Register word32 rxl_timeout_int_handler()
// Called from:
//      hal_machw_gen_handler
word32 rxl_timeout_int_handler()
{
	*(union Eq_2 *) 0x44B0808C &= -65;
	return 0x44B08000;
}

// 2300A2E8: void rxl_dma_int_handler()
void rxl_dma_int_handler()
{
	while (true)
		;
}

