pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0000.c
// 2300ACCC: void scan_probe_req_tx(Register Eq_2 ra, Register (ptr32 Eq_30033) s1, Register Eq_2 s5, Register ptr32 fflags, Register ptr32 frm, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg88, Stack Eq_2 dwArgBC, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0118, Stack word32 dwArg0128)
// Called from:
//      mm_scan_channel_start_ind_handler
void scan_probe_req_tx(Eq_2 ra, struct Eq_30033 * s1, Eq_2 s5, ptr32 fflags, ptr32 frm, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg88, Eq_2 dwArgBC, Eq_2 dwArgD8, Eq_2 dwArgF8, Eq_2 dwArg0118, word32 dwArg0128)
{
	word32 s5_213 = (word32) s1->ptr0010->b001A;
	Eq_2 a4_202 = 0x05D8;
	struct Eq_30055 * s7_215 = (char *) &s1->ptr0010 + 0x00ED;
	int32 s4_212 = 0x00;
	while (s4_212 < (word32) s1->b0150)
	{
		ptr32 a0_45 = 0x01;
		if ((word32) *((char *) (s1 + (s5_213 + 0x06) / 338) + 2) == 0x00)
			a0_45 = (word32) s1->b0151;
		word32 a5_52 = (word32) s7_215->bFFFFFFFF;
		word32 a4_379;
		word32 a3_378;
		Eq_2 s0_74;
		struct Eq_30080 * s1_75;
		struct Eq_30081 * a0_80;
		Eq_2 s2_84;
		struct Eq_30083 * s3_85;
		word32 a1_377;
		word32 s4_381;
		word32 s5_382;
		word32 a5_380;
		word32 s6_383;
		word32 s7_384;
		word32 s9_386;
		word32 s11_388;
		word32 s8_385;
		word32 s10_387;
		txl_frame_get(ra, a0_45, (word32) s1->w014C + (a5_52 + 0x1A), a4_202, a5_52 + 0x1A, fflags, frm, mstatus, dwArgD8, dwArgF8, dwArg0118, out s0_74, out s1_75, out a0_80, out a1_377, out a3_378, out a4_379, out a5_380, out s2_84, out s3_85, out s4_381, out s5_382, out s6_383, out s7_384, out s8_385, out s9_386, out s10_387, out s11_388);
		if (a0_80 == null)
			break;
		Eq_2 s8_95 = *((word32) *((word32) s0_74 + 0x0068) + 0x006C);
		*((word32) s0_74 + 332) = 0x40;
		*((word32) s0_74 + 333) = 0x00;
		*((word32) s0_74 + 334) = 0x00;
		*((word32) s0_74 + 335) = 0x00;
		word32 a3_391;
		word32 a4_392;
		word32 a2_390;
		word32 a1_389;
		word32 a5_393;
		word32 a6_394;
		word32 a7_395;
		memcpy((word32) s0_74 + 336, 0x230CB890, 0x06, out a1_389, out a2_390, out a3_391, out a4_392, out a5_393, out a6_394, out a7_395);
		word32 a1_396;
		word32 a2_397;
		word32 a3_398;
		word32 a4_399;
		word32 a5_400;
		word32 a6_401;
		word32 a7_402;
		memcpy((word32) s0_74 + 342, s2_84, 0x06, out a1_396, out a2_397, out a3_398, out a4_399, out a5_400, out a6_401, out a7_402);
		word32 a1_403;
		word32 a2_404;
		word32 a4_405;
		word32 a5_406;
		word32 a6_407;
		word32 a7_408;
		struct Eq_24474 * a3_140;
		memcpy((word32) s0_74 + 348, (char *) s1_75 + 320, 0x06, out a1_403, out a2_404, out a3_140, out a4_405, out a5_406, out a6_407, out a7_408);
		word32 a5_148 = (word32) s3_85->w0054;
		*((word32) s0_74 + 356) = 0x00;
		uint32 a5_151 = a5_148 + 0x01 << 16;
		s3_85->w0054 = (word16) (a5_151 >> 16);
		uint32 a5_156 = (word32) (word16) (a5_151 >> 16 << 4);
		*((word32) s0_74 + 354) = (byte) a5_156;
		*((word32) s0_74 + 355) = (byte) (a5_156 >> 8);
		int32 a4_160 = (word32) s7_215->bFFFFFFFF;
		*((word32) s0_74 + 357) = (byte) a4_160;
		int32 a5_161;
		for (a5_161 = 0x00; a4_160 != a5_161; ++a5_161)
		{
			a3_140 = (word32) s0_74 + a5_161;
			a3_140->b0166 = (byte) (word32) s7_215[a5_161];
		}
		*((word32) s8_95 + 16) = 0x42045CF0;
		*((word32) s8_95 + 24) -= (word32) s1_75->w014C;
		a0_80->dw02CC = 0x00;
		a0_80->dw02D0 = 0x00;
		a0_80->b002F = (byte) (word32) s1_75->b014E;
		a0_80->b0030 = ~0x00;
		word32 s0_409;
		word32 a0_410;
		word32 a1_411;
		word32 a3_412;
		word32 a5_413;
		word32 s2_414;
		word32 s3_415;
		word32 s6_416;
		word32 s9_417;
		word32 s10_418;
		word32 s11_419;
		ra = txl_frame_push(ra, s0_74, 0x03, a3_140, (struct Eq_24700 *) ~0x00, mstatus, dwArg08, s5, dwArg88, dwArgBC, out s0_409, out s1, out a0_410, out a1_411, out a3_412, out a4_202, out a5_413, out s2_414, out s3_415, out s4_212, out s5_213, out s6_416, out s7_215, out s9_417, out s10_418, out s11_419);
	}
	0x00 = dwArg0128;
}

// 2300AE2A: Register Eq_2 scan_send_cancel_cfm(Register Eq_2 ra, Register Eq_2 a1, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg08)
// Called from:
//      scan_cancel_req_handler
//      mm_scan_channel_end_ind_handler
Eq_2 scan_send_cancel_cfm(Eq_2 ra, Eq_2 a1, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg08)
{
	Eq_2 a0_17;
	word32 s0_25;
	word32 s1_58;
	word32 a1_59;
	word32 a2_60;
	word32 a3_61;
	word32 a4_62;
	word32 a5_63;
	word32 a6_64;
	word32 s2_65;
	word32 s3_66;
	word32 s4_67;
	word32 s8_68;
	ke_msg_alloc(ra, 0x00FFF804, a1, 0x01, a4, mstatus, dwArg08, out s0_25, out s1_58, out a0_17, out a1_59, out a2_60, out a3_61, out a4_62, out a5_63, out a6_64, out s2_65, out s3_66, out s4_67, out s8_68);
	*a0_17 = (byte) s0_25;
	word32 s1_69;
	word32 a0_70;
	word32 a1_71;
	word32 a2_72;
	word32 a3_73;
	word32 a4_74;
	word32 a5_75;
	word32 s2_76;
	word32 s3_77;
	word32 s4_78;
	word32 s8_79;
	return ke_msg_send(a0_17, mstatus, out s1_69, out a0_70, out a1_71, out a2_72, out a3_73, out a4_74, out a5_75, out s2_76, out s3_77, out s4_78, out s8_79);
}

// 2300AE4E: Register Eq_2 sta_mgmt_entry_init(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a4, Stack word32 dwArg00, Stack word32 dwArg04, Register out ptr32 s1Out, Register out (ptr32 Eq_30409) a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out)
// Called from:
//      sta_mgmt_init
//      sta_mgmt_unregister
Eq_2 sta_mgmt_entry_init(Eq_2 ra, Eq_2 a0, Eq_2 a4, word32 dwArg00, word32 dwArg04, ptr32 & s1Out, struct Eq_30409 & a3Out, ptr32 & a4Out, ptr32 & a5Out)
{
	Eq_2 s0_11 = a0;
	ptr32 s1_12 = (word32) a0 + 412;
	while (true)
	{
		Eq_2 a5_15 = *((word32) s0_11 + 412);
		if (a5_15 == 0x00)
			break;
		word32 a1_89;
		word32 a5_88;
		word32 a5_90;
		ra = txl_frame_release(ra, s0_11, co_list_pop_front(a4, a5_15, out a5_88), 0x01, dwArg00, dwArg04, out s0_11, out s1_12, out a1_89, out a5_90);
	}
	word32 t1_91;
	word32 a0_92;
	word32 a1_93;
	word32 a2_94;
	word32 a3_95;
	word32 a4_96;
	word32 a5_97;
	Eq_2 ra_42 = memset(ra, s0_11, 0x00, 432, out t1_91, out a0_92, out a1_93, out a2_94, out a3_95, out a4_96, out a5_97);
	struct Eq_30409 * a5_45 = (word32) s0_11 + 292;
	struct Eq_30409 * a3_46 = (word32) s0_11 + 400;
	do
	{
		a5_45->b0000 = 0x02;
		a5_45->b0001 = 0x02;
		++a5_45;
	} while (a5_45 != a3_46);
	((word32) s0_11 + 26)->u0 = ~0x00;
	s1Out = s1_12;
	a3Out = a3_46;
	a4Out = 0x02;
	a5Out = ~0x00;
	return ra_42;
}

// 2300AEA4: Register Eq_2 sta_mgmt_init(Register Eq_2 ra, Register Eq_2 a4, Register Eq_2 s2, Stack Eq_2 dwArg08, Stack Eq_2 dwArg28, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg70, Stack Eq_2 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgBC, Register out ptr32 a3Out)
// Called from:
//      mm_init
Eq_2 sta_mgmt_init(Eq_2 ra, Eq_2 a4, Eq_2 s2, Eq_2 dwArg08, Eq_2 dwArg28, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg70, Eq_2 dwArg74, Eq_2 dwArg78, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgBC, ptr32 & a3Out)
{
	co_list_init(&g_t4201EA58);
	Eq_2 s1_16 = 1107421792;
	do
	{
		Eq_2 a5_33;
		Eq_2 s1_35;
		word32 a3_191;
		ra = sta_mgmt_entry_init(ra, s1_16, a4, dwLoc20, dwLoc1C, out s1_35, out a3_191, out a4, out a5_33);
		s1_16 = co_list_push_back(s1_35, a5_33);
	} while (s1_16 != 1124199232);
	Eq_2 a3_52;
	word32 a5_194;
	word32 a4_193;
	word32 s1_192;
	Eq_2 ra_55 = sta_mgmt_entry_init(ra, 0x4201FB40, a4, dwLoc20, dwLoc1C, out s1_192, out a3_52, out a4_193, out a5_194);
	*(word32 *) 0x4301EC4C = 0x420443C4;
	*(word32 *) 1124199404 = 0x42020538;
	*(byte *) 1124199258 = 0x00;
	*(byte *) 1124199281 = 0x00;
	Eq_2 a4_83;
	word32 s2_89;
	Eq_2 a3_104;
	word32 s6_205;
	word32 s5_204;
	word32 s4_203;
	word32 s3_202;
	word32 a7_201;
	word32 a5_200;
	word32 a3_199;
	word32 a2_198;
	word32 a1_197;
	word32 a0_196;
	word32 s1_195;
	word32 s7_206;
	word32 s8_207;
	word32 s9_208;
	word32 s10_209;
	word32 s11_210;
	word32 t4_211;
	word32 s1_212;
	word32 a4_213;
	word32 a5_214;
	Eq_2 ra_107 = sta_mgmt_entry_init(printf(ra_55, &g_t230ABF44, a3_52, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_195, out a0_196, out a1_197, out a2_198, out a3_199, out a4_83, out a5_200, out a7_201, out s2_89, out s3_202, out s4_203, out s5_204, out s6_205, out s7_206, out s8_207, out s9_208, out s10_209, out s11_210, out t4_211), 0x4201FCF0, a4_83, dwLoc20, dwLoc1C, out s1_212, out a3_104, out a4_213, out a5_214);
	*(byte *) 1124199690 = 0x01;
	*(word32 *) 1124199932 = 0x42044400;
	*(byte *) 1124199713 = 0x00;
	*(word32 *) 1124199836 = 0x42020B10;
	ptr32 a3_136;
	word32 s1_215;
	word32 a0_216;
	word32 a1_217;
	word32 a2_218;
	word32 a4_219;
	word32 a5_220;
	word32 a7_221;
	word32 s2_222;
	word32 s3_223;
	word32 s4_224;
	word32 s5_225;
	word32 s6_226;
	word32 s7_227;
	word32 s8_228;
	word32 s9_229;
	word32 s10_230;
	word32 s11_231;
	word32 t4_232;
	Eq_2 ra_139 = printf(ra_107, s2_89 + -188, a3_104, dwArg08, dwArg28, dwArg70, dwArg74, dwArg98, dwArgBC, out s1_215, out a0_216, out a1_217, out a2_218, out a3_136, out a4_219, out a5_220, out a7_221, out s2_222, out s3_223, out s4_224, out s5_225, out s6_226, out s7_227, out s8_228, out s9_229, out s10_230, out s11_231, out t4_232);
	a3Out = a3_136;
	return ra_139;
}

// 2300AF80: Register Eq_2 sta_mgmt_register(Register Eq_2 ra, Register (ptr32 Eq_21638) a0, Register (ptr32 byte) a1, Register Eq_2 a4, Register Eq_2 a5, Register Eq_2 s2, Stack Eq_2 dwArg08, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg78, Stack Eq_2 dwArg9C, Register out Eq_2 s0Out, Register out ptr32 a0Out, Register out (ptr32 byte) s3Out, Register out ptr32 s4Out, Register out ptr32 s7Out)
// Called from:
//      mm_sta_add
Eq_2 sta_mgmt_register(Eq_2 ra, struct Eq_21638 * a0, byte * a1, Eq_2 a4, Eq_2 a5, Eq_2 s2, Eq_2 dwArg08, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg78, Eq_2 dwArg9C, union Eq_2 & s0Out, ptr32 & a0Out, byte & s3Out, ptr32 & s4Out, ptr32 & s7Out)
{
	ptr32 a0_179;
	struct Eq_30642 * s2_16 = (word32) a0->b0011;
	byte * s3_144 = a1;
	word32 a5_312;
	Eq_2 a0_23 = co_list_pop_front(a4, a5, out a5_312);
	if (a0_23 != 0x00)
	{
		word32 a4_316;
		word32 a7_319;
		word32 a5_317;
		word32 a6_318;
		word32 a3_315;
		word32 a1_313;
		word32 a2_314;
		memcpy((word32) a0_23 + 30, &a0->w0008 + 1, 0x06, out a1_313, out a2_314, out a3_315, out a4_316, out a5_317, out a6_318, out a7_319);
		s0 = a0_23;
		up32 a5_43 = (word32) a0->b0010;
		if (a5_43 < 0x10)
			a5_43 = 0x10;
		*((word32) a0_23 + 20) = (byte) a5_43;
		struct Eq_30689 * a5_50 = (word32) a0->w0008;
		*((word32) a0_23 + 0x0C) = (word16) a5_50;
		a5_50->t0008 = a0_23;
		struct Eq_30701 * s1_57 = a5_50->ptr0004;
		a5_50->t0010 = a0_23;
		*((word32) a0_23 + 26) = (byte) (word32) s1_57->b0011;
		struct Eq_30716 * a5_61 = (int32) s1_57->b0013;
		*((word32) a0_23 + 36) = (byte) a5_61;
		a5_61->t0028 = a0_23;
		struct Eq_30728 * s1_65 = a5_61->ptr0018;
		a5_61->t002C = a0_23;
		*((word32) a0_23 + 48) = (byte) (word32) s1_65->b001C;
		ui32 a5_75 = (a0_23 - &g_t4201EA60 >> 4) + 1749801491 & 0x00FF;
		*a1 = (byte) a5_75;
		*((word32) a0_23 + 27) = (byte) a5_75;
		*(union Eq_2 *) 0x19000004 = a0_23;
		*((word32) a0_23 + 0x0188) = ~0x00;
		word32 a5_83 = a0_23 + 394;
		do
		{
			a5_83->w0000 = ~0x00;
			a5_83 += 0x02;
		} while (a5_83 != a0_23 + 412);
		struct Eq_274 * a0_115;
		Eq_2 a3_113;
		word32 a5_90 = (word32) *a1;
		*((word32) a0_23 + 49) = 0x00;
		*((word32) a0_23 + 268) = a5_90 + 0x42044478;
		if ((s2_16->dw42020B14 & 0x08) != 0x00)
		{
			a3_113 = *((word32) a0_23 + 0x00A8);
			Mem119[a0_23 + 0x00AC:word32] = a0_23 + 0x00A8;
			a0_115 = (struct Eq_274 *) &g_t230ABF6C;
		}
		else
		{
			*((word32) a0_23 + 0x00AC) = &s2_16->t42020B10;
			a3_113 = s2_16->t42020B10;
			a0_115 = (struct Eq_274 *) &g_t230ABF98;
		}
		word32 a1_322;
		word32 a0_321;
		word32 s1_320;
		word32 a2_323;
		word32 a4_325;
		word32 a3_324;
		word32 a7_327;
		word32 a5_326;
		word32 s2_328;
		word32 s4_329;
		word32 s5_330;
		word32 s6_331;
		word32 s8_332;
		word32 s9_333;
		word32 s10_334;
		word32 s11_335;
		word32 t4_336;
		ra = printf(ra, a0_115, a3_113, s2, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_320, out a0_321, out a1_322, out a2_323, out a3_324, out a4_325, out a5_326, out a7_327, out s2_328, out s3_144, out s4_329, out s5_330, out s6_331, out s7, out s8_332, out s9_333, out s10_334, out s11_335, out t4_336);
		Eq_2 a3_154 = *(union Eq_2 *) 0x44B00120;
		word32 a5_158 = a0_23 + 0x011C;
		do
		{
			*a3_154 = a5_158;
			*((word32) a3_154 - 999996) = a5_158;
			a5_158 = (word32) a5_158 + 0x0C;
		} while (a5_158 != a0_23 + 0x0188);
		co_list_push_back(a0_23, a5_158);
		*((word32) a0_23 + 29) = 0x01;
		a0_179 = 0x00;
	}
	else
		a0_179 = 0x01;
	s0Out = s0;
	a0Out = a0_179;
	s3Out = s3_144;
	s4Out = dwArg04;
	s7Out = s7;
	return ra;
}

