pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0000.c
// 2300B0F4: Register Eq_2 sta_mgmt_unregister(Register Eq_2 ra, Register word32 s0, Register (ptr32 Eq_22021) a0, Register Eq_2 a4, Register out ptr32 a3Out, Register out ptr32 a4Out)
// Called from:
//      mm_sta_add
//      mm_sta_del
Eq_2 sta_mgmt_unregister(Eq_2 ra, word32 s0, struct Eq_22021 * a0, Eq_2 a4, ptr32 & a3Out, ptr32 & a4Out)
{
	word32 a5_14 = (word32) a0->b4201EC2A;
	word32 a5_54;
	co_list_extract(a5_14 + 0x420208A0, (char *) a0 + 1107422224, a4, a5_14 + 2344, out a5_54);
	ptr32 a3_31;
	ptr32 a4_32;
	Eq_2 a5_33;
	word32 s1_55;
	Eq_2 ra_34 = sta_mgmt_entry_init(ra, (char *) a0 + 1107422224, a4, dwLoc10, s0, out s1_55, out a3_31, out a4_32, out a5_33);
	co_list_push_back((char *) a0 + 1107422224, a5_33);
	a3Out = a3_31;
	a4Out = a4_32;
	return ra_34;
}

// 2300B146: Register Eq_2 sta_mgmt_add_key(Register Eq_2 ra, Register (ptr32 Eq_21047) a0, Register ui32 a1, Register out ptr32 s0Out, Register out ptr32 s1Out, Register out (ptr32 Eq_21047) s2Out, Register out ptr32 s3Out)
// Called from:
//      mm_sec_machwkey_wr
Eq_2 sta_mgmt_add_key(Eq_2 ra, struct Eq_21047 * a0, ui32 a1, ptr32 & s0Out, ptr32 & s1Out, struct Eq_21047 & s2Out, ptr32 & s3Out)
{
	struct Eq_30915 * s3_17 = (word32) a0->b0001;
	s3_17->b4201ECB2 = (byte) a1;
	s3_17->b4201ECB0 = (byte) (word32) a0->b0028;
	s3_17->b4201ECB1 = (byte) (word32) a0->b0000;
	word32 t1_142;
	word32 a0_143;
	word32 a1_144;
	word32 a2_145;
	word32 a3_146;
	word32 a4_147;
	word32 a5_148;
	Eq_2 ra_42 = memset(ra, (char *) s3_17 + 1107422288, 0x00, 72, out t1_142, out a0_143, out a1_144, out a2_145, out a3_146, out a4_147, out a5_148);
	struct Eq_30961 * a5_45 = (word32) s3_17->b4201ECB0;
	if (a5_45 != (struct Eq_30961 *) 0x01)
	{
		if (a5_45 != null && a5_45 != (struct Eq_30961 *) 0x03)
		{
			s3_17->dw4201EC98 = 0x00;
			s3_17->dw4201EC9C = 0x00;
		}
		else
		{
			a5_45->dw44C64EA6 = a5_45->dw0000;
			s3_17->dw4201EC98 = &a5_45->dw44C64EA6 >> 16;
			s3_17->dw4201EC9C = 0x00;
		}
	}
	else
	{
		s3_17->dw4201EC98 = 0x00;
		s3_17->dw4201EC9C = 0x00;
		s3_17->dw4201ECA0 = a0->dw0018;
		s3_17->dw4201ECA4 = a0->dw001C;
		s3_17->dw4201ECA8 = a0->dw0020;
		s3_17->dw4201ECAC = a0->dw0024;
	}
	s3_17->b4201ECB3 = 0x01;
	s3_17->ptr4201ECB8 = (char *) s3_17 + 1107422288;
	s0Out = s1;
	s1Out = (char *) s3_17 + 1107422224;
	s2Out = a0;
	s3Out = (char *) s3_17 + 432;
	return ra_42;
}

// 2300B23C: void sta_mgmt_del_key(Register (ptr32 Eq_20265) a0)
// Called from:
//      RemoveAPKeyInfo
void sta_mgmt_del_key(struct Eq_20265 * a0)
{
	a0->b00A3 = 0x00;
	a0->dw00A8 = 0x00;
	a0->b0031 = 0x01;
}

// 2300B24C: Register Eq_2 sta_mgmt_send_postponed_frame(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 s5, Register ptr32 mstatus, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArgBC, Stack Eq_2 dwArg0128, Register out (ptr32 Eq_24791) s0Out, Register out Eq_2 s1Out, Register out ptr32 a0Out, Register out Eq_2 a1Out, Register out ptr32 a2Out, Register out ptr32 a3Out, Register out ptr32 a6Out, Register out Eq_2 s2Out, Register out Eq_2 s3Out, Register out Eq_2 s4Out, Register out Eq_24801 s5Out, Register out ptr32 s6Out, Register out Eq_24803 s7Out, Register out (ptr32 Eq_24804) s9Out, Register out (ptr32 Eq_24805) s10Out, Register out Eq_24806 s11Out)
// Called from:
//      mm_bcn_transmit
//      rxl_cntrl_evt
//      vif_mgmt_send_postponed_frame
//      apm_tx_int_ps_clear
Eq_2 sta_mgmt_send_postponed_frame(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 s5, ptr32 mstatus, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArgBC, Eq_2 dwArg0128, struct Eq_24791 & s0Out, union Eq_2 & s1Out, ptr32 & a0Out, union Eq_2 & a1Out, ptr32 & a2Out, ptr32 & a3Out, ptr32 & a6Out, union Eq_2 & s2Out, union Eq_2 & s3Out, union Eq_2 & s4Out, union Eq_24801 & s5Out, ptr32 & s6Out, union Eq_24803 & s7Out, struct Eq_24804 & s9Out, struct Eq_24805 & s10Out, union Eq_24806 & s11Out)
{
	Eq_2 s3_19 = a0;
	Eq_2 s1_182 = a1;
	ptr32 s0_107 = 0x00;
	Eq_24801 s5_191 = (word32) a1 + 412;
	do
	{
		Eq_2 s2_189 = *((word32) s1_182 + 412);
		if (s2_189 == 0x00)
			break;
		word32 a4_224;
		if (txl_cntrl_tx_check(s3_19, out a3, out a4_224) == 0x00)
			break;
		word32 a4_225;
		if (apm_tx_int_ps_check(s2_189, out a3, out a4_225) == 0x00)
			break;
		Eq_2 a5_51;
		Eq_2 a4_62;
		Eq_2 a0_49;
		ra = apm_tx_int_ps_get_postpone(ra, s3_19, fp + -36, mstatus, dwLoc18, dwArg78, out s0_107, out s1_182, out a0_49, out a1, out a3, out a4_62, out a5_51, out a6, out s2_189, out s3_19, out s5_191, out s6);
		if (a5_51 != 0x00)
			break;
		if (a0_49 == 0x00)
		{
			word32 a5_229;
			a0_49 = co_list_pop_front(a4_62, a5_51, out a5_229);
		}
		Eq_2 a1_75 = (word32) *((word32) a0_49 + 46);
		*((word32) a0_49 + 725) = 0x00;
		ptr32 s4_97;
		word32 a0_226;
		word32 a4_227;
		word32 a5_228;
		ra = txl_cntrl_push_int(ra, a0_49, a1_75, s2_189, mstatus, s5, dwArg88, dwArgBC, out s0_107, out s1_182, out a0_226, out a1, out a3, out a4_227, out a5_228, out a6, out s2_189, out s3_19, out s4_97, out s5_191, out s6, out s7, out s9, out s10, out s11);
	} while (s4_97 == 0x00 || s0_107 != s4_97);
	0x00 = (int8) dwArg0128;
	s0Out = dwArgE4;
	s1Out = s1_182;
	a0Out = s0_107;
	a1Out = a1;
	a2Out = dwArg0100;
	a3Out = a3;
	a6Out = a6;
	s2Out = s2_189;
	s3Out = s3_19;
	s4Out = dwArg78;
	s5Out = s5_191;
	s6Out = s6;
	s7Out = s7;
	s9Out = s9;
	s10Out = s10;
	s11Out = s11;
	return ra;
}

// 2300B2C2: void td_timer_end(Register Eq_2 ra, Register word32 s1, Register Eq_2 a0, Register Eq_2 a3, Register ptr32 fflags, Register ptr32 frm, Register ptr32 mstatus, Stack word32 dwArg00, Stack word32 dwArg04, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack word32 dwArg38, Stack Eq_2 dwArg58, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg88, Stack Eq_2 dwArg8C, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8, Stack word32 dwArg0178)
void td_timer_end(Eq_2 ra, word32 s1, Eq_2 a0, Eq_2 a3, ptr32 fflags, ptr32 frm, ptr32 mstatus, word32 dwArg00, word32 dwArg04, Eq_2 dwArg18, Eq_2 dwArg28, word32 dwArg38, Eq_2 dwArg58, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg88, Eq_2 dwArg8C, Eq_2 dwArgA8, Eq_2 dwArgAC, Eq_2 dwArgC8, Eq_2 dwArgE8, word32 dwArg0178)
{
	Eq_2 s2_128 = *(union Eq_2 *) 0x44B00120;
	struct Eq_31232 * a5_15 = (word32) *((word32) a0 + 35);
	Eq_2 s0_124 = a0;
	if (a5_15 != null)
	{
		ui32 s1_125 = (word32) (s1 != 0x00);
		if (a5_15 != null)
			s1_125 |= 2;
		if (a5_15 != null)
			s1_125 |= 4;
		s0_124 = a5_15->t001C;
		if (a5_15 != null)
			s1_125 |= 8;
		if ((((word32) *((word32) s0_124 + 33) ^ s1_125) & 0x0C) != 0x00)
		{
			ui32 s1_77;
			word32 a0_407;
			word32 a1_408;
			word32 a4_411;
			word32 a2_409;
			word32 a3_410;
			word32 a5_412;
			word32 a7_413;
			word32 s2_414;
			word32 s3_415;
			word32 s4_416;
			word32 s5_417;
			word32 s6_418;
			word32 s7_419;
			word32 s8_420;
			word32 s10_422;
			word32 s11_423;
			word32 t4_424;
			word32 s9_421;
			s0_124 = ps_traffic_status_update(printf(ra, &g_t230AC000, a3, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_77, out a0_407, out a1_408, out a2_409, out a3_410, out a4_411, out a5_412, out a7_413, out s2_414, out s3_415, out s4_416, out s5_417, out s6_418, out s7_419, out s8_420, out s9_421, out s10_422, out s11_423, out t4_424), s0_124, (word32) *((word32) s0_124 + 32), s1_77 & 0x0C, fflags, frm, mstatus, dwArg00, dwArg04, dwArg28, dwArg58, dwArg8C, dwArgA8, dwArgC8, dwArgE8, dwArg0178, out s1_125, out s2_128, out mstatus);
		}
		*((word32) s0_124 + 33) = (byte) s1_125;
	}
	struct Eq_31240 * a4_148 = (word32) *((word32) s0_124 + 32);
	*((word32) s0_124 + 16) = 0x00;
	*((word32) s0_124 + 20) = 0x00;
	*((word32) s0_124 + 24) = 0x00;
	*((word32) s0_124 + 28) = 0x00;
	Eq_2 a4_166 = g_t42022D30;
	*((word32) s0_124 + 35) = (byte) (word32) (a4_148->dw42020590 - a4_166 < 1);
	0x00 = dwArg38;
	Eq_2 a1_173 = (word32) s2_128 + 1000000;
	word32 a5_402;
	word32 a4_401;
	word32 a2_400;
	word32 s1_397;
	word32 a0_398;
	word32 a1_399;
	word32 s2_403;
	word32 s3_404;
	word32 s4_405;
	word32 s8_406;
	mm_timer_set(s0_124, a1_173, a4_166, mstatus, out s1_397, out a0_398, out a1_399, out a2_400, out a4_401, out a5_402, out s2_403, out s3_404, out s4_405, out s8_406);
}

word32 g_dw2300B2C6 = 0xC226C606;
// 2300B3A4: Register Eq_2 td_reset(Register Eq_2 ra, Register Eq_2 a3, Stack Eq_2 dwArg18, Stack Eq_2 dwArg38, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg88, Stack Eq_2 dwArgAC, Register out Eq_2 s1Out, Register out ptr32 a3Out, Register out ptr32 s3Out, Register out ptr32 s4Out)
// Called from:
//      td_init
//      vif_mgmt_unregister
Eq_2 td_reset(Eq_2 ra, Eq_2 a3, Eq_2 dwArg18, Eq_2 dwArg38, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg88, Eq_2 dwArgAC, union Eq_2 & s1Out, ptr32 & a3Out, ptr32 & s3Out, ptr32 & s4Out)
{
	Eq_2 a4_29;
	Eq_2 s1_32;
	struct Eq_31409 * s2_35;
	ptr32 s3_36;
	ptr32 s4_37;
	word32 a5_118;
	word32 a7_119;
	word32 s5_120;
	word32 s6_121;
	word32 a3_117;
	word32 a2_116;
	word32 a1_115;
	word32 a0_114;
	word32 s7_122;
	word32 s8_123;
	word32 s9_124;
	word32 s10_125;
	word32 s11_126;
	word32 t4_127;
	Eq_2 ra_31 = printf(ra, &g_t230ABFCC, a3, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_32, out a0_114, out a1_115, out a2_116, out a3_117, out a4_29, out a5_118, out a7_119, out s2_35, out s3_36, out s4_37, out s5_120, out s6_121, out s7_122, out s8_123, out s9_124, out s10_125, out s11_126, out t4_127);
	if ((word32) *((word32) s1_32 + 0x0022) != 0x00)
	{
		word32 a2_134;
		word32 a5_135;
		mm_timer_clear(s1_32, a4_29, out a2_134, out a5_135);
	}
	ptr32 a3_60;
	word32 t1_128;
	word32 a0_129;
	word32 a1_130;
	word32 a2_131;
	word32 a4_132;
	word32 a5_133;
	Eq_2 ra_63 = memset(ra_31, s1_32, 0x00, 36, out t1_128, out a0_129, out a1_130, out a2_131, out a3_60, out a4_132, out a5_133);
	g_dw2300B2C6 = (char *) s2_35 + 1107427012;
	*((word32) s1_32 + 8) = (char *) s2_35 + 1107427012;
	s2_35->b4201FEE4 = (byte) s2_35;
	0x00 = (int8) dwArg38;
	s1Out = s1_32;
	a3Out = a3_60;
	s3Out = s3_36;
	s4Out = s4_37;
	return ra_63;
}

// 2300B412: Register Eq_2 td_init(Register Eq_2 ra, Register Eq_2 a3, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgAC)
// Called from:
//      mm_init
Eq_2 td_init(Eq_2 ra, Eq_2 a3, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArg9C, Eq_2 dwArgAC)
{
	Eq_2 a3_14;
	Eq_2 a3_35;
	word32 s1_98;
	word32 a0_99;
	word32 a1_100;
	word32 a2_101;
	word32 a4_102;
	word32 a5_103;
	word32 a7_104;
	word32 s2_105;
	word32 s3_106;
	word32 s4_107;
	word32 s5_108;
	word32 s6_109;
	word32 s7_110;
	word32 s8_111;
	word32 s9_112;
	word32 s10_113;
	word32 s11_114;
	word32 t4_115;
	word32 s1_116;
	word32 s3_117;
	word32 s4_118;
	Eq_2 ra_39 = td_reset(printf(ra, &g_t230ABFC0, a3, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_98, out a0_99, out a1_100, out a2_101, out a3_14, out a4_102, out a5_103, out a7_104, out s2_105, out s3_106, out s4_107, out s5_108, out s6_109, out s7_110, out s8_111, out s9_112, out s10_113, out s11_114, out t4_115), a3_14, dwArg08, dwArg28, dwArg50, dwArg54, dwArg78, dwArg9C, out s1_116, out a3_35, out s3_117, out s4_118);
	word32 s1_119;
	word32 a3_120;
	word32 s3_121;
	word32 s4_122;
	return td_reset(ra_39, a3_35, dwArg18, dwArg38, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_119, out a3_120, out s3_121, out s4_122);
}

// 2300B432: Register Eq_2 td_start(Register Eq_2 ra, Register (ptr32 Eq_31560) a0, Register Eq_2 a3, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArg60, Stack Eq_2 dwArg64, Stack Eq_2 dwArg88, Stack Eq_2 dwArgAC, Register out ptr32 s2Out, Register out ptr32 s3Out)
// Called from:
//      vif_mgmt_register
Eq_2 td_start(Eq_2 ra, struct Eq_31560 * a0, Eq_2 a3, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArg60, Eq_2 dwArg64, Eq_2 dwArg88, Eq_2 dwArgAC, ptr32 & s2Out, ptr32 & s3Out)
{
	if ((word32) a0->b4201FEE6 != 0x00)
	{
		s2Out = s2;
		s3Out = s3;
		return s0;
	}
	else
	{
		Eq_2 a4_33;
		word32 s1_36;
		word32 a0_129;
		word32 a1_130;
		word32 a2_131;
		word32 a3_132;
		word32 a5_133;
		word32 a7_134;
		word32 s2_135;
		word32 s3_136;
		word32 s4_137;
		word32 s5_138;
		word32 s6_139;
		word32 s7_140;
		word32 s8_141;
		word32 s9_142;
		word32 s10_143;
		word32 s11_144;
		word32 t4_145;
		printf(ra, &g_t230ABFE0, a3, dwLoc08, dwArg18, dwArg60, dwArg64, dwArg88, dwArgAC, out s1_36, out a0_129, out a1_130, out a2_131, out a3_132, out a4_33, out a5_133, out a7_134, out s2_135, out s3_136, out s4_137, out s5_138, out s6_139, out s7_140, out s8_141, out s9_142, out s10_143, out s11_144, out t4_145);
		a0->b4201FEE6 = 0x01;
		ptr32 s2_67;
		ptr32 s3_68;
		word32 s1_146;
		word32 a0_147;
		word32 a1_148;
		word32 a2_149;
		word32 a4_150;
		word32 a5_151;
		word32 s4_152;
		word32 s8_153;
		Eq_2 s0_65 = mm_timer_set((char *) a0 + 1107427012, s1_36 + 1000000, a4_33, mstatus, out s1_146, out a0_147, out a1_148, out a2_149, out a4_150, out a5_151, out s2_67, out s3_68, out s4_152, out s8_153);
		s2Out = s2_67;
		s3Out = s3_68;
		return s0_65;
	}
}

// 2300B490: Register word32 td_pck_ind(Register word32 a2)
// Called from:
//      rxl_cntrl_evt
//      txl_cntrl_push
word32 td_pck_ind(word32 a2)
{
	if (a2 == 0x00)
	{
		*(union Eq_2 *) 0x35 = *(union Eq_2 *) 52;
		return;
	}
	else
	{
		*(union Eq_2 *) 0x39 = *(union Eq_2 *) 56;
		return;
	}
}

// 2300B4B4: Register word32 td_pck_ps_ind(Register word32 a1)
// Called from:
//      ps_check_frame
//      ps_check_tx_frame
word32 td_pck_ps_ind(word32 a1)
{
	if (a1 == 0x00)
	{
		*(union Eq_2 *) 0x3D = *(union Eq_2 *) 60;
		return;
	}
	else
	{
		*(union Eq_2 *) 0x41 = *(union Eq_2 *) 64;
		return;
	}
}

// 2300B4D8: void bl_tpc_update_power_table(Register ptr32 a0)
// Called from:
//      cmd_wifi_power_table_update
void bl_tpc_update_power_table(ptr32 a0)
{
	trpc_update_power(a0);
	struct Eq_31677 * a4_18 = fp + -72;
	int8 * a5_19;
	for (a5_19 = a0 + 24; a5_19 != a0 + 38; ++a5_19)
	{
		++a4_18;
		a4_18[0x03FF] = (struct Eq_31677) (int32) *a5_19;
	}
	rf_pri_update_power_offset(fp + -72);
}

// 2300B50E: Register (ptr32 byte) bl_tpc_power_table_get(Register Eq_2 a0)
// Called from:
//      wifi_sta_ip_info
byte * bl_tpc_power_table_get(Eq_2 a0)
{
	trpc_power_get(a0);
	int32 a5_23;
	for (a5_23 = 0x18; a5_23 != 38; ++a5_23)
	{
		byte * a3_27 = (word32) a0 + a5_23;
		*a3_27 = 0x00;
	}
	return a3_27;
}

