pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0000.c
// 2300B536: void bl_tpc_update_power_rate_11b(Register ptr32 a0)
// Called from:
//      hal_board_cfg
void bl_tpc_update_power_rate_11b(ptr32 a0)
{
	trpc_update_power_11b(a0);
}

// 2300B53A: void bl_tpc_update_power_rate_11g(Register ptr32 a0)
// Called from:
//      hal_board_cfg
void bl_tpc_update_power_rate_11g(ptr32 a0)
{
	trpc_update_power_11g(a0);
}

// 2300B53E: void bl_tpc_update_power_rate_11n(Register ptr32 a0)
// Called from:
//      hal_board_cfg
void bl_tpc_update_power_rate_11n(ptr32 a0)
{
	trpc_update_power_11n(a0);
}

// 2300B542: Register word32 tpc_update_tx_power(Register Eq_2 ra, Register ptr32 fflags, Register ptr32 frm, Register out ptr32 a4Out, Register out Eq_31736 a5Out)
// Called from:
//      tpc_update_vif_tx_power
//      chan_tx_cfm
//      chan_ctxt_update
//      mm_start_req_handler
word32 tpc_update_tx_power(Eq_2 ra, ptr32 fflags, ptr32 frm, ptr32 & a4Out, union Eq_31736 & a5Out)
{
	word32 a1_54;
	word32 a3_55;
	word32 a4_56;
	word32 a5_57;
	*(int32 *) 0x44B000A0 = trpc_get_default_power_idx(ra, 0x02, 0x00, fflags, frm, out a1_54, out a3_55, out a4_56, out a5_57) | *((int32 *) 0x44B000A0) & -0x0100;
	word32 a3_32;
	word32 a1_58;
	word32 a4_59;
	word32 a5_60;
	Eq_2 a0_29 = trpc_get_default_power_idx(ra, 0x00, 0x00, fflags, frm, out a1_58, out a3_32, out a4_59, out a5_60);
	int32 a5_39 = *(int32 *) 0x44B000A0;
	*(int32 *) 0x44B000A0 = a0_29 << 8 | a5_39 & 0xF00000FF;
	a4Out = 0xF00000FF;
	a5Out = a5_39 & 0xF00000FF;
	return a3_32;
}

// 2300B586: Register Eq_2 tpc_update_vif_tx_power(Register Eq_2 ra, Register Eq_2 a0, Register (ptr32 byte) a1, Register (ptr32 Eq_8454) a2, Register Eq_2 a3, Register ptr32 fflags, Register ptr32 frm, Register out (ptr32 byte) s1Out, Register out Eq_2 a3Out, Register out Eq_31792 a4Out, Register out (ptr32 Eq_8454) s2Out, Register out Eq_31794 s3Out)
// Called from:
//      me_beacon_check
//      sm_assoc_rsp_handler
//      mm_set_power_req_handler
//      apm_start_req_handler
Eq_2 tpc_update_vif_tx_power(Eq_2 ra, Eq_2 a0, byte * a1, struct Eq_8454 * a2, Eq_2 a3, ptr32 fflags, ptr32 frm, byte & s1Out, union Eq_2 & a3Out, union Eq_31792 & a4Out, struct Eq_8454 & s2Out, union Eq_31794 & s3Out)
{
	Eq_31792 a4_5 = (int32) *a1;
	if (a4_5 == 0x007F)
	{
		s1Out = s1;
		a3Out = a3;
		a4Out = a4_5;
		s2Out = s2;
		s3Out = s3;
		return s0;
	}
	else
	{
		Eq_31794 s3_21 = (int32) *((word32) a0 + 89);
		word32 a4_185;
		Eq_2 a3_142;
		Eq_2 a0_27 = phy_get_rf_gain_idx(a1, a2, a3, out a3_142, out a4_185);
		Eq_31792 a4_144 = (int32) *a1;
		Eq_31792 a5_35 = (int32) *((word32) a0 + 90);
		((word32) a0 + 89)->u0 = (byte) a4_144;
		Eq_2 s0_157 = a0;
		if (a5_35 < a4_144)
		{
			*a1 = (byte) a5_35;
			a0_27 = phy_get_rf_gain_idx(a1, a2, a3_142, out a3_142, out a4_144);
		}
		if ((int32) *a1 != s3_21)
		{
			struct Eq_31847 * a5_52;
			for (a5_52 = *((word32) a0 + 848); a5_52 != null; a5_52 = a5_52->ptr0000)
			{
				ui32 a4_55 = (word32) a5_52->b011A;
				a5_52->b011A = (byte) (a4_55 | 16);
				a4_144 = a4_55 | 16;
			}
			s0_157 = *((word32) a0_27 + 64);
			if (a0_27 != 0x00)
			{
				chan_update_tx_power(a0_27, a3_142);
				struct Eq_31876 * a5_70;
				if (chan_is_on_channel(s0_157, out a3_142, out a4_144, out a5_70) != 0x00)
				{
					Eq_2 s0_83 = a5_70->t0040;
					Eq_31792 a4_103;
					word32 a5_186;
					Eq_2 a3_102 = tpc_update_tx_power(ra, fflags, frm, out a4_103, out a5_186);
					s1Out = a1;
					a3Out = a3_102;
					a4Out = a4_103;
					s2Out = a2;
					s3Out = s3_21;
					return s0_83;
				}
			}
		}
		s1Out = a1;
		a3Out = a3_142;
		a4Out = a4_144;
		s2Out = a2;
		s3Out = s3_21;
		return s0_157;
	}
}

// 2300B620: Register Eq_2 tpc_get_vif_tx_power_vs_rate(Register Eq_2 ra, Register Eq_2 a0, Register ptr32 fflags, Register ptr32 frm, Register out (ptr32 Eq_31902) a1Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out (ptr32 Eq_2) a5Out)
// Called from:
//      tpc_update_frame_tx_power
//      txl_frame_get
//      me_init_rate
//      txu_cntrl_push
Eq_2 tpc_get_vif_tx_power_vs_rate(Eq_2 ra, Eq_2 a0, ptr32 fflags, ptr32 frm, struct Eq_31902 & a1Out, ptr32 & a3Out, ptr32 & a4Out, union Eq_2 & a5Out)
{
	uint32 a0_12;
	int32 a1_11 = a0 & 0x00FF & 0x007F;
	if ((a0 >> 11 & 0x07) == 0x00)
	{
		a0_12 = a0 & 0x00FF & 0x007C;
		if (a0_12 != 0x00)
		{
			a1_11 = a1_11 + ~0x03 & 0x00FF;
			a0_12 = 0x01;
		}
	}
	else
		a0_12 = 0x02;
	struct Eq_31902 * a1_22;
	ptr32 a3_24;
	ptr32 a4_25;
	union Eq_2 * a5_26;
	Eq_2 a0_21 = trpc_get_default_power_idx(ra, a0_12, a1_11, fflags, frm, out a1_22, out a3_24, out a4_25, out a5_26);
	a1Out = a1_22;
	a3Out = a3_24;
	a4Out = a4_25;
	a5Out = a5_26;
	return a0_21;
}

// 2300B644: Register word32 tpc_update_frame_tx_power(Register Eq_2 ra, Register Eq_2 a0, Register ptr32 fflags, Register ptr32 frm, Register out ptr32 a4Out)
// Called from:
//      mm_bcn_transmit
//      ps_send_pspoll
//      txl_frame_send_null_frame
//      txl_frame_send_qosnull_frame
//      txl_frame_send_eapol_frame
//      sm_disconnect
//      sm_auth_send
//      sm_assoc_req_send
//      sm_handle_supplicant_result
//      bam_send_air_action_frame
word32 tpc_update_frame_tx_power(Eq_2 ra, Eq_2 a0, ptr32 fflags, ptr32 frm, ptr32 & a4Out)
{
	word32 a3_18;
	ptr32 a4_19;
	word32 a1_33;
	word32 a5_34;
	*((word32) tpc_get_vif_tx_power_vs_rate(ra, a0, fflags, frm, out a1_33, out a3_18, out a4_19, out a5_34) + 36) = *((word32) a0 + 20);
	a4Out = a4_19;
	return a3_18;
}

// 2300B65E: Register Eq_2 txl_cfm_init(Register Eq_2 ra)
// Called from:
//      txl_cntrl_init
//      txl_reset
Eq_2 txl_cfm_init(Eq_2 ra)
{
	word32 t1_36;
	word32 a0_37;
	word32 a1_38;
	word32 a2_39;
	word32 a3_40;
	word32 a4_41;
	word32 a5_42;
	Eq_2 ra_18 = memset(ra, 1107427048, 0x00, 40, out t1_36, out a0_37, out a1_38, out a2_39, out a3_40, out a4_41, out a5_42);
	co_list_init(&g_t4201FEE8);
	co_list_init(&g_t4201FEF0);
	co_list_init(&g_t4201FEF8);
	co_list_init(&g_t4201FF00);
	co_list_init(&g_t4201FF08);
	return ra_18;
}

// 2300B6B4: Register Eq_2 txl_cfm_push(Register (ptr32 Eq_31995) a1, Register Eq_2 a2, Register Eq_2 a5, Register ptr32 mstatus, Register out Eq_2 a4Out)
// Called from:
//      txl_transmit_trigger
//      txu_cntrl_push
Eq_2 txl_cfm_push(struct Eq_31995 * a1, Eq_2 a2, Eq_2 a5, ptr32 mstatus, union Eq_2 & a4Out)
{
	Eq_2 a0_7 = *((word32) a5 + 0x006C);
	a1->t0010 = *a5;
	Eq_5849 a0_17 = (a2 << 0x03) + 1107427048;
	Eq_2 s1_19 = co_list_push_back(a0_7, 1107427048);
	word32 a5_35;
	a4Out = ke_evt_set(a0_17, a2 << 0x03, mstatus, out a5_35);
	return s1_19;
}

// 2300B6F0: void txl_cfm_evt(Register Eq_5849 s0, Register ui32 a0, Register ptr32 mstatus, Stack uint32 dwArg04, Stack Eq_2 dwArg18, Stack word32 dwArg0108)
void txl_cfm_evt(Eq_5849 s0, ui32 a0, ptr32 mstatus, uint32 dwArg04, Eq_2 dwArg18, word32 dwArg0108)
{
	Eq_2 a4_5 = a0 << 0x02;
	int32 * s1_16 = (a0 << 0x03) + 1107427048;
	if ((g_ptr420217C8 & s0) != 0x00)
	{
		Eq_2 a5_37 = ke_evt_clear(s0, a0 << 0x02, mstatus);
		while (*s1_16 != 0x00)
		{
			__csrrc(mstatus, 0x08);
			struct Eq_32052 * a5_54;
			co_list_pop_front(a4_5, a5_37, out a5_54);
			__csrrs(mstatus, 0x08);
			struct Eq_32059 * a5_81;
			Eq_6844 s2_83;
			word32 a1_131;
			word32 s3_132;
			word32 s4_133;
			word32 s5_134;
			word32 mstatus_135;
			txu_cntrl_cfm(me_tx_cfm_singleton(a5_54, dwLoc04, dwArg04, dwArg0108), dwArg18, out s1_16, out a1_131, out a4_5, out a5_81, out s2_83, out s3_132, out s4_133, out s5_134, out mstatus_135);
			a5_81->dw004F = a5_81->dw0050;
			a5_37 = ipc_emb_txcfm_ind(s2_83);
		}
	}
	else
		assert_err();
}

// 2300B790: Register Eq_2 txl_cfm_flush(Register Eq_2 ra, Register Eq_2 a1, Register ui32 a2, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Register out ptr32 s0Out, Register out ptr32 s1Out, Register out Eq_2 a1Out, Register out Eq_2 a4Out, Register out Eq_2 a5Out, Register out Eq_6844 s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out Eq_2 s5Out, Register out Eq_2 s6Out, Register out ptr32 s8Out)
// Called from:
//      txl_cntrl_flush_ac
//      txl_reset
Eq_2 txl_cfm_flush(Eq_2 ra, Eq_2 a1, ui32 a2, Eq_2 a4, Eq_2 a5, ptr32 mstatus, ptr32 & s0Out, ptr32 & s1Out, union Eq_2 & a1Out, union Eq_2 & a4Out, union Eq_2 & a5Out, union Eq_6844 & s2Out, ptr32 & s3Out, ptr32 & s4Out, union Eq_2 & s5Out, union Eq_2 & s6Out, ptr32 & s8Out)
{
	Eq_2 s5_22 = a1;
	ui32 s4_24 = a2;
	ui32 s3_27 = a2 | 0x3C000000;
	while (true)
	{
		union Eq_2 * a5_34;
		if (co_list_pop_front(a4, a5, out a5_34) == 0x00)
			break;
		Eq_2 a5_65 = *a5_34;
		if (a4 != 0x00)
			*((word32) a5_65 + 16) = s3_27;
		else
		{
			a5_65 = *((word32) a4 + 16);
			if (a4 >= 0x00)
				*((word32) a5_65 + 16) = s4_24;
		}
		Eq_2 s0_73 = *((word32) a5_65 + 8);
		if (a5_65 == 0x00)
			a1 = txl_frame_cfm(s0_73, a4, a5_65, mstatus, out a4, out a5);
		else
		{
			// Failed to bind call argument.
			// Please report this issue at https://github.com/uxmal/reko
			Eq_2 stackArg56 = <invalid>;
			word32 s1_161;
			struct Eq_32164 * a5_98;
			word32 s2_162;
			ra = txu_cntrl_cfm((char *) a5_98 - 1, stackArg56, out s1_161, out a1, out a4, out a5_98, out s2_162, out s3_27, out s4_24, out s5_22, out mstatus);
			a5_98->dw004F = a5_98->dw0050;
			a5 = (char *) a5_98 - 1;
			struct Eq_32186 * s0_108 = a5_98->ptr0067;
			if (a5_98 != (struct Eq_32164 *) ~0x00)
				s0_108->dw0068 = 0x00;
		}
	}
	Eq_6844 s2_45;
	ptr32 s3_46;
	ptr32 s1_44 = txl_frame_evt(ra, a1, a4, mstatus, out s2_45, out s3_46);
	Eq_2 a5_62 = ipc_emb_txcfm_ind(s2_45);
	s0Out = s1;
	s1Out = s1_44;
	a1Out.u0 = <invalid>;
	a4Out.u0 = <invalid>;
	a5Out = a5_62;
	s2Out = s2_45;
	s3Out = s3_46;
	s4Out = dwArg04;
	s5Out = s5_22;
	s6Out.u0 = <invalid>;
	s8Out = s4;
	return <invalid>;
}

// 2300B816: void txl_cfm_dma_int_handler(Register (ptr32 Eq_32227) a5)
void txl_cfm_dma_int_handler(struct Eq_32227 * a5)
{
	struct Eq_32228 * a4_5 = a5->ptr0024;
	(a5 & 0x0100)->ptr0020 = a4_5;
	(a4_5 & ~0x01)->dw0004 = a4_5->dw0004;
}

// 2300B832: void txl_cfm_dump(Register Eq_2 a5)
// Called from:
//      bl60x_fw_dump_statistic
void txl_cfm_dump(Eq_2 a5)
{
	Eq_2 s0_13 = 1107427048;
	do
	{
		if (co_list_cnt(a5, out a5) != null)
		{
			s0_13 = *a5;
			while (a5 != 0x00)
				a5 = *a5;
		}
		s0_13 = (word32) s0_13 + 8;
	} while (s0_13 != 0x4201FF10);
}

