pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0000.c
// 2300BBBE: Register Eq_2 txl_payload_handle_backup(Register Eq_2 ra, Register Eq_2 a3, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArg010C, Register out ptr32 s0Out, Register out ptr32 s1Out, Register out (ptr32 Eq_31995) a1Out, Register out Eq_32742 a3Out, Register out Eq_2 a4Out, Register out ptr32 a5Out, Register out Eq_32742 s2Out, Register out (ptr32 Eq_32746) s3Out, Register out Eq_19267 s5Out, Register out ptr32 s6Out, Register out Eq_32749 s7Out, Register out ptr32 s8Out, Register out Eq_2 s9Out, Register out Eq_2 s10Out, Register out (ptr32 Eq_32753) s11Out)
// Called from:
//      txl_cntrl_push_int
//      txl_cntrl_push
//      txl_frame_push_force
Eq_2 txl_payload_handle_backup(Eq_2 ra, Eq_2 a3, Eq_2 a5, ptr32 mstatus, Eq_2 dwArgA8, Eq_2 dwArgD8, Eq_2 dwArg010C, ptr32 & s0Out, ptr32 & s1Out, struct Eq_31995 & a1Out, union Eq_32742 & a3Out, union Eq_2 & a4Out, ptr32 & a5Out, union Eq_32742 & s2Out, struct Eq_32746 & s3Out, union Eq_19267 & s5Out, ptr32 & s6Out, union Eq_32749 & s7Out, ptr32 & s8Out, union Eq_2 & s9Out, union Eq_2 & s10Out, struct Eq_32753 & s11Out)
{
	Eq_2 s9_141 = 0x01000000;
	struct Eq_32746 * s3_135 = &g_t42022F48;
	struct Eq_32758 * s4_136 = g_a4201FF10;
	int32 s1_132 = 0x00;
	Eq_32749 s7_139 = ~0x00780000;
	word32 s8_140 = 1107427192;
	Eq_2 s10_133 = 0x00FFF800;
	s2_183 = s2;
l2300BC00:
	Eq_32742 s2_183;
	if (s3_135->dw00B4 == 0x00)
	{
l2300BC06:
		++s1_132;
		a5.u0 = 0x05;
		++s3_135;
		++s4_136;
		if (s1_132 == 0x05)
		{
			0x00 = (int8) dwArg010C;
			s0Out = dwArgCC;
			s1Out = dwLoc4C;
			a1Out = a1;
			a3Out = s2;
			a4Out = a4;
			a5Out = 0x05;
			s2Out = s2_183;
			s3Out = s3_135;
			s5Out = s5;
			s6Out = s6;
			s7Out = s7_139;
			s8Out = dwArg0148;
			s9Out = s9_141;
			s10Out = s10_133;
			s11Out = s11;
			return dwLoc08;
		}
		goto l2300BC00;
	}
	struct Eq_32265 * a0_390 = *((word32) a5 + 16);
	s3_135->dw00B4 = (word32) a5;
	Eq_2 s0_112 = s1_132 & 0x00FF;
	s5 = 0x01 << s1_132;
	s6 = 400000;
l2300BC48:
	struct Eq_32820 * s2_134 = a0_390->dw0014;
	if (s2_134->dw0008 != 0x00)
	{
		if (s1_132 == 0x04)
		{
			ui32 a4_68;
			struct Eq_32841 * a5_66 = (word32) s2_134->b002F + 0x05D8 + s8_140;
			ui32 a4_67 = (word32) a5_66->b0346;
			if (((word32) a0_390->b014D >> 5 & 0x01) != 0x00)
				a4_68 = a4_67 | 2;
			else
				a4_68 = a4_67 & ~0x02;
			a5_66->b0346 = (byte) a4_68;
		}
		if ((word32) s2_134->b002E == 0x00FF)
		{
			ui32 a4_78 = (word32) s2_134->w0032;
			struct Eq_32323 * s11_81 = &a0_390->b014C;
			if ((a4_78 & 8) != 0x00 && (((word32) a0_390->b014C & 220) == 0x10 && ((word32) s11_81->b001B << 8 | (word32) s11_81->b001A) == 0x00))
			{
				s2_134->w0032 = (word16) (a4_78 | 32);
				rxu_cntrl_monitor_pm(&a0_390->b014D + 3);
			}
			txl_machdr_format(s11_81);
		}
		struct Eq_33027 * a4_106 = s2_134->dw0068;
		s11 = s2_134->dw006C;
		a3 = a4_106 + 1;
		if (((word32) s2_134->w0032 & 0x08) != 0x00)
		{
			s11->dw003C &= s7_139;
			ui32 a5_156 = (word32) a4_106->b0150;
			s11->dw0040 = 0x00;
			s11->dw0038 = (word32) ((a5_156 & 0x01) < 1) << 9;
		}
		else
		{
			s1_132 = txu_cntrl_tkip_mic_append(s0_112, s2_134, s0_112, dwArgA8, dwArgD8, out a1, out a3, out a4_106, out s2_134, out s3_135, out s4_136, out s5, out s6, out s7_139, out s8_140, out s9_141, out s10_133);
			s11->dw0038 = a4_106->dw0124;
			dwLoc4C = a4_106 + 1;
			s0_112 = ra;
		}
		s11->t0028 = a3;
		s11->dw0024 = a4_106->dw0128;
	}
	struct Eq_32808 * a5_298;
	s4_136->w000C = (word16) ((word32) s4_136->w000C + 0x01);
	int32 s2_181 = s2_134->dw006C;
	struct Eq_32824 * a5_182 = s4_136->dw0000;
	s2_183 = s2_181 + 0x04;
	if (a5_182 != null)
	{
		a5_182->dw0004 = s2_181 + 0x04;
		if (s0_112 == 0x02)
		{
			a4.u0 = 0x08;
			goto l2300BD6A;
		}
		if (s0_112 > 0x02)
		{
			if (s0_112 != 0x03)
			{
				if (s0_112 != 0x04)
				{
l2300BD36:
					a4.u0 = 0x02;
					goto l2300BD6A;
				}
				a4.u0 = 0x01;
			}
			else
				a4.u0 = 0x10;
l2300BD6A:
			*(union Eq_2 *) 0x44B08180 = a4;
			a5_298 = (struct Eq_32808 *) 0x44B08000;
			goto l2300BD6E;
		}
		else
		{
			if (s0_112 == 0x01)
			{
				a4.u0 = 0x04;
				goto l2300BD6A;
			}
			goto l2300BD36;
		}
	}
	int32 a0_243;
	Eq_2 a1_185 = *(union Eq_2 *) 0x44B00120;
	if (s0_112 == 0x02)
	{
		if ((*(union Eq_32915 *) 1152418184 >> 0x0C & 0x03) == s0_112)
			goto l2300BDFC;
		*(int32 *) 1152418212 = s2_181 + 0x04;
		*(union Eq_2 *) 0x44B08180 = s10_133;
		a1 = (word32) a1_185 + s6;
l2300BE96:
		a0_243 = s1_132;
l2300BE18:
		s1_132 = blmac_abs_timer_set(a0_243, a1);
		*(union Eq_19267 *) 0x44B08088 = s5;
		a4 = s5 | *((union Eq_2 *) 0x44B0808C);
		*(union Eq_2 *) 0x44B0808C = a4;
		a5_298 = (struct Eq_32808 *) 0x44B08000;
l2300BD6E:
		word32 a0_370 = s3_135->dw00B4;
		s4_136->dw0000 = s2_181 + 0x04;
		if (a0_370 == 0x00)
			goto l2300BC06;
		a0_390 = a5_298->dw0010;
		s3_135->dw00B4 = a5_298;
		goto l2300BC48;
	}
	word32 a5_257;
	if (s0_112 > 0x02)
	{
		if (s0_112 != 0x03)
		{
			if (s0_112 != 0x04)
			{
l2300BDAA:
				a3.u0 = 0x02;
				if ((*(union Eq_32915 *) 1152418184 >> 4 & 0x03) == 0x02)
					goto l2300BDFC;
				*(int32 *) 1152418204 = s2_181 + 0x04;
				((union Eq_2 *) 0x44B08180)->u0 = 0x0200;
l2300BE5C:
				a5_257 = 200000;
				goto l2300BED0;
			}
			Eq_32915 a3_235 = *(union Eq_32915 *) 1152418184;
			a3 = a3_235 & 0x03;
			if ((a3_235 & 0x03) != 0x02)
			{
				*(int32 *) 0x44B08198 = s2_181 + 0x04;
				((union Eq_2 *) 0x44B08180)->u0 = 0x0100;
				a1 = (word32) a1_185 + 0x0C000350;
				a0_243 = 0x04;
				goto l2300BE18;
			}
		}
		else
		{
			a3 = *(union Eq_32915 *) 1152418184 >> 16 & 0x03;
			if (a3 != 0x02)
			{
				*(int32 *) 1152418216 = s2_181 + 0x04;
				*(union Eq_2 *) 0x44B08180 = s9_141;
				goto l2300BE5C;
			}
		}
l2300BDFC:
		word32 a2_914;
		assert_rec(a3, mstatus, out a2_914, out a3, out a4, out a5_298);
		a1 = &g_t230AA20C;
		goto l2300BD6E;
	}
	else
	{
		if (s0_112 == 0x01)
		{
			a3 = *(union Eq_32915 *) 1152418184 >> 8 & 0x03;
			if (a3 == 0x02)
				goto l2300BDFC;
			*(int32 *) 0x44B081A0 = s2_181 + 0x04;
			((union Eq_2 *) 0x44B08180)->u0 = 0x0400;
			a5_257 = 2000000;
l2300BED0:
			a1 = (word32) a1_185 + a5_257;
			goto l2300BE96;
		}
		goto l2300BDAA;
	}
}

// 2300BEE2: Register Eq_2 txl_cntrl_push_int(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg88, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgEC, Register out ptr32 s0Out, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out ptr32 a1Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out ptr32 a6Out, Register out ptr32 s2Out, Register out Eq_2 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 s7Out, Register out ptr32 s9Out, Register out ptr32 s10Out, Register out ptr32 s11Out)
// Called from:
//      sta_mgmt_send_postponed_frame
//      txl_frame_push
Eq_2 txl_cntrl_push_int(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg88, Eq_2 dwArgB8, Eq_2 dwArgEC, ptr32 & s0Out, ptr32 & s1Out, ptr32 & a0Out, ptr32 & a1Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & a5Out, ptr32 & a6Out, ptr32 & s2Out, union Eq_2 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & s7Out, ptr32 & s9Out, ptr32 & s10Out, ptr32 & s11Out)
{
	ptr32 a1_112;
	ptr32 a5_107;
	ptr32 s0_114;
	Eq_2 ra_113;
	ptr32 s1_115;
	ptr32 s2_124;
	Eq_2 s3_117 = *((word32) a0 + 0x006C);
	ptr32 a4_106;
	ptr32 a3_109;
	if (txl_cntrl_tx_check((word32) *((word32) a0 + 47) + 0x42020550, out a3_109, out a4_106) == 0x00 || apm_tx_int_ps_check(a0, out a3_109, out a4_106) == 0x00)
	{
		int32 s2_85 = (word32) *((word32) a0 + 48);
		if (s2_85 == 0x00FF)
		{
			ra_113 = txl_frame_release(ra, a0, a0, 0x00, dwLoc10, dwLoc0C, out s0_114, out s1_115, out a1_112, out a5_107);
			s2_124 = 0x00;
		}
		else
		{
			*((word32) a0 + 46) = (byte) a1;
			*((word32) a0 + 725) = 0x01;
			ra_113 = apm_tx_int_ps_postpone(ra, a0, (word32) co_list_push_back(a0, 0x01) + (s2_85 + 432), mstatus, s2, out s0_114, out s1_115, out a1_112, out a3_109, out a4_106, out a5_107, out s3_117);
			s2_124 = 0x01;
		}
	}
	else
	{
		Eq_2 a5_37 = *((word32) s3_117 + 60);
		*((word32) s3_117 + 60) = a5_37 | 0x0100;
		__csrrc(mstatus, 0x08);
		Eq_2 a3_46 = txl_int_fake_transfer(a1, a5_37 | 0x0100);
		co_list_push_back(a0, a5_37 | 0x0100);
		__csrrs(mstatus, 0x08);
		Eq_2 a5_58 = (a5_37 | 0x0100) + 0x01;
		*((word32) a5_58 + 80) = (a5_37 | 0x0100)->t0050;
		word32 s8_227;
		ra_113 = txl_payload_handle_backup(ra, a3_46, a5_58, mstatus, dwArg88, dwArgB8, dwArgEC, out s0_114, out s1_115, out a1_112, out a3_109, out a4_106, out a5_107, out s2_124, out s3_117, out s5, out s6, out s7, out s8_227, out s9, out s10, out s11);
	}
	s0Out = s0_114;
	s1Out = s1_115;
	a0Out = s2_124;
	a1Out = a1_112;
	a3Out = a3_109;
	a4Out = a4_106;
	a5Out = a5_107;
	a6Out = dwArg28;
	s2Out = s2_124;
	s3Out = s3_117;
	s4Out = dwArg04;
	s5Out = s5;
	s6Out = s6;
	s7Out = s7;
	s9Out = s9;
	s10Out = s10;
	s11Out = s11;
	return ra_113;
}

