pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0000.c
// 2300BFB4: void txl_cntrl_push_int_force(Register Eq_2 ra, Register Eq_2 a1, Register (ptr32 Eq_33313) a4, Register (ptr32 Eq_33314) a5, Register ptr32 mstatus, Stack Eq_2 dwArg98, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgFC)
// Called from:
//      txl_frame_push_force
void txl_cntrl_push_int_force(Eq_2 ra, Eq_2 a1, struct Eq_33313 * a4, struct Eq_33314 * a5, ptr32 mstatus, Eq_2 dwArg98, Eq_2 dwArgC8, Eq_2 dwArgFC)
{
	Eq_2 a0_11 = a4->t006C;
	(a5 | 0x0100)->dw003C = a5->dw003C;
	__csrrc(mstatus, 0x08);
	Eq_2 a3_23 = txl_int_fake_transfer(a1, a5 | 0x0100);
	co_list_push_back(a0_11, a5 | 0x0100);
	__csrrs(mstatus, 0x08);
	Eq_2 a5_35 = (a5 | 0x0100) + 0x01;
	*((word32) a5_35 + 80) = (a5 | 0x0100)->t0050;
	word32 s0_73;
	word32 s1_74;
	word32 a1_75;
	word32 a3_76;
	word32 a4_77;
	word32 a5_78;
	word32 s2_79;
	word32 s3_80;
	word32 s5_81;
	word32 s6_82;
	word32 s7_83;
	word32 s8_84;
	word32 s9_85;
	word32 s10_86;
	word32 s11_87;
	txl_payload_handle_backup(ra, a3_23, a5_35, mstatus, dwArg98, dwArgC8, dwArgFC, out s0_73, out s1_74, out a1_75, out a3_76, out a4_77, out a5_78, out s2_79, out s3_80, out s5_81, out s6_82, out s7_83, out s8_84, out s9_85, out s10_86, out s11_87);
}

// 2300C002: Register Eq_2 txl_cntrl_push(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg50, Stack Eq_2 dwArg54, Stack Eq_2 dwArg78, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgFC, Register out Eq_2 s1Out, Register out ptr32 a4Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 s7Out, Register out ptr32 s8Out)
// Called from:
//      txu_cntrl_push
Eq_2 txl_cntrl_push(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg50, Eq_2 dwArg54, Eq_2 dwArg78, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgC8, Eq_2 dwArgFC, union Eq_2 & s1Out, ptr32 & a4Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & s7Out, ptr32 & s8Out)
{
	Eq_2 a3_51;
	Eq_2 a0_14 = *((word32) a5 + 0x006C);
	word32 a4_16 = Mem9[a0 + 94:byte] + Mem9[a0 + 96:byte];
	Eq_33421 a3_17 = (word32) *((word32) a0_14 + 0x0C);
	*((word32) a5 + 0x0C) = 0x00;
	Mem23[a4_16 + a3_17 + 0x20:word32] = a5;
	*(union Eq_2 *) ~0x3501453D = a5;
	*((word32) a5 + 8) = null;
	*((word32) a5 + 16) = null;
	((word32) a5 + 40)->u0 = 0x00;
	((word32) a5 + 60)->u0 = 0x00;
	*((word32) a5 + 20) = 0x00;
	*((word32) a5 + 24) = 0x00;
	((word32) a5 + 32)->u0 = 0x00;
	((word32) a5 + 64)->u0 = 0x00;
	__csrrc(mstatus, 0x08);
	struct Eq_6750 * a0_36 = *((word32) a5 + 8);
	if (a5 == 0x00)
		a3_51 = txl_int_fake_transfer(a1, a5);
	else
	{
		struct Eq_33477 * a2_39;
		Eq_2 a3_40;
		struct Eq_33479 * a5_42;
		struct Eq_33480 * a0_38 = txl_buffer_alloc(a0_36, a1, 0x00, out a2_39, out a3_40, out a5_42);
		a0_38->t0068 = a0_14;
		*((word32) a0_14 + 20) = a0_38;
		a3_51 = txl_buffer_update_thd(ra, a2_39, a3_40, a5_42, dwArg08, dwArg50, dwArg54, dwArg78, dwArg9C, out a5);
	}
	Eq_2 a5_74;
	Eq_2 s0_77;
	ptr32 s2_81;
	ptr32 s3_82;
	ptr32 s5_84;
	ptr32 s6_85;
	ptr32 s7_86;
	ptr32 s8_87;
	word32 s1_153;
	word32 a1_154;
	word32 a3_155;
	word32 a4_156;
	word32 s9_157;
	word32 s10_158;
	word32 s11_159;
	Eq_2 ra_76 = txl_payload_handle_backup(ra, a3_51, a5, mstatus, dwArg98, dwArgC8, dwArgFC, out s0_77, out s1_153, out a1_154, out a3_155, out a4_156, out a5_74, out s2_81, out s3_82, out s5_84, out s6_85, out s7_86, out s8_87, out s9_157, out s10_158, out s11_159);
	co_list_push_back(s0_77, a5_74);
	__csrrs(mstatus, 0x08);
	Eq_2 s1_101 = *((word32) a5_74 + 80);
	*((word32) a5_74 + 81) = s1_101;
	td_pck_ind(0x00);
	ptr32 a4_115 = ps_check_tx_frame((word32) *((word32) s0_77 + 48), (word32) *((word32) s0_77 + 46));
	s1Out = s1_101;
	a4Out = a4_115;
	s2Out = s2_81;
	s3Out = s3_82;
	s5Out = s5_84;
	s6Out = s6_85;
	s7Out = s7_86;
	s8Out = s8_87;
	return ra_76;
}

// 2300C0BA: void txl_transmit_trigger(Register ui32 a0, Register (ptr32 Eq_31995) a1, Register ptr32 mstatus, Stack word32 dwArg010C)
void txl_transmit_trigger(ui32 a0, struct Eq_31995 * a1, ptr32 mstatus, word32 dwArg010C)
{
	if ((a0 & 0x07C0) == 0x00)
		return;
	word32 a4_361;
	word32 a5_362;
	ui32 s0_38 = 0x19 - __clzsi2(a0 & 0x07C0, out a4_361, out a5_362);
	if ((s0_38 & 0x00FF) <= 0x04)
	{
		(0x01 << (s0_38 & 0x00FF) + 6)->dw007C = 0x44B08000;
		struct Eq_33607 * s6_50 = (s0_38 & 0x00FF) << 0x04;
		struct Eq_33611 * s7_60 = (s0_38 & 0x00FF) << 0x02;
		int32 s1_172 = ~(0x01 << (s0_38 & 0x00FF));
		while (true)
		{
			Eq_2 s2_69 = s6_50->t4201FF14;
			if (s2_69 == 0x00)
				break;
			if (a1 >= null)
				goto l2300C20E;
			Eq_2 a4_101 = *((word32) s2_69 + 8);
			if (a4_101 != 0x00)
			{
				a4_101 = *((word32) s2_69 + 0x0068);
				if (a4_101 != 0x00)
					((word32) s2_69 + 0x0068)->u0 = 0x00;
			}
			Eq_2 a5_114;
			struct Eq_33643 * a5_103 = *a4_101;
			a1->t0010 = a4_101;
			struct Eq_33650 * a5_106 = a5_103->ptr0008;
			if (a5_106 != null)
			{
				a5_114 = a5_106->t003C;
				if (a5_114 >= 0x00)
				{
					Eq_2 a1_184 = *(union Eq_2 *) 0x44B00120;
					int32 a5_186 = s7_60->dw230AC058;
					0x00 = dwArg010C;
					struct Eq_31995 * a1_199 = (word32) a1_184 + a5_186;
					blmac_abs_timer_set(s0_38 & 0x00FF, a1_199);
					return;
				}
			}
			else
			{
				Eq_2 a5_109 = *(union Eq_2 *) 0x44B0808C;
				s6_50->dw4201FF10 = 0x00;
				a5_114 = a5_109 & s1_172;
				*(union Eq_2 *) 0x44B0808C = a5_114;
			}
			word32 a5_363;
			co_list_pop_front(a4_101, a5_114, out a5_363);
			Eq_2 a5_130 = *((word32) s2_69 + 8);
			if (a5_130 == 0x00)
			{
				word32 a4_365;
				word32 a5_366;
				txl_frame_cfm(s2_69, a4_101, a5_130, mstatus, out a4_365, out a5_366);
			}
			else
			{
				word32 a4_364;
				txl_cfm_push(a1, s0_38 & 0x00FF, a5_130, mstatus, out a4_364);
			}
			a1 = (word32) *(union Eq_2 *) 0x44B00120 + s7_60->dw230AC058;
			s1_172 = blmac_abs_timer_set(s0_38 & 0x00FF, a1);
		}
		Eq_2 a4_71 = *(union Eq_2 *) 0x44B0808C;
		s6_50->dw4201FF10 = 0x00;
		*(union Eq_2 *) 0x44B0808C = s1_172 & a4_71;
l2300C20E:
		0x00 = dwArg010C;
	}
	else
		assert_err();
}

// 2300C22E: Register Eq_2 txl_reset(Register Eq_2 ra, Register Eq_2 a4, Register ptr32 mstatus, Stack Eq_2 dwArg0128, Register out (ptr32 Eq_21592) s5Out)
// Called from:
//      mm_force_idle_req
//      bl_reset_evt
Eq_2 txl_reset(Eq_2 ra, Eq_2 a4, ptr32 mstatus, Eq_2 dwArg0128, struct Eq_21592 & s5Out)
{
	word32 s6_29 = (word32) g_w4201FF64;
	ke_evt_clear(0x1F000000, a4, mstatus);
	do
	{
		uint32 a4_41 = a4 << 16;
		a4 = a4_41 >> 16;
	} while (a4_41 >> 16 != 0x0FFFFFFF);
	g_b4201FF66 = 0x01;
	Eq_2 s4_49 = 1107427048;
	word32 s2_51 = 0x00;
	Eq_2 s1_53 = 0x44A00000;
	do
	{
		Eq_2 a5_57 = 0x01 << s2_51;
		*((word32) a5_57 + 32) = s1_53;
		Eq_2 a5_70;
		Eq_2 s3_75;
		word32 s0_220;
		word32 a4_223;
		word32 a1_222;
		word32 s1_221;
		word32 s5_226;
		word32 s4_225;
		word32 s2_224;
		word32 s8_228;
		word32 s6_227;
		txl_cfm_flush(ra, s4_49, 0x40000000, a4_41 >> 16, a5_57, mstatus, out s0_220, out s1_221, out a1_222, out a4_223, out a5_70, out s2_224, out s3_75, out s4_225, out s5_226, out s6_227, out s8_228);
		word32 s0_89;
		word32 s4_93;
		struct Eq_21592 * s5_94;
		word32 s8_95;
		word32 a5_231;
		word32 s3_232;
		word32 s6_233;
		word32 a4_230;
		word32 a1_229;
		txl_cfm_flush(ra, s3_75, 0x40000000, a4_41 >> 16, a5_70, mstatus, out s0_89, out s1_53, out a1_229, out a4_230, out a5_231, out s2_51, out s3_232, out s4_93, out s5_94, out s6_233, out s8_95);
		s4_49 = s4_93 + 0x08;
	} while (s2_51 != s8_95);
	txl_hwdesc_reset();
	txl_buffer_reinit();
	word32 * a5_119;
	word32 a2_237;
	word32 a3_238;
	word32 a4_239;
	word32 t1_234;
	word32 a0_235;
	word32 a1_236;
	Eq_2 ra_120 = memset(txl_cfm_init(ra), s0_89 + -0x00F0, 0x00, 88, out t1_234, out a0_235, out a1_236, out a2_237, out a3_238, out a4_239, out a5_119);
	s5_94->w0054 = (word16) s6_29;
	struct Eq_33845 * s0_123 = s0_89 + -0x00F0;
	do
	{
		co_list_init(&s0_123->dw0000 + 1);
		s0_123->dw0000 = 0x00;
		word32 s1_133 = *a5_119;
		s0_123->b000E = 0x00;
		s0_123->w000C = (word16) a5_119;
		++s0_123;
	} while (s1_133 != ~0x44A0008F);
	0x00 = (int8) dwArg0128;
	s5Out = s5_94;
	return ra_120;
}

// 2300C320: Register Eq_2 txl_cntrl_env_dump(Register Eq_2 a5)
// Called from:
//      bl60x_fw_dump_statistic
Eq_2 txl_cntrl_env_dump(Eq_2 a5)
{
	word32 s0_15;
	for (s0_15 = 0x4201FF14; s0_15 != 0xBDFE0144; s0_15 += 0x10)
	{
		union Eq_2 * s2_20 = s0_15 + 0x00;
		if (co_list_cnt(a5, out a5) != null)
		{
			a5 = *s2_20;
			Eq_2 a4_27 = a5;
			while (a4_27 != 0x00)
				a4_27 = *a4_27;
			while (a5 != 0x00)
			{
				Eq_2 a5_34 = *((word32) a4_27 + 0x006C);
				a4_27 = *((word32) a4_27 + 16);
				while (a4_27 != 0x00)
					a4_27 = *((word32) a4_27 + 4);
				a5 = *a5_34;
			}
		}
	}
	return a5;
}

// 2300C376: Register Eq_2 txl_frame_init_desc(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register out Eq_2 s0Out, Register out Eq_2 s2Out)
// Called from:
//      mm_bcn_init_vif
Eq_2 txl_frame_init_desc(Eq_2 ra, Eq_2 a0, Eq_2 a1, Eq_2 a2, union Eq_2 & s0Out, union Eq_2 & s2Out)
{
	struct Eq_33914 * a3_25;
	word32 t1_66;
	word32 a0_67;
	word32 a1_68;
	word32 a2_69;
	word32 a4_70;
	word32 a5_71;
	Eq_2 ra_28 = memset(ra, a0, 0x00, 728, out t1_66, out a0_67, out a1_68, out a2_69, out a3_25, out a4_70, out a5_71);
	*(union Eq_2 *) ~0x3501453D = a2;
	*((word32) a1 + 352) = a2;
	((word32) a2 + 32)->u0 = 0x00;
	((word32) a2 + 44)->u0 = 0x00;
	((word32) a2 + 48)->u0 = 0x00;
	*((word32) a2 + 52) = 0x00;
	*(struct Eq_33914 **) 3135023902 = a3_25;
	*((word32) a2 + 0x006C) = a0;
	*((word32) a0 + 0x0068) = a1;
	a3_25->t0054 = a0;
	*((word32) a0 + 724) = 0x01;
	s0Out = a2;
	s2Out = a1;
	return ra_28;
}

