pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0000.c
// 2300C3D8: Register Eq_2 txl_frame_init(Register Eq_2 ra, Register word32 a0, Stack Eq_2 dwArg0198)
// Called from:
//      txl_cntrl_init
Eq_2 txl_frame_init(Eq_2 ra, word32 a0, Eq_2 dwArg0198)
{
	co_list_init(&g_ptr4201FF68);
	co_list_init(&g_t4201FF70);
	struct Eq_8437 * a0_106 = &g_t4201FF70;
	Eq_2 s1_108 = 0x420120B8;
	struct Eq_33979 * s0_115 = &g_t42045AE0;
	word32 s3_117 = 0x42044784;
	struct Eq_33983 * s2_119 = g_a42044694;
	struct Eq_33985 * s4_111 = g_a42045C14;
	do
	{
		if (a0 == 0x00 || (word32) (*((word32) s1_108 + 725)) == 0x00)
		{
			word32 a5_289;
			word32 a2_286;
			word32 a3_287;
			word32 a4_288;
			word32 t1_283;
			word32 a0_284;
			word32 a1_285;
			ra = memset(ra, s1_108, 0x00, 728, out t1_283, out a0_284, out a1_285, out a2_286, out a3_287, out a4_288, out a5_289);
			s0_115->dw0004 = ~0x35014541;
			s0_115->dw0020 = 0x00;
			s0_115->dw002C = 0x00;
			s0_115->dw0030 = 0x00;
			s0_115->dw0034 = 0x00;
			s2_119->dw0000 = 3135023902;
			*((word32) s1_108 + 0x0068) = s3_117;
			*((word32) s1_108 + 84) = s2_119;
			s0_115->dw006C = (word32) s1_108;
			s4_111->dw0000 = s0_115;
			Eq_2 a5_100 = s3_117 + 332;
			*((word32) a5_100 + 20) = s0_115;
			*((word32) s1_108 + 724) = 0x00;
			a0_106 = (struct Eq_8437 *) &g_ptr4201FF68;
			s1_108 = co_list_push_back(s1_108, a5_100);
		}
		++s4_111;
		s1_108 = (word32) s1_108 + 728;
		++s0_115;
		s3_117 += 588;
		++s2_119;
	} while (s4_111 != (struct Eq_33985 *) 3187385328);
	g_dw420450B4 = 3135023902;
	g_dw420450E8 = 0x00;
	g_dw420450EC = 0x00;
	ui32 a0_132 = phy_get_ntx(a0_106);
	((Eq_582528[]) 4)[a0_132].dw0000 = 0x420450B4;
	struct Eq_34091 * a0_140 = 0x01 << phy_get_ntx(a0_132 << 0x0E) + 0x01;
	g_dw420450C4 = 0xF0000704;
	*(word32 *) 0x0414 = 0x420450B4;
	a0_140->dw0007 = 0x420450B4;
	g_dw420450C0 = 0x00;
	g_dw420450CC = 0x00;
	g_dw420450D0 = 0x00;
	g_dw420450D4 = 0x00;
	g_dw420450DC = 0x00;
	g_dw420450E0 = 0x00;
	g_dw420450E4 = 0x00;
	g_dw42045A2C = 3135023902;
	g_dw42045A60 = 0x00;
	g_dw42045A64 = 0x00;
	ui32 a0_160 = phy_get_ntx((char *) a0_140 - 1);
	((Eq_582529[]) 4)[a0_160].dw0000 = 0x42045A2C;
	(0x01 << phy_get_ntx(a0_160 << 0x0E) + 0x01)->dw0007 = 0x42045A2C;
	g_dw42045A38 = 0x00;
	g_dw42045A3C = 0xF0000704;
	g_ptr42045A40 = s4_111;
	g_dw42045A44 = 0x00;
	g_dw42045A48 = 0x00;
	g_dw42045A4C = 0x00;
	g_dw42045A54 = 0x00;
	g_dw42045A58 = 0x00;
	g_dw42045A5C = 0x00;
	0x00 = (int8) dwArg0198;
	return ra;
}

// 2300C582: Register Eq_2 txl_frame_get(Register Eq_2 ra, Register ptr32 a0, Register (ptr32 Eq_25902) a1, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 fflags, Register ptr32 frm, Register ptr32 mstatus, Stack Eq_2 dwArg0108, Stack Eq_2 dwArg0128, Stack Eq_2 dwArg0148, Register out ptr32 s0Out, Register out (ptr32 Eq_25912) s1Out, Register out Eq_2 a0Out, Register out (ptr32 Eq_25902) a1Out, Register out Eq_2 a3Out, Register out ptr32 a4Out, Register out (ptr32 Eq_2) a5Out, Register out Eq_25918 s2Out, Register out Eq_2 s3Out, Register out ptr32 s4Out, Register out Eq_2 s5Out, Register out Eq_2 s6Out, Register out Eq_2 s7Out, Register out ptr32 s8Out, Register out Eq_2 s9Out, Register out Eq_2 s10Out, Register out Eq_2 s11Out)
// Called from:
//      ps_send_pspoll
//      scan_probe_req_tx
//      txl_frame_send_null_frame
//      txl_frame_send_qosnull_frame
//      txl_frame_send_eapol_frame
//      sm_disconnect
//      sm_auth_send
//      sm_assoc_req_send
//      sm_handle_supplicant_result
//      apm_send_mlme
//      bam_send_air_action_frame
//      scanu_raw_send_req_handler
Eq_2 txl_frame_get(Eq_2 ra, ptr32 a0, struct Eq_25902 * a1, Eq_2 a4, Eq_2 a5, ptr32 fflags, ptr32 frm, ptr32 mstatus, Eq_2 dwArg0108, Eq_2 dwArg0128, Eq_2 dwArg0148, ptr32 & s0Out, struct Eq_25912 & s1Out, union Eq_2 & a0Out, struct Eq_25902 & a1Out, union Eq_2 & a3Out, ptr32 & a4Out, union Eq_2 & a5Out, union Eq_25918 & s2Out, union Eq_2 & s3Out, ptr32 & s4Out, union Eq_2 & s5Out, union Eq_2 & s6Out, union Eq_2 & s7Out, ptr32 & s8Out, union Eq_2 & s9Out, union Eq_2 & s10Out, union Eq_2 & s11Out)
{
	union Eq_2 * a5_120;
	ptr32 a4_119;
	Eq_2 a3_118;
	struct Eq_34192 * a5_25;
	Eq_2 a0_24 = co_list_pop_front(a4, a5, out a5_25);
	struct Eq_25912 * s1_159 = &g_t42020000;
	ptr32 s4_10 = a0;
	Eq_2 s0_166 = a0_24;
	if (a0_24 != 0x00)
	{
		word32 * a4_62 = a5_25->dw0000;
		if (a5_25 == (struct Eq_34192 *) 0x01)
		{
			*a4_62 = 0x00;
			g_b4200F324 = (byte) a5_25;
			word32 a5_275;
			vTaskEnterCritical(0x4200F000, mstatus, out a5_275);
			Eq_2 a4_145;
			Eq_2 a5_146;
			Eq_2 a2_148;
			Eq_2 a3_149;
			assert_rec(0x01, mstatus, out a2_148, out a3_149, out a4_145, out a5_146);
			Eq_2 a3_154;
			word32 a0_276;
			word32 a2_277;
			word32 a4_278;
			word32 a5_279;
			vTaskDelay(200, a2_148, a3_149, a4_145, a5_146, mstatus, dwLoc0C, dwLoc08, dwArg0108, dwArg0148, out s1_159, out a0_276, out a1, out a2_277, out a3_154, out a4_278, out a5_279, out s2, out s3, out s4_10);
			s0_166.u0 = 0x00;
			a3_118 = vTaskExitCritical(a3_154, mstatus, out a4_119, out a5_120);
		}
		else
		{
			if (a5_25 != null)
			{
				a5_25->ptrFFFFFFFF = a4_62;
				a5_25 = (struct Eq_34192 *) &a5_25->ptrFFFFFFFF;
			}
			Eq_2 a1_82;
			s0_166 = g_t4202006C;
			s3 = *((byte) s0_166.u0 + 0x0068);
			s1_159 = a5_25->ptr0014;
			a1->ptr0020 = s1_159;
			Mem78[a5_25 + (a1 + -1) + 24:word32] = s1_159;
			s2 = (word32) s3 + 0x00F0;
			if (a0 != 0x00)
			{
				a1_82 = (word32) s3 + 0x00F0;
				if (a0 == 0x01)
					a1_82.u0 = 0x42045A2C;
			}
			else
				a1_82.u0 = 0x420450B4;
			word32 a1_280;
			word32 a2_281;
			word32 a3_282;
			word32 a4_283;
			word32 a5_284;
			word32 a6_285;
			word32 a7_286;
			memcpy((word32) s3 + 0x00F0, a1_82, 52, out a1_280, out a2_281, out a3_282, out a4_283, out a5_284, out a6_285, out a7_286);
			*((word32) s3 + 0x0114) = tpc_get_vif_tx_power_vs_rate(ra, *((word32) s3 + 260), fflags, frm, out a1, out a3_118, out a4_119, out a5_120);
			s1_159->ptr0028 = (word32) s3 + 0x00F0;
			s1_159->dw0024 = 0x00;
			s1_159->dw003C = 0x00;
			s1_159->dw0010 = 0x00;
			*((byte) s0_166.u0 + 0x02CC) = null;
			((byte) s0_166.u0 + 720)->u0 = 0x00;
		}
	}
	else
	{
		a5_120 = (union Eq_2 *) *a4;
		a3_118.u0 = 0x0A;
		a4_119 = (word32) a4 + 1;
		if (a4 != ~0x08)
			*((word32) a4 + 1) = a5_120;
		else
		{
			*a5_120 = (union Eq_2 *) 0x00;
			g_dw4200F328 = 0x02;
			Eq_2 a5_37;
			struct Eq_25912 * a0_36 = co_list_cnt(0x4200F000, out a5_37);
			a4_119 = 0x02;
			s1_159 = a0_36;
			if ((co_list_cnt(a5_37, out a5_120) | a0_36) == 0x00)
				s0_166 = txl_cntrl_clear_all_ac(mstatus, out s1_159, out a1, out a3_118, out a4_119, out a5_120, out s2, out s3, out s4_10);
		}
	}
	0x00 = (int8) dwArg0128;
	s0Out = dwArgE4;
	s1Out = s1_159;
	a0Out = s0_166;
	a1Out = a1;
	a3Out = a3_118;
	a4Out = a4_119;
	a5Out = a5_120;
	s2Out = s2;
	s3Out = s3;
	s4Out = s4_10;
	s5Out.u0 = <invalid>;
	s6Out.u0 = <invalid>;
	s7Out.u0 = <invalid>;
	s8Out = dwArg58;
	s9Out.u0 = <invalid>;
	s10Out.u0 = <invalid>;
	s11Out.u0 = <invalid>;
	return <invalid>;
}

// 2300C6AE: Register Eq_2 txl_frame_push(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a1, Register (ptr32 Eq_24474) a3, Register (ptr32 Eq_24700) a5, Register ptr32 mstatus, Stack Eq_2 dwArg38, Stack Eq_2 dwArg88, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgEC, Register out (ptr32 Eq_24706) s0Out, Register out (ptr32 Eq_24707) s1Out, Register out ptr32 a0Out, Register out ptr32 a1Out, Register out ptr32 a3Out, Register out Eq_24711 a4Out, Register out ptr32 a5Out, Register out (ptr32 Eq_24713) s2Out, Register out (ptr32 Eq_24714) s3Out, Register out (ptr32 Eq_24715) s4Out, Register out (ptr32 Eq_24716) s5Out, Register out (ptr32 Eq_24717) s6Out, Register out (ptr32 Eq_24718) s7Out, Register out ptr32 s9Out, Register out ptr32 s10Out, Register out ptr32 s11Out)
// Called from:
//      mm_bcn_transmit
//      ps_send_pspoll
//      scan_probe_req_tx
//      txl_frame_send_null_frame
//      txl_frame_send_qosnull_frame
//      txl_frame_send_eapol_frame
//      sm_frame_tx_cfm_handler
//      sm_disconnect
//      sm_auth_send
//      sm_assoc_req_send
//      sm_handle_supplicant_result
//      apm_send_mlme
//      bam_send_air_action_frame
Eq_2 txl_frame_push(Eq_2 ra, Eq_2 s0, Eq_2 a1, struct Eq_24474 * a3, struct Eq_24700 * a5, ptr32 mstatus, Eq_2 dwArg38, Eq_2 dwArg88, Eq_2 dwArgB8, Eq_2 dwArgEC, struct Eq_24706 & s0Out, struct Eq_24707 & s1Out, ptr32 & a0Out, ptr32 & a1Out, ptr32 & a3Out, union Eq_24711 & a4Out, ptr32 & a5Out, struct Eq_24713 & s2Out, struct Eq_24714 & s3Out, struct Eq_24715 & s4Out, struct Eq_24716 & s5Out, struct Eq_24717 & s6Out, struct Eq_24718 & s7Out, ptr32 & s9Out, ptr32 & s10Out, ptr32 & s11Out)
{
	Eq_2 a0_12 = *((word32) s0 + 0x006C);
	if ((a5 & 0x01) == 0x00)
	{
		struct Eq_34419 * s0_27 = a3->ptr0014;
		s0_27->dw0008 = 0x00;
		s0_27->dw000C = 0x00;
		(a5 & 0x01 & ~0x00780000)->ptr003C = s0_27;
		ui32 a5_33 = (word32) a3->b0004;
		s0_27->dw0040 = 0x00;
		((Eq_582530[]) 56)[(word32) ((a5_33 & 0x01) < 1)].ptr0000 = s0_27;
		0x00 = (int8) dwArg38;
		ptr32 a0_46;
		ptr32 a1_47;
		ptr32 a3_49;
		Eq_24711 a4_50;
		ptr32 a5_51;
		struct Eq_24706 * s0_54;
		struct Eq_24707 * s1_55;
		ptr32 s10_56;
		ptr32 s11_57;
		struct Eq_24713 * s2_58;
		struct Eq_24714 * s3_59;
		struct Eq_24715 * s4_60;
		struct Eq_24716 * s5_61;
		struct Eq_24717 * s6_62;
		struct Eq_24718 * s7_63;
		ptr32 s9_65;
		word32 a6_96;
		Eq_2 ra_53 = txl_cntrl_push_int(ra, a0_12, a1, a1, mstatus, dwArg88, dwArgB8, dwArgEC, out s0_54, out s1_55, out a0_46, out a1_47, out a3_49, out a4_50, out a5_51, out a6_96, out s2_58, out s3_59, out s4_60, out s5_61, out s6_62, out s7_63, out s9_65, out s10_56, out s11_57);
		s0Out = s0_54;
		s1Out = s1_55;
		a0Out = a0_46;
		a1Out = a1_47;
		a3Out = a3_49;
		a4Out = a4_50;
		a5Out = a5_51;
		s2Out = s2_58;
		s3Out = s3_59;
		s4Out = s4_60;
		s5Out = s5_61;
		s6Out = s6_62;
		s7Out = s7_63;
		s9Out = s9_65;
		s10Out = s10_56;
		s11Out = s11_57;
		return ra_53;
	}
	else
		assert_err();
}

// 2300C716: void txl_frame_push_force(Register Eq_2 ra, Register Eq_2 a1, Register (ptr32 Eq_34497) a3, Register Eq_2 a5, Register ptr32 mstatus, Stack word32 dwArg38, Stack Eq_2 dwArg98, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgFC)
// Called from:
//      scanu_raw_send_req_handler
void txl_frame_push_force(Eq_2 ra, Eq_2 a1, struct Eq_34497 * a3, Eq_2 a5, ptr32 mstatus, word32 dwArg38, Eq_2 dwArg98, Eq_2 dwArgC8, Eq_2 dwArgFC)
{
	if ((a5 & 0x01) == 0x00)
	{
		struct Eq_34508 * s0_27 = a3->ptr0014;
		s0_27->dw0008 = 0x00;
		s0_27->dw000C = 0x00;
		(a5 & 0x01 & ~0x00780000)->ptr003C = s0_27;
		ui32 a5_33 = (word32) a3->b0004;
		s0_27->dw0040 = 0x00;
		ui32 a5_37 = (word32) ((a5_33 & 0x01) < 1);
		((Eq_582531[]) 56)[a5_37].ptr0000 = s0_27;
		0x00 = dwArg38;
		txl_cntrl_push_int_force(ra, a1, (struct Eq_33313 *) ~0x00780000, a5_37 << 9, mstatus, dwArg98, dwArgC8, dwArgFC);
	}
	else
		assert_err();
}

// 2300C77E: Register Eq_2 txl_frame_cfm(Register Eq_2 a0, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Register out Eq_2 a4Out, Register out ptr32 a5Out)
// Called from:
//      txl_cfm_flush
//      txl_transmit_trigger
Eq_2 txl_frame_cfm(Eq_2 a0, Eq_2 a4, Eq_2 a5, ptr32 mstatus, union Eq_2 & a4Out, ptr32 & a5Out)
{
	co_list_push_back(a0, a5);
	ptr32 a5_20;
	a4Out = ke_evt_set(0x00020000, a4, mstatus, out a5_20);
	a5Out = a5_20;
	return a0;
}

