pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0000.c
// 2300C79C: Register Eq_2 txl_frame_release(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 a1, Stack word32 dwArg10, Stack word32 dwArg14, Register out Eq_2 s0Out, Register out Eq_2 s1Out, Register out Eq_2 a1Out, Register out Eq_2 a5Out)
// Called from:
//      sta_mgmt_entry_init
//      txl_cntrl_push_int
Eq_2 txl_frame_release(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 a1, word32 dwArg10, word32 dwArg14, union Eq_2 & s0Out, union Eq_2 & s1Out, union Eq_2 & a1Out, union Eq_2 & a5Out)
{
	Eq_2 a5_11 = (word32) *((word32) a0 + 724);
	Eq_2 s1_14 = a1;
	if (a5_11 == 0x00)
	{
		a1 = a0;
		s1_14 = co_list_push_back(a0, a5_11);
	}
	if (s1_14 != 0x00)
	{
		struct Eq_23077 * t1_24 = *((word32) a0 + 0x02CC);
		if (t1_24 != null)
		{
			Eq_2 s0_40;
			Eq_2 s1_41;
			Eq_2 ra_42;
			Eq_2 a5_43;
			Eq_2 a1_45;
			word32 t1_46;
			t1_24();
			s0Out = s0_40;
			s1Out = s1_41;
			a1Out = a1_45;
			a5Out = a5_43;
			return ra_42;
		}
	}
	s0Out = s0;
	s1Out = s1_14;
	a1Out = a1;
	a5Out = a5_11;
	return ra;
}

// 2300C7E0: Register Eq_2 txl_frame_evt(Register Eq_2 ra, Register Eq_2 a1, Register Eq_2 a4, Register ptr32 mstatus, Register out ptr32 s2Out, Register out ptr32 s3Out)
// Called from:
//      txl_cfm_flush
Eq_2 txl_frame_evt(Eq_2 ra, Eq_2 a1, Eq_2 a4, ptr32 mstatus, ptr32 & s2Out, ptr32 & s3Out)
{
	ptr32 s3_16 = 0x42020000;
	Eq_2 a5_20 = ke_evt_clear(0x00020000, a4, mstatus);
	Eq_2 s1_21 = 0x4201FF10;
	ptr32 s2_22 = 0x42020000;
	while (true)
	{
		Eq_2 a1_59;
		__csrrc(mstatus, 0x08);
		struct Eq_34597 * a5_29;
		Eq_2 a0_28 = co_list_pop_front(a4, a5_20, out a5_29);
		__csrrs(mstatus, 0x08);
		Eq_2 s0_30 = a0_28;
		if (a0_28 == 0x00)
			break;
		s1_21 = a5_29->t0050;
		a5_29->t004F = s1_21;
		struct Eq_23077 * a5_42 = *((word32) a0_28 + 0x02CC);
		if (a5_42 != null)
		{
			word32 tp_88;
			a5_42();
			a5_20 = (word32) *((word32) s0_30 + 726);
			a1 = a1_59;
			if (a5_20 != 0x00)
			{
				*((word32) s0_30 + 726) = 0x00;
				a1 = a1_59;
				continue;
			}
		}
		a5_20 = (word32) *((word32) s0_30 + 724);
		if (a5_20 == 0x00)
		{
			a1 = s0_30;
			s1_21 = co_list_push_back(s0_30, a5_20);
		}
	}
	s2Out = s2_22;
	s3Out = s3_16;
	return s1_21;
}

// 2300C85A: Register Eq_2 txl_frame_send_null_frame(Register Eq_2 ra, Register (ptr32 Eq_23076) a0, Register (ptr32 Eq_23077) a1, Register ptr32 fflags, Register ptr32 frm, Register ptr32 mstatus, Stack Eq_2 dwArg48, Stack Eq_2 dwArg78, Stack Eq_2 dwArgAC, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0108, Stack word32 dwArg0198, Register out (ptr32 Eq_23088) s0Out, Register out (ptr32 Eq_23089) s1Out, Register out ptr32 a0Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out (ptr32 Eq_23093) a5Out, Register out (ptr32 Eq_23094) s2Out, Register out Eq_23095 s3Out, Register out Eq_23096 s4Out, Register out (ptr32 Eq_23077) s5Out, Register out ptr32 s6Out, Register out ptr32 s7Out)
// Called from:
//      mm_check_beacon
//      mm_sta_tbtt
//      ps_set_mode
//      ps_enable_cfm
//      ps_disable_cfm
//      ps_traffic_status_update
//      chan_goto_idle_cb
//      chan_tx_cfm
Eq_2 txl_frame_send_null_frame(Eq_2 ra, struct Eq_23076 * a0, struct Eq_23077 * a1, ptr32 fflags, ptr32 frm, ptr32 mstatus, Eq_2 dwArg48, Eq_2 dwArg78, Eq_2 dwArgAC, Eq_2 dwArgC8, Eq_2 dwArgE8, Eq_2 dwArg0108, word32 dwArg0198, struct Eq_23088 & s0Out, struct Eq_23089 & s1Out, ptr32 & a0Out, ptr32 & a3Out, ptr32 & a4Out, struct Eq_23093 & a5Out, struct Eq_23094 & s2Out, union Eq_23095 & s3Out, union Eq_23096 & s4Out, struct Eq_23077 & s5Out, ptr32 & s6Out, ptr32 & s7Out)
{
	ptr32 a0_185;
	ptr32 s6_177 = (word32) a0->b4201EC2A;
	Eq_2 a4_37;
	Eq_2 a5_38;
	phy_get_channel(fp + -56, out a4_37, out a5_38);
	Eq_2 s0_49;
	Eq_2 s4_51;
	word32 a0_55;
	word32 a1_268;
	word32 s5_269;
	word32 s6_270;
	word32 s7_271;
	word32 s8_272;
	word32 s9_273;
	word32 s10_274;
	word32 s11_275;
	struct Eq_23089 * s1_170;
	struct Eq_23093 * a5_166;
	ptr32 a4_165;
	ptr32 a3_164;
	struct Eq_23094 * s2_173;
	Eq_23095 s3_174;
	txl_frame_get(ra, (word32) ((word32) bLoc38 != 0x00), (struct Eq_25902 *) 0x18, a4_37, a5_38, fflags, frm, mstatus, dwArgC8, dwArgE8, dwArg0108, out s0_49, out s1_170, out a0_55, out a1_268, out a3_164, out a4_165, out a5_166, out s2_173, out s3_174, out s4_51, out s5_269, out s6_270, out s7_271, out s8_272, out s9_273, out s10_274, out s11_275);
	struct Eq_23077 * s5_176 = a1;
	if (a0_55 != 0x00)
	{
		word32 a4_276;
		tpc_update_frame_tx_power(ra, s6_177 + 0x42020550, fflags, frm, out a4_276);
		Eq_2 s1_86 = *((word32) s0_49 + 0x0068);
		*((word32) s0_49 + 332) = 0x48;
		*((word32) s0_49 + 333) = 0x01;
		*((word32) s0_49 + 334) = 0x00;
		*((word32) s0_49 + 335) = 0x00;
		word32 a1_277;
		word32 a2_278;
		word32 a3_279;
		word32 a4_280;
		word32 a5_281;
		word32 a6_282;
		word32 a7_283;
		memcpy((word32) s0_49 + 336, &s2_173->b001A + 4, 0x06, out a1_277, out a2_278, out a3_279, out a4_280, out a5_281, out a6_282, out a7_283);
		word32 a1_284;
		word32 a2_285;
		word32 a3_286;
		word32 a4_287;
		word32 a5_288;
		word32 a6_289;
		word32 a7_290;
		memcpy((word32) s0_49 + 342, s6_177 + 0x420205A0, 0x06, out a1_284, out a2_285, out a3_286, out a4_287, out a5_288, out a6_289, out a7_290);
		struct Eq_24474 * a3_133;
		word32 a1_291;
		word32 a2_292;
		word32 a4_293;
		word32 a5_294;
		word32 a6_295;
		word32 a7_296;
		memcpy((word32) s0_49 + 348, &s2_173->b001A + 4, 0x06, out a1_291, out a2_292, out a3_133, out a4_293, out a5_294, out a6_295, out a7_296);
		uint32 a5_147 = (word32) g_w4201FF64 + 0x01 << 16;
		g_w4201FF64 = (word16) (a5_147 >> 16);
		uint32 a5_152 = (word32) (word16) (a5_147 >> 16 << 4);
		*((word32) s0_49 + 354) = (byte) a5_152;
		*((word32) s0_49 + 355) = (byte) (a5_152 >> 8);
		*((word32) s1_86 + 0x02CC) = a1;
		*((word32) s1_86 + 720) = s4_51;
		struct Eq_24700 * a5_158 = (word32) s2_173->b001A;
		*((word32) s1_86 + 48) = (byte) s3_174;
		*((word32) s1_86 + 47) = (byte) a5_158;
		word32 s0_297;
		word32 a0_298;
		word32 a1_299;
		word32 s4_300;
		word32 s9_301;
		word32 s10_302;
		word32 s11_303;
		ra = txl_frame_push(ra, s0_49, 0x03, a3_133, a5_158, mstatus, dwLoc08, dwArg48, dwArg78, dwArgAC, out s0_297, out s1_170, out a0_298, out a1_299, out a3_164, out a4_165, out a5_166, out s2_173, out s3_174, out s4_300, out s5_176, out s6_177, out s7, out s9_301, out s10_302, out s11_303);
		a0_185 = 0x00;
	}
	else
		a0_185 = 0x01;
	0x00 = dwArg0198;
	s0Out = dwArg0158;
	s1Out = s1_170;
	a0Out = a0_185;
	a3Out = a3_164;
	a4Out = a4_165;
	a5Out = a5_166;
	s2Out = s2_173;
	s3Out = s3_174;
	s4Out = dwArgF4;
	s5Out = s5_176;
	s6Out = s6_177;
	s7Out = s7;
	return ra;
}

// 2300C95E: Register Eq_2 txl_frame_send_qosnull_frame(Register Eq_2 s9, Register Eq_2 s10, Register ptr32 fflags, Register ptr32 frm, Register ptr32 mstatus, Stack Eq_2 dwArg78, Stack Eq_2 dwArgAC, Stack Eq_2 dwArg0198, Register out (ptr32 Eq_25621) s0Out, Register out (ptr32 Eq_25622) s1Out, Register out ptr32 a0Out, Register out Eq_25624 a1Out, Register out Eq_25625 a2Out, Register out ptr32 a3Out, Register out ptr32 a5Out, Register out (ptr32 int32) s2Out, Register out (ptr32 Eq_25629) s3Out, Register out (ptr32 Eq_25630) s4Out, Register out Eq_25631 s5Out, Register out ptr32 s6Out, Register out Eq_2 s7Out, Register out (ptr32 Eq_25634) s9Out, Register out (ptr32 Eq_25635) s10Out, Register out Eq_25636 s11Out)
// Called from:
//      ps_uapsd_timer_handle
//      ps_check_beacon
//      rxl_cntrl_evt
//      txu_cntrl_cfm
Eq_2 txl_frame_send_qosnull_frame(Eq_2 s9, Eq_2 s10, ptr32 fflags, ptr32 frm, ptr32 mstatus, Eq_2 dwArg78, Eq_2 dwArgAC, Eq_2 dwArg0198, struct Eq_25621 & s0Out, struct Eq_25622 & s1Out, ptr32 & a0Out, union Eq_25624 & a1Out, union Eq_25625 & a2Out, ptr32 & a3Out, ptr32 & a5Out, int32 & s2Out, struct Eq_25629 & s3Out, struct Eq_25630 & s4Out, union Eq_25631 & s5Out, ptr32 & s6Out, union Eq_2 & s7Out, struct Eq_25634 & s9Out, struct Eq_25635 & s10Out, union Eq_22449 & s11Out)
{
	ptr32 a0_211;
	word32 a4_334;
	word32 a5_335;
	phy_get_channel(fp + -56, out a4_334, out a5_335);
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	// Failed to bind call argument.
	// Please report this issue at https://github.com/uxmal/reko
	Eq_2 stackArg264 = <invalid>;
	Eq_2 stackArg296 = <invalid>;
	Eq_2 stackArg328 = <invalid>;
	word32 a0_52;
	ptr32 s4_53;
	struct Eq_23077 * s8_58;
	Eq_2 s0_60;
	word32 a4_341;
	Eq_25624 a1_188;
	ptr32 a3_190;
	ptr32 a5_192;
	struct Eq_25622 * s1_196;
	struct Eq_25635 * s10_197;
	Eq_25636 s11_198;
	int32 * s2_199;
	struct Eq_25629 * s3_200;
	Eq_25631 s5_202;
	ptr32 s6_203;
	Eq_2 s7_204;
	struct Eq_25634 * s9_206;
	Eq_2 ra_194 = txl_frame_get(ra, (word32) ((word32) (byte) s10 != 0x00), (struct Eq_25902 *) 0x1A, a4, a5, fflags, frm, mstatus, stackArg264, stackArg296, stackArg328, out s0_60, out s1_196, out a0_52, out a1_188, out a3_190, out a4_341, out a5_192, out s2_199, out s3_200, out s4_53, out s5_202, out s6_203, out s7_204, out s8_58, out s9_206, out s10_197, out s11_198);
	if (a0_52 != 0x00)
	{
		Eq_2 a1_140;
		word32 a4_342;
		tpc_update_frame_tx_power(ra_194, (char *) &s3_200->ptr0120 + 0x42020430, fflags, frm, out a4_342);
		Eq_2 s1_96 = *((word32) s0_60 + 0x0068);
		*((word32) s0_60 + 332) = 200;
		*((word32) s0_60 + 333) = 0x00;
		*((word32) s0_60 + 334) = 0x00;
		*((word32) s0_60 + 335) = 0x00;
		word32 a3_345;
		word32 a2_344;
		word32 a1_343;
		word32 a4_346;
		word32 a5_347;
		word32 a6_348;
		word32 a7_349;
		memcpy((word32) s0_60 + 336, (char *) s2_199 + 30, 0x06, out a1_343, out a2_344, out a3_345, out a4_346, out a5_347, out a6_348, out a7_349);
		word32 a1_350;
		word32 a2_351;
		word32 a3_352;
		word32 a4_353;
		word32 a5_354;
		word32 a6_355;
		word32 a7_356;
		memcpy((word32) s0_60 + 342, (char *) &s3_200->ptr0120 + 0x42020480, 0x06, out a1_350, out a2_351, out a3_352, out a4_353, out a5_354, out a6_355, out a7_356);
		word32 a5_134 = (word32) s3_200->b420205A6;
		*((word32) s0_60 + 332) = 200;
		if (a5_134 == 0x00)
		{
			*((word32) s0_60 + 333) = 0x01;
			a1_140 = (char *) s2_199 + 30;
		}
		else
		{
			*((word32) s0_60 + 333) = 0x02;
			a1_140 = (char *) &s3_200->ptr0120 + 0x42020480;
		}
		struct Eq_24474 * a3_153;
		word32 a1_357;
		word32 a2_358;
		word32 a4_359;
		word32 a5_360;
		word32 a6_361;
		word32 a7_362;
		memcpy((word32) s0_60 + 348, a1_140, 0x06, out a1_357, out a2_358, out a3_153, out a4_359, out a5_360, out a6_361, out a7_362);
		*((word32) s0_60 + 356) = (byte) s5_202;
		*((word32) s0_60 + 354) = 0x00;
		*((word32) s0_60 + 355) = 0x00;
		*((word32) s0_60 + 357) = (byte) (s5_202 >> 0x08);
		*((word32) s1_96 + 0x02CC) = s8_58;
		*((word32) s1_96 + 720) = s7_204;
		struct Eq_24700 * a5_180 = (word32) (s4_53 + -1440 + (s6_203 + 432))->b001A;
		*((word32) s1_96 + 48) = (byte) s6_203;
		*((word32) s1_96 + 47) = (byte) a5_180;
		word32 s0_363;
		word32 a0_364;
		word32 a4_365;
		word32 s4_366;
		ra_194 = txl_frame_push(ra_194, s0_60, 0x03, a3_153, a5_180, mstatus, dwLoc08, s9, dwArg78, dwArgAC, out s0_363, out s1_196, out a0_364, out a1_188, out a3_190, out a4_365, out a5_192, out s2_199, out s3_200, out s4_366, out s5_202, out s6_203, out s7_204, out s9_206, out s10_197, out s11_198);
		a0_211 = 0x00;
	}
	else
		a0_211 = 0x01;
	0x00 = (int8) dwArg0198;
	s0Out = dwArg0158;
	s1Out = s1_196;
	a0Out = a0_211;
	a1Out = a1_188;
	a2Out = dwArg0138;
	a3Out = a3_190;
	a5Out = a5_192;
	s2Out = s2_199;
	s3Out = s3_200;
	s4Out = dwLoc14;
	s5Out = s5_202;
	s6Out = s6_203;
	s7Out = s7_204;
	s9Out = s9_206;
	s10Out = s10_197;
	s11Out = s11_198;
	return ra_194;
}

// 2300CA86: Register Eq_2 txl_frame_send_eapol_frame(Register Eq_2 ra, Register (ptr32 Eq_35115) a0, Register (ptr32 Eq_23077) a1, Register Eq_2 a4, Register ptr32 fflags, Register ptr32 frm, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArg48, Stack Eq_2 dwArg74, Stack Eq_2 dwArg7C, Stack Eq_2 dwArg98, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgD8, Register out ptr32 a0Out, Register out ptr32 s10Out)
// Called from:
//      UpdateEAPOLWcbLenAndTransmit
Eq_2 txl_frame_send_eapol_frame(Eq_2 ra, struct Eq_35115 * a0, struct Eq_23077 * a1, Eq_2 a4, ptr32 fflags, ptr32 frm, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArg48, Eq_2 dwArg74, Eq_2 dwArg7C, Eq_2 dwArg98, Eq_2 dwArgB8, Eq_2 dwArgD8, ptr32 & a0Out, ptr32 & s10Out)
{
	struct Eq_35130 * s11_47 = (word32) a0->b4201EC2A;
	Eq_2 a4_49;
	Eq_2 a5_50;
	phy_get_channel((word32) fp - 88, out a4_49, out a5_50);
	struct Eq_35144 * s1_62;
	struct Eq_35145 * s4_63;
	struct Eq_35146 * a0_67;
	word32 s3_72;
	word32 s9_1054;
	word32 s10_1055;
	word32 s11_1056;
	word32 a1_1045;
	word32 a3_1046;
	word32 s6_1051;
	word32 s7_1052;
	word32 s8_1053;
	word32 a5_1048;
	word32 s5_1050;
	word32 s2_1049;
	word32 s0_1044;
	word32 a4_1047;
	txl_frame_get(ra, (word32) ((word32) bLoc58 != 0x00), (struct Eq_25902 *) 0x0100, a4_49, a5_50, fflags, frm, mstatus, dwArg98, dwArgB8, dwArgD8, out s0_1044, out s1_62, out a0_67, out a1_1045, out a3_1046, out a4_1047, out a5_1048, out s2_1049, out s3_72, out s4_63, out s5_1050, out s6_1051, out s7_1052, out s8_1053, out s9_1054, out s10_1055, out s11_1056);
	struct Eq_23077 * s7_37 = a1;
	if (a0_67 == null)
	{
l2300CE3A:
		a0Out = 0x00;
		s10Out = s10;
		return dwLoc24;
	}
	Eq_35192 s5_146;
	struct Eq_35193 * s2_135;
	a0_67->b002F = (byte) s11_47;
	a0_67->b0030 = (byte) a0;
	a0_67->b002E = 0x00;
	word32 a4_81 = (word32) s4_63->w00F8;
	s4_63->w00F8 = (word16) (word32) (word12) (a4_81 + 1);
	a0_67->w0020 = ~0x0177;
	a0_67->w002A = (word16) a4_81;
	struct Eq_35227 * s9_93 = (char *) s1_62 + 30 + (s3_72 + -1440);
	a0_67->w0014 = (word16) (word32) s9_93->w0000;
	a0_67->w0016 = (word16) (word32) s9_93->w0002;
	a0_67->w0018 = (word16) (word32) s9_93->w0004;
	a0_67->w001A = (word16) (word32) s11_47->w420205A0;
	a0_67->w001C = (word16) (word32) s11_47->w420205A2;
	a0_67->w001E = (word16) (word32) s11_47->w420205A4;
	word32 a4_1057;
	tpc_update_frame_tx_power(ra, (char *) s11_47 + 0x42020550, fflags, frm, out a4_1057);
	Eq_2 s0_127 = s1_62->t0068;
	if ((s11_47->dw42020930 & 0x01) != 0x00)
	{
		s1_62->b014C = 0x88;
		s1_62->b014D = 0x00;
		uint32 a4_155 = (word32) *((word32) s0_127 + 42) << 20 >> 16;
		s1_62->b0162 = (byte) a4_155;
		s1_62->b0163 = (byte) (a4_155 >> 8);
		word32 a4_159 = (word32) *((word32) s0_127 + 46);
		s1_62->b0165 = 0x00;
		s1_62->b0164 = (byte) a4_159;
		s2_135 = (struct Eq_35193 *) (&s1_62->b0165 + 1);
		s5_146 = (word32) a4 + 0x0022;
	}
	else
	{
		s1_62->b014C = 0x08;
		word32 a4_133 = (word32) g_w4201FF64;
		s1_62->b014D = 0x00;
		uint32 a4_137 = a4_133 + 0x01 << 16;
		g_w4201FF64 = (word16) (a4_137 >> 16);
		uint32 a4_142 = (word32) (word16) (a4_137 >> 16 << 4);
		s1_62->b0162 = (byte) a4_142;
		s1_62->b0163 = (byte) (a4_142 >> 8);
		s2_135 = (struct Eq_35193 *) &s1_62->b0164;
		s5_146 = (word32) a4 + 32;
	}
	if (s5_146 > 0x0100)
		assert_err();
	ui32 a4_175 = (word32) s1_62->b014D << 8 | (word32) s1_62->b014C;
	Eq_2 a1_173 = 0x02;
	uint32 a2_182 = a4_175 | 0x0100;
	if ((word32) s11_47->b420205A6 == 0x02)
		a2_182 = a4_175 | 0x0200;
	word32 a5_218;
	s1_62->b014C = (byte) a2_182;
	s1_62->b014D = (byte) (a2_182 >> 8);
	s1_62->b014E = 0x00;
	s1_62->b014F = 0x00;
	s1_62->w0150 = (word16) (word32) s9_93->w0000;
	s1_62->w0152 = (word16) (word32) s9_93->w0002;
	s1_62->w0154 = (word16) (word32) s9_93->w0004;
	s1_62->w0156 = (word16) (word32) s11_47->w420205A0;
	s1_62->w0158 = (word16) (word32) s11_47->w420205A2;
	s1_62->w015A = (word16) (word32) s11_47->w420205A4;
	if ((word32) s11_47->b420205A6 == 0x02)
	{
		s1_62->w015C = (word16) (word32) s11_47->w420205A0;
		s1_62->w015E = (word16) (word32) s11_47->w420205A2;
		a5_218 = (word32) s11_47->w420205A4;
	}
	else
	{
		s1_62->w015C = (word16) (word32) s9_93->w0000;
		s1_62->w015E = (word16) (word32) s9_93->w0002;
		a5_218 = (word32) s9_93->w0004;
	}
	s1_62->w0160 = (word16) a5_218;
	up32 s11_232 = 0x00;
	if ((word32) (&g_b420205A6)[(word32) *((word32) s0_127 + 47)] != 0x00)
	{
l2300CD74:
		s2_135->w0000 = ~0x0555;
		s2_135->w0002 = 0x03;
		s2_135->w0004 = 0x00;
		s2_135->w0006 = (word16) (word32) *((word32) s0_127 + 32);
		struct Eq_35544 * a1_492;
		word32 a2_1058;
		word32 a6_1059;
		word32 a7_1060;
		struct Eq_35548 * a4_489;
		struct Eq_35549 * a5_490;
		struct Eq_24474 * a3_494;
		memcpy(&s2_135->w0006 + 1, a1_173, a4, out a1_492, out a2_1058, out a3_494, out a4_489, out a5_490, out a6_1059, out a7_1060);
		if (s11_232 != 0x00)
		{
			a5_490 = (struct Eq_35549 *) 0x01;
			a4_489 = (word32) a1_492->b0060;
			if (a4_489 == (struct Eq_35548 *) 0x01)
			{
				int32 s8_537;
				word32 s3_1081;
				word32 s4_1082;
				word32 s2_1080;
				word32 s1_1079;
				me_mic_init((word32) fp - 80, (word32) s0_127 + 20, (word32) s0_127 + 26, (word32) *((word32) s0_127 + 46), out s1_1079, out s2_1080, out s3_1081, out s4_1082, out s8_537);
				Eq_2 s1_551;
				word32 s6_557;
				word32 s8_559;
				word32 a2_1084;
				word32 a3_1085;
				word32 s2_1086;
				word32 s4_1088;
				word32 s9_1089;
				word32 s10_1090;
				word32 s3_1087;
				word32 a1_1083;
				me_mic_calc((word32) fp - 80, s8_537, (word32) a4 + 8, dwLoc54, dwArgB8, out s1_551, out a1_1083, out a2_1084, out a3_1085, out s2_1086, out s3_1087, out s4_1088, out s5_146, out s6_557, out s7_37, out s8_559, out s9_1089, out s10_1090);
				word32 a4_1093;
				word32 a5_1094;
				word32 a3_1092;
				word32 a2_1091;
				me_mic_end(s1_551, (word32) fp - 80, out a2_1091, out a3_1092, out a4_1093, out a5_1094);
				word32 s1_571 = s6_557 + s8_559;
				a5_490 = null;
				a4_489 = (struct Eq_35548 *) 0x08;
				do
				{
					a3_494 = (struct Eq_24474 *) (a5_490 + s1_571);
					a3_494->b0000 = (byte) (word32) a5_490[(word32) fp - 80];
					++a5_490;
				} while (a5_490 != (struct Eq_35549 *) 0x08);
			}
		}
		Eq_2 s0_587 = a4_489->t006C;
		struct Eq_35876 * a4_589 = a5_490[20];
		word32 a5_598 = a5_490 + ~0x00 + s5_146;
		*((word32) a5_598 + 24) = a4_589;
		a4_589->t001C = (word32) s5_146 + 4;
		if (s7_37 != null)
		{
			*((word32) dwArg74 + 0x02CC) = s7_37;
			*((word32) dwArg74 + 720) = a5_598;
			s0_587 = dwArg74;
		}
		struct Eq_36020 * a4_621 = (word32) *((word32) s0_587 + 46);
		word32 a3_1099;
		word32 a4_1100;
		word32 a5_1101;
		word32 s3_1103;
		word32 s9_1108;
		word32 s11_1109;
		word32 s4_1104;
		word32 s5_1105;
		word32 s7_1107;
		word32 s6_1106;
		word32 s2_1102;
		word32 s1_1096;
		word32 a0_1097;
		word32 a1_1098;
		word32 s0_1095;
		txl_frame_push(ra, s0_587, (word32) a4_621->b230AD230, a3_494, &a4_621->b230AD230, mstatus, dwLoc38, dwArg18, dwArg48, dwArg7C, out s0_1095, out s1_1096, out a0_1097, out a1_1098, out a3_1099, out a4_1100, out a5_1101, out s2_1102, out s3_1103, out s4_1104, out s5_1105, out s6_1106, out s7_1107, out s9_1108, out s10, out s11_1109);
		goto l2300CE3A;
	}
	struct Eq_35565 * a4_245 = (word32) ((word32) *((word32) s0_127 + 48) + 432 + (s3_72 + -1440))->b0031;
	if (a4_245 != (struct Eq_35565 *) 0x02)
		goto l2300CD74;
	word32 a5_275;
	word32 s11_300;
	struct Eq_35565 * a5_251 = (word32) *(byte *) 0x62;
	if (a5_251 != (struct Eq_35565 *) 0x01)
	{
		if (a5_251 == null)
		{
l2300CCAE:
			Eq_2 a1_308 = *(union Eq_2 *) 77;
			((Eq_2[]) 77)[(word32) ((char *) a5_251 + 1 < a5_251) / 4] = a1_308;
			a5_251->t0049 = a1_308;
			word32 a4_1069;
			word32 a5_1070;
			word32 a6_1071;
			word32 a7_1072;
			word32 a2_1067;
			word32 a3_1068;
			memcpy((word32) s0_127 + 0x0022, (word32) a1_308 + 72, 0x04, out a1_173, out a2_1067, out a3_1068, out a4_1069, out a5_1070, out a6_1071, out a7_1072);
			a5_275 = 0x04;
			s11_300 = 0x04;
			goto l2300CCD2;
		}
		if (a5_251 != a4_245)
		{
			if (a5_251 == (struct Eq_35565 *) 0x03)
				goto l2300CCAE;
			a5_275 = 0x00;
			s11_300 = 0x00;
l2300CCD2:
			s11_232 = s11_300 + a5_275;
			if (s11_232 != 0x00)
			{
				ui32 a5_351 = (word32) s1_62->b014D << 8 | (word32) s1_62->b014C;
				s1_62->b014C = (byte) (a5_351 | 0x04000000);
				s1_62->b014D = (byte) ((a5_351 | 0x04000000) >> 8);
				s5_146 = (word32) s5_146 + s11_232;
				int32 a4_366 = (word32) (&g_b420205A6)[(word32) *((word32) s0_127 + 47)];
				if (a4_366 != 0x00)
				{
					a4_366 = 0x00;
					goto l2300CD70;
				}
				struct Eq_35736 * a2_376 = (word32) ((word32) *((word32) s0_127 + 48) + 432 + (s3_72 + -1440))->b0031;
				if (a2_376 != (struct Eq_35736 *) 0x02)
				{
l2300CD70:
					s2_135 += a4_366 / 8;
					goto l2300CD74;
				}
				ui32 a5_404;
				s0_127 = *((word32) *(union Eq_2 *) 0x02 + 0x006C);
				struct Eq_35736 * a5_384 = (word32) *(byte *) 0x62;
				if (a5_384 != (struct Eq_35736 *) 0x01)
				{
					if (a5_384 == null)
					{
l2300CD42:
						s2_135->w0000 = (word16) (word32) *((word32) s0_127 + 0x0022);
						a5_384 = (word32) *(union Eq_2 *) 99 << 0x0E | (word32) (*((word32) s0_127 + 36));
						s2_135->w0002 = (word16) a5_384;
						a4_366 = 0x04;
						goto l2300CD5C;
					}
					if (a5_384 != a2_376)
					{
						if (a5_384 == (struct Eq_35736 *) 0x03)
							goto l2300CD42;
						goto l2300CD5C;
					}
					s2_135->w0000 = (word16) (word32) *((word32) s0_127 + 0x0022);
					a5_404 = (word32) *(union Eq_2 *) 99 << 0x0E | 0x02000000;
				}
				else
				{
					uint32 a2_385 = (word32) *((word32) s0_127 + 0x0022);
					s2_135->w0000 = (word16) ((a2_385 | 0x02000000) & 0x07FFFF00 | a2_385 >> 8);
					a5_404 = (word32) *((word32) s0_127 + 0x0022) | (word32) (*((union Eq_2 *) 99)) << 0x0E | 0x02000000;
				}
				s2_135->w0002 = (word16) a5_404;
				s2_135->w0004 = (word16) (word32) *((word32) s0_127 + 36);
				a5_384 = (word32) *((word32) s0_127 + 38);
				s2_135->w0006 = (word16) a5_384;
				a4_366 = 0x08;
l2300CD5C:
				a1_173 = a5_384->t000C;
				(a5_384 & 0x000FFC00 | (word32) (*((union Eq_2 *) 100)))->t000C = a1_173;
				goto l2300CD70;
			}
			goto l2300CD74;
		}
		Eq_2 a1_277 = *(union Eq_2 *) 77;
		((Eq_2[]) 77)[(word32) ((char *) a5_251 + 1 < a5_251) / 4] = a1_277;
		a5_251->t0049 = a1_277;
		word32 a2_1073;
		word32 a7_1078;
		word32 a3_1074;
		word32 a4_1075;
		word32 a6_1077;
		word32 a5_1076;
		memcpy((word32) s0_127 + 0x0022, (word32) a1_277 + 72, 0x06, out a1_173, out a2_1073, out a3_1074, out a4_1075, out a5_1076, out a6_1077, out a7_1078);
		a5_275 = 0x08;
	}
	else
	{
		Eq_2 a1_253 = *(union Eq_2 *) 77;
		((Eq_2[]) 77)[(word32) ((char *) a5_251 + 1 < a5_251) / 4] = a1_253;
		a5_251->t0049 = a1_253;
		word32 a7_1066;
		word32 a4_1063;
		word32 a6_1065;
		word32 a5_1064;
		word32 a3_1062;
		word32 a2_1061;
		memcpy((word32) s0_127 + 0x0022, (word32) a1_253 + 72, 0x06, out a1_173, out a2_1061, out a3_1062, out a4_1063, out a5_1064, out a6_1065, out a7_1066);
		a5_275 = 0x0C;
	}
	s11_300 = 0x08;
	goto l2300CCD2;
}

// 2300CF54: Register Eq_2 txl_frame_dump(Register Eq_2 a5)
// Called from:
//      bl60x_fw_dump_statistic
Eq_2 txl_frame_dump(Eq_2 a5)
{
	Eq_2 a5_12;
	if (co_list_cnt(a5, out a5_12) != null)
	{
		struct Eq_36092 * a4_13;
		for (a4_13 = g_ptr4201FF68; a4_13 != null; a4_13 = a4_13->ptr0000)
			;
		a5_12 = g_t4201FF70;
		while (a5_12 != 0x00)
			a5_12 = *a5_12;
	}
	return a5_12;
}

// 2300CF88: void txl_hwdesc_init()
// Called from:
//      txl_cntrl_init
void txl_hwdesc_init()
{
}

