pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0000.c
// 2300CF8A: void txl_hwdesc_reset()
// Called from:
//      txl_reset
void txl_hwdesc_reset()
{
}

// 2300CF8C: Register Eq_2 vif_mgmt_bcn_to_evt(Register Eq_2 ra, Register Eq_2 a3, Register (ptr32 Eq_36109) a5, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg88, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0158, Register out ptr32 s0Out, Register out ptr32 a1Out, Register out ptr32 a2Out, Register out Eq_2 a3Out, Register out ptr32 a4Out, Register out (ptr32 Eq_36109) a5Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 s7Out, Register out ptr32 s9Out, Register out ptr32 s10Out)
// Called from:
//      vif_mgmt_bcn_recv
Eq_2 vif_mgmt_bcn_to_evt(Eq_2 ra, Eq_2 a3, struct Eq_36109 * a5, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg88, Eq_2 dwArgF8, Eq_2 dwArg0158, ptr32 & s0Out, ptr32 & a1Out, ptr32 & a2Out, union Eq_2 & a3Out, ptr32 & a4Out, struct Eq_36109 & a5Out, ptr32 & s3Out, ptr32 & s4Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & s7Out, ptr32 & s9Out, ptr32 & s10Out)
{
	struct Eq_36130 * a0_5 = a5->ptr0040;
	if (a5 == null)
	{
		s0Out = s0;
		a1Out = a1;
		a2Out = a2;
		a3Out = a3;
		a4Out = a4;
		a5Out = a5;
		s3Out = s3;
		s4Out = s4;
		s5Out = s5;
		s6Out = s6;
		s7Out = s7;
		s9Out = s9;
		s10Out = s10;
		return ra;
	}
	else
	{
		ptr32 a2_10;
		ptr32 a4_11;
		struct Eq_36109 * a5_12;
		ptr32 s0_14;
		ptr32 s4_16;
		ptr32 a1_20;
		Eq_2 a3_24;
		ptr32 s10_26;
		ptr32 s5_28;
		ptr32 s6_29;
		ptr32 s7_30;
		ptr32 s9_31;
		Eq_2 ra_25 = chan_bcn_to_evt(ra, a0_5, a3, s2, mstatus, dwArg08, dwArg18, dwArg88, dwArgF8, dwArg0158, out s0_14, out a1_20, out a2_10, out a3_24, out a4_11, out a5_12, out s4_16, out s5_28, out s6_29, out s7_30, out s9_31, out s10_26);
		s0Out = s0_14;
		a1Out = a1_20;
		a2Out = a2_10;
		a3Out = a3_24;
		a4Out = a4_11;
		a5Out = a5_12;
		s3Out = s3_22;
		s4Out = s4_16;
		s5Out = s5_28;
		s6Out = s6_29;
		s7Out = s7_30;
		s9Out = s9_31;
		s10Out = s10_26;
		return ra_25;
	}
}

// 2300CF96: Register Eq_2 vif_mgmt_init(Register Eq_2 ra, Register out ptr32 a4Out, Register out ptr32 s2Out)
// Called from:
//      mm_init
Eq_2 vif_mgmt_init(Eq_2 ra, ptr32 & a4Out, ptr32 & s2Out)
{
	word32 t1_108;
	word32 a0_109;
	word32 a1_110;
	word32 a2_111;
	word32 a3_112;
	word32 a4_113;
	word32 a5_114;
	Eq_2 ra_28 = memset(ra, 0x42020B28, 0x00, 0x14, out t1_108, out a0_109, out a1_110, out a2_111, out a3_112, out a4_113, out a5_114);
	co_list_init(&g_dw42020B28);
	co_list_init(&g_t42020B30);
	Eq_2 a5_43;
	word32 t1_115;
	word32 a0_116;
	word32 a1_117;
	word32 a2_118;
	word32 a3_119;
	word32 a4_120;
	Eq_2 ra_44 = memset(ra_28, 1107427192, 0x00, 0x05D8, out t1_115, out a0_116, out a1_117, out a2_118, out a3_119, out a4_120, out a5_43);
	g_b4201FFCE = 0x04;
	g_b4201FFD1 = 0x7F;
	g_b4201FFD2 = 0x7F;
	g_dw4201FFA4 = 0x2300CF8C;
	g_dw4201FFA8 = 1107427192;
	co_list_push_back(1107427192, a5_43);
	ptr32 a4_70;
	word32 t1_121;
	word32 a0_122;
	word32 a1_123;
	word32 a2_124;
	word32 a3_125;
	word32 a5_126;
	Eq_2 ra_72 = memset(ra_44, 0x42020550, 0x00, 0x05D8, out t1_121, out a0_122, out a1_123, out a2_124, out a3_125, out a4_70, out a5_126);
	g_b420205A6 = 0x04;
	g_b420205A9 = 0x7F;
	g_b420205AA = 0x7F;
	g_dw4202057C = 0x2300CF8C;
	g_dw42020580 = 0x42020550;
	co_list_push_back(0x42020550, 0x42020550);
	a4Out = a4_70;
	s2Out = 0x2300CF8C;
	return ra_72;
}

struct Eq_36656 * g_ptr2300CFB8 = &g_t70EFB284;
// 2300D052: Register Eq_2 vif_mgmt_register(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register ptr32 a1, Register ui32 a2, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg8C, Register out ptr32 s2Out)
// Called from:
//      mm_hw_config_handler
Eq_2 vif_mgmt_register(Eq_2 ra, Eq_2 s1, Eq_2 a0, ptr32 a1, ui32 a2, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg8C, ptr32 & s2Out)
{
	Eq_2 a0_18;
	if (g_dw42020B28 == 0x00)
	{
		a0_18.u0 = 0x01;
		goto l2300D112;
	}
	Eq_2 a4_54;
	Eq_2 a5_55;
	Eq_2 a5_20 = g_t42020B30;
	s2 = a1;
	if (a5_20 == 0x00)
		a4_54 = mm_hw_info_set(a0, a5_20, out a5_55);
	else
	{
		struct Eq_36327 * a4_36 = (word32) *((word32) a0 + 1) << 8 | (word32) (*a0) | (word32) (*((word32) a0 + 2)) << 16;
		a0_18.u0 = 0x01;
		if (((word32) *((word32) a0 + 3) << 24 | a4_36) != a2)
			goto l2300D112;
		Eq_23102 a3_44 = a4_36->t001C;
		struct Eq_36439 * a5_49 = (((word32) *((word32) a0 + 5) << 8 | (word32) (*((word32) a0 + 4))) ^ a2) & ~a4_36;
		if (a5_49 != null)
		{
l2300D112:
			s2Out = s2;
			return a0_18;
		}
		union Eq_2 * a4_51 = a5_49->ptr0004;
		(a5_49 | 16)->ptr0004 = a4_51;
		a4_54 = *a4_51;
		a5_55 = a5_49 | 16 | a4_54;
		*((word32) a5_55 + 96) = a3_44;
	}
	word32 a5_303;
	Eq_2 a0_66 = co_list_pop_front(a4_54, a5_55, out a5_303);
	*((word32) a0_66 + 86) = (byte) a1;
	word32 a1_304;
	word32 a2_305;
	word32 a3_306;
	word32 a4_307;
	word32 a5_308;
	word32 a6_309;
	word32 a7_310;
	memcpy((word32) a0_66 + 80, a0, 0x06, out a1_304, out a2_305, out a3_306, out a4_307, out a5_308, out a6_309, out a7_310);
	*(union Eq_2 *) 0x00FFFA4F = a0_66;
	*(union Eq_2 *) 0x0005E442 = a0_66;
	ui32 a5_104 = (a0_66 - &g_t4201FF78 >> 3) + 0xA18A4473 & 0x00FF;
	*((word32) a0_66 + 87) = (byte) a5_104;
	*(union Eq_2 *) 0x00FFFA4F = a0_66;
	*(union Eq_2 *) 193334 = a0_66;
	((word32) a0_66 + 64)->u0 = 0x00;
	*((word32) a0_66 + 76) = (byte) a5_104;
	Eq_2 a3_142 = 16775751;
	if (a1 != 0x00)
	{
		if (a1 == 0x02)
		{
			Eq_2 a5_123 = (word32) g_b42020B39;
			if (a5_123 == 0x00)
				mm_hw_ap_info_set((struct Eq_21468 *) 16775751, a5_123);
			g_b42020B39 = (byte) ((word32) g_b42020B39 + 0x01);
			ra = mm_bcn_init_vif(ra, a0_66, dwArg18, out a3_142);
		}
	}
	else
	{
		word32 a5_111 = (word32) g_b42020B38;
		*((word32) a0_66 + 32) = a0_66;
		*((word32) a0_66 + 121) = 0x00;
		g_b42020B38 = (byte) (a5_111 + 0x01);
		g_t23008B90 = a0_66;
		*((word32) a0_66 + 96) = ~0x00;
		*((word32) a0_66 + 122) = 0x00;
	}
	byte * s3_180;
	Eq_2 s0_175 = td_start(ra, (word32) *((word32) a0_66 + 87), a3_142, mstatus, dwLoc08, dwArg40, dwArg44, s1, dwArg8C, out s2, out s3_180);
	Eq_2 a5_190 = (word32) *((word32) s0_175 + 87);
	*s3_180 = (byte) a5_190;
	co_list_push_back(s0_175, a5_190);
	a0_18.u0 = 0x00;
	goto l2300D112;
}

// 2300D1C2: Register Eq_2 vif_mgmt_unregister(Register Eq_2 ra, Register Eq_2 s1, Register (ptr32 Eq_36534) a0, Register Eq_2 a3, Register Eq_2 a4, Register Eq_2 a5, Register ptr32 mstatus, Stack Eq_2 dwArg18, Stack Eq_2 dwArg40, Stack Eq_2 dwArg44, Stack Eq_2 dwArg78, Stack Eq_2 dwArg8C, Register out (ptr32 Eq_36544) a4Out, Register out ptr32 s3Out)
// Called from:
//      mm_hw_config_handler
Eq_2 vif_mgmt_unregister(Eq_2 ra, Eq_2 s1, struct Eq_36534 * a0, Eq_2 a3, Eq_2 a4, Eq_2 a5, ptr32 mstatus, Eq_2 dwArg18, Eq_2 dwArg40, Eq_2 dwArg44, Eq_2 dwArg78, Eq_2 dwArg8C, struct Eq_36544 & a4Out, ptr32 & s3Out)
{
	word32 s2_102 = (char *) a0 + 0x05D8;
	struct Eq_36534 * s5_120 = a0;
	word32 a5_249;
	word32 a5_34 = (word32) co_list_extract(0x42020B30, (char *) a0 + 0x42020550, a4, a5, out a5_249)->b0056;
	word32 s0_106 = 1107427192;
	if (a5_34 != 0x00)
	{
		if (a5_34 == 0x02)
		{
			Eq_2 a5_44 = (word32) g_b42020B39 + ~0x00 & 0x00FF;
			g_b42020B39 = (byte) a5_44;
			if (a5_44 == 0x00)
				a3 = mm_hw_ap_info_reset(a5_44);
		}
	}
	else
		g_b42020B38 = (byte) ((word32) g_b42020B38 + ~0x00);
	Eq_36589 a5_55 = g_b42020B39 + g_b42020B38;
	if (a5_55 == 0x01)
	{
		ui32 * a4_58 = *((word32) a5_55 + 4);
		(a5_55 & ~0x10)->ptr0004 = a4_58;
		struct Eq_36613 * a5_63 = a5_55 & ~0x10 | *a4_58;
		a5_63->dw0060 = 0x44B00000;
		a3 = a5_63->t0038;
		a5_63->dw0020 = 0x44B00000;
		((word32[]) 36)[(word32) *((word32) a3 + 60) / 4] = 0x44B00000;
	}
	Eq_2 a4_108 = (word32) a0->b420205A6;
	if (a4_108 == 0x02)
		ra = txl_cntrl_clear_bcn_ac(mstatus, dwArg78, out s0_106, out a4_108, out s2_102, out s5_120);
	word32 a2_250;
	word32 a5_251;
	mm_timer_clear(s2_102 + 24 + s0_106, a4_108, out a2_250, out a5_251);
	word32 a5_253;
	word32 a2_252;
	mm_timer_clear(s2_102 + 40 + s0_106, a4_108, out a2_252, out a5_253);
	struct Eq_36656 * s0_122 = (char *) s5_120 + 0x05D8 + s0_106;
	Eq_2 s1_141;
	ptr32 s3_145;
	struct Eq_36544 * a4_164;
	word32 a2_259;
	word32 a3_260;
	word32 a5_261;
	word32 t1_256;
	word32 a0_257;
	word32 a1_258;
	word32 a3_254;
	word32 s4_255;
	Eq_2 ra_166 = memset(td_reset(ra, a3, dwLoc08, dwArg18, dwArg40, dwArg44, s1, dwArg8C, out s1_141, out a3_254, out s3_145, out s4_255), s1_141, 0x00, 0x05D8, out t1_256, out a0_257, out a1_258, out a2_259, out a3_260, out a4_164, out a5_261);
	s0_122->b0056 = 0x04;
	s0_122->b0059 = 0x7F;
	s0_122->b005A = 0x7F;
	g_ptr2300CFB8 = s0_122;
	*((word32) s1_141 + 48) = s0_122;
	co_list_push_back(s1_141, 0x2300CF8C);
	a4Out = a4_164;
	s3Out = s3_145;
	return ra_166;
}

// 2300D2E6: Register Eq_2 vif_mgmt_add_key(Register Eq_2 ra, Register (ptr32 Eq_21047) a0, Register ui32 a1, Register out ptr32 s0Out, Register out ptr32 s1Out, Register out (ptr32 Eq_21098) s3Out)
// Called from:
//      mm_sec_machwkey_wr
Eq_2 vif_mgmt_add_key(Eq_2 ra, struct Eq_21047 * a0, ui32 a1, ptr32 & s0Out, ptr32 & s1Out, struct Eq_21098 & s3Out)
{
	struct Eq_21098 * s3_19 = (word32) a0->b0029;
	word32 s1_20 = (word32) a0->b0000;
	struct Eq_36730 * a3_28 = (char *) s3_19 + 0x05D8 + (s1_20 + 0x0068);
	a3_28->b420203FA = (byte) a1;
	a3_28->b420203F8 = (byte) (word32) a0->b0028;
	a3_28->b420203F9 = (byte) (word32) a0->b0000;
	word32 t1_161;
	word32 a0_162;
	word32 a1_163;
	word32 a2_164;
	word32 a3_165;
	word32 a4_166;
	word32 a5_167;
	Eq_2 ra_47 = memset(ra, (char *) a3_28 + 0x42020398, 0x00, 72, out t1_161, out a0_162, out a1_163, out a2_164, out a3_165, out a4_166, out a5_167);
	word32 a4_50 = (word32) a3_28->b420203F8;
	word32 * a3_51 = (word32 *) 0x01;
	if (a4_50 == 0x01)
	{
		a3_28->dw420203E0 = 0x00;
		a3_28->dw420203E4 = 0x00;
		a3_28->dw420203E8 = a0->dw0018;
		a3_28->dw420203EC = a0->dw001C;
		a3_28->dw420203F0 = a0->dw0020;
		a3_28->dw420203F4 = a0->dw0024;
		goto l2300D396;
	}
	if (a4_50 != 0x00)
	{
		a3_51 = (word32 *) 0x03;
		if (a4_50 != 0x03)
		{
			a3_28->dw420203E0 = 0x00;
			a3_28->dw420203E4 = 0x00;
l2300D396:
			struct Eq_36856 * s1_100 = (char *) s3_19 + 0x05D8 + (s1_20 + 0x0068);
			s1_100->b420203FB = 0x01;
			s3_19->ptr42020B10 = (char *) a3_28 + 0x42020398;
			s0Out = s1;
			s1Out = (char *) s1_100 + 1107427192;
			s3Out = s3_19;
			return ra_47;
		}
	}
	struct Eq_36820 * a3_76 = (char *) a3_51 + 1103515245;
	a3_76->dw3000039 = *a3_51;
	struct Eq_36829 * a4_88 = (char *) s3_19 + 0x05D8 + (s1_20 + 0x0068);
	a4_88->dw420203E0 = &a3_76->dw3000039 >> 16;
	a4_88->dw420203E4 = 0x00;
	goto l2300D396;
}

// 2300D404: void vif_mgmt_del_key(Register (ptr32 Eq_20265) a0, Register word32 a1)
// Called from:
//      RemoveAPKeyInfo
void vif_mgmt_del_key(struct Eq_20265 * a0, word32 a1)
{
	*((char *) &(a0 + (a1 + 0x0068) / 0x05C4)->dw00A8 + 987) = (struct Eq_20265 *) 0x00;
	if (a0->dw05C0 == a0 + (a1 + 0x0488) / 0x05C4)
	{
		a0->dw05C0 = 0x00;
		struct Eq_36891 * a4_13 = (char *) &a0->dw00A8 + 987;
		word32 a5_14;
		for (a5_14 = 0x0488; a5_14 != ~0x0483; ++a5_14)
		{
			if ((word32) a4_13->b0000 != 0x00)
			{
				a0->dw05C0 = a0 + (a5_14 + 0) / 0x05C4;
				return;
			}
			++a4_13;
		}
	}
}

// 2300D454: Register Eq_2 vif_mgmt_send_postponed_frame(Register Eq_2 ra, Register Eq_2 a0, Register Eq_2 s5, Register ptr32 mstatus, Stack Eq_2 dwArg68, Stack Eq_2 dwArg78, Stack Eq_2 dwArgAC, Stack Eq_2 dwArg0118, Register out Eq_2 s1Out, Register out (ptr32 Eq_36923) s2Out, Register out Eq_36924 s3Out, Register out Eq_36925 s4Out, Register out Eq_2 s5Out)
// Called from:
//      vif_mgmt_reset
//      chan_tx_cfm
Eq_2 vif_mgmt_send_postponed_frame(Eq_2 ra, Eq_2 a0, Eq_2 s5, ptr32 mstatus, Eq_2 dwArg68, Eq_2 dwArg78, Eq_2 dwArgAC, Eq_2 dwArg0118, union Eq_2 & s1Out, struct Eq_36923 & s2Out, union Eq_36924 & s3Out, union Eq_36925 & s4Out, union Eq_2 & s5Out)
{
	Eq_2 s0_11 = *((word32) a0 + 848);
	Eq_2 s1_12 = a0;
	while (s0_11 != 0x00)
	{
		union Eq_2 * s0_25;
		word32 a0_110;
		word32 a1_111;
		word32 a2_112;
		word32 a3_113;
		word32 a6_114;
		word32 s6_115;
		word32 s7_116;
		word32 s9_117;
		word32 s10_118;
		word32 s11_119;
		ra = sta_mgmt_send_postponed_frame(ra, s1_12, s0_11, s5, mstatus, dwArg68, dwArg78, dwArgAC, dwArg0118, out s0_25, out s1_12, out a0_110, out a1_111, out a2_112, out a3_113, out a6_114, out s2, out s3, out s4, out s5, out s6_115, out s7_116, out s9_117, out s10_118, out s11_119);
		s0_11 = *s0_25;
	}
	s1Out = s1_12;
	s2Out = s2;
	s3Out = s3;
	s4Out = s4;
	s5Out = s5;
	return ra;
}

// 2300D47C: void vif_mgmt_reset(Register Eq_2 ra, Register Eq_2 s5, Register ptr32 mstatus, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg9C, Stack Eq_2 dwArg0108)
// Called from:
//      bl_reset_evt
void vif_mgmt_reset(Eq_2 ra, Eq_2 s5, ptr32 mstatus, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg9C, Eq_2 dwArg0108)
{
	Eq_2 s0_10 = g_t42020B30;
	while (s0_10 != 0x00)
	{
		word32 s1_98;
		word32 s2_99;
		word32 s3_100;
		word32 s4_101;
		ra = vif_mgmt_send_postponed_frame(ra, s0_10, s5, mstatus, dwArg58, dwArg68, dwArg9C, dwArg0108, out s1_98, out s2_99, out s3_100, out s4_101, out s5);
		s0_10 = *s0_10;
	}
}

// 2300D49E: Register word32 vif_mgmt_bcn_to_prog(Register Eq_2 a0, Register Eq_2 a4, Register ptr32 mstatus, Register out ptr32 a5Out, Register out ptr32 s2Out, Register out ptr32 s3Out)
// Called from:
//      mm_tbtt_evt
//      mm_sta_tbtt
word32 vif_mgmt_bcn_to_prog(Eq_2 a0, Eq_2 a4, ptr32 mstatus, ptr32 & a5Out, ptr32 & s2Out, ptr32 & s3Out)
{
	Eq_2 a1_5 = *(union Eq_2 *) 0x44B00120;
	ptr32 a5_16;
	word32 s1_19;
	ptr32 s2_20;
	ptr32 s3_21;
	word32 a0_29;
	word32 a1_30;
	word32 a2_31;
	word32 a4_32;
	word32 s4_33;
	word32 s8_34;
	mm_timer_set((word32) a0 + 40, (word32) a1_5 + 0x02000710, a4, mstatus, out s1_19, out a0_29, out a1_30, out a2_31, out a4_32, out a5_16, out s2_20, out s3_21, out s4_33, out s8_34);
	a5Out = a5_16;
	s2Out = s2_20;
	s3Out = s3_21;
	return s1_19;
}

// 2300D4B6: Register Eq_2 vif_mgmt_bcn_recv(Register Eq_2 ra, Register Eq_2 a3, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg88, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0158, Register out Eq_28739 s0Out, Register out Eq_28740 a1Out, Register out Eq_28741 a2Out, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out Eq_28744 a5Out, Register out ptr32 s3Out, Register out (ptr32 Eq_28746) s4Out, Register out Eq_28747 s5Out, Register out ptr32 s6Out, Register out Eq_28749 s7Out, Register out (ptr32 Eq_28750) s9Out, Register out (ptr32 Eq_28751) s10Out)
// Called from:
//      rxl_cntrl_evt
Eq_2 vif_mgmt_bcn_recv(Eq_2 ra, Eq_2 a3, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg88, Eq_2 dwArgF8, Eq_2 dwArg0158, union Eq_28739 & s0Out, union Eq_28740 & a1Out, union Eq_28741 & a2Out, union Eq_2 & a3Out, union Eq_2 & a4Out, union Eq_28744 & a5Out, ptr32 & s3Out, struct Eq_28746 & s4Out, union Eq_28747 & s5Out, ptr32 & s6Out, union Eq_28749 & s7Out, struct Eq_28750 & s9Out, struct Eq_28751 & s10Out)
{
	Eq_28744 a5_4 = 1107421660;
	Eq_2 a4_6 = (word32) g_b4201E9DC;
	if (a4_6 != 0x00)
	{
		ui32 a5_7 = g_dw4201E9E0;
		a5_4 = a5_7 & 0x08;
		if ((a5_7 & 0x08) == 0x00)
		{
			word32 a0_9 = (a5_7 & 0x08)->dw0004;
			if ((a5_7 & 0x08) == 0x00)
			{
				struct Eq_36109 * a5_20;
				word32 a2_141;
				mm_timer_clear(a0_9 + 40, a4_6, out a2_141, out a5_20);
				Eq_28740 a1_29;
				Eq_28741 a2_30;
				Eq_2 a3_31;
				Eq_2 a4_32;
				Eq_28744 a5_33;
				Eq_28739 s0_36;
				struct Eq_28751 * s10_38;
				ptr32 s3_41;
				struct Eq_28746 * s4_42;
				Eq_28747 s5_43;
				ptr32 s6_44;
				Eq_28749 s7_45;
				struct Eq_28750 * s9_47;
				Eq_2 ra_35 = vif_mgmt_bcn_to_evt(ra, a3, a5_20, s2, mstatus, dwArg08, dwArg18, dwArg88, dwArgF8, dwArg0158, out s0_36, out a1_29, out a2_30, out a3_31, out a4_32, out a5_33, out s3_41, out s4_42, out s5_43, out s6_44, out s7_45, out s9_47, out s10_38);
				s0Out = s0_36;
				a1Out = a1_29;
				a2Out = a2_30;
				a3Out = a3_31;
				a4Out = a4_32;
				a5Out = a5_33;
				s3Out = s3_41;
				s4Out = s4_42;
				s5Out = s5_43;
				s6Out = s6_44;
				s7Out = s7_45;
				s9Out = s9_47;
				s10Out = s10_38;
				return ra_35;
			}
		}
	}
	s0Out = s0;
	a1Out = a1;
	a2Out = a2;
	a3Out = a3;
	a4Out = a4_6;
	a5Out = a5_4;
	s3Out = s3;
	s4Out = s4;
	s5Out = s5;
	s6Out = s6;
	s7Out = s7;
	s9Out = s9;
	s10Out = s10;
	return ra;
}

