pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0000.c
// 2300D4EC: Register uint32 vif_mgmt_set_ap_bcn_int(Register (ptr32 Eq_37092) a0, Register uint32 a1, Register ptr32 mstatus)
// Called from:
//      mm_hw_config_handler
uint32 vif_mgmt_set_ap_bcn_int(struct Eq_37092 * a0, uint32 a1, ptr32 mstatus)
{
	uint32 a4_16;
	Eq_2 a5_14;
	a0->w033E = (word16) a1;
	__csrrc(mstatus, 0x08);
	if ((word32) g_b42020B39 > 0x01)
	{
		a4_16 = (word32) g_a4202088E[(word32) g_b42020B3A];
		if (a1 < a4_16)
		{
			g_b42020B3A = (byte) (word32) a0->b0057;
			a4_16 = a1;
		}
		a5_14 = g_t42020B30;
		while (a5_14 != 0x00)
		{
			uint32 a3_33 = (word32) *((byte) a5_14.u0 + 0x033E);
			*((byte) a5_14.u0 + 833) = 0x01;
			*((byte) a5_14.u0 + 832) = (byte) (a3_33 >> a4_16);
			a5_14 = *a5_14.u0;
		}
	}
	else
	{
		g_b42020B3A = (byte) (word32) a0->b0057;
		a0->w0340 = 0x0101;
		a5_14.u0 = 0x0101;
		a4_16 = a1;
	}
	(a5_14 & 0xF0000000 | a4_16)->dw0064 = (word32) *((byte) a5_14.u0 + 100);
	__csrrs(mstatus, 0x08);
	return a4_16;
}

// 2300D574: void vif_mgmt_switch_channel(Register Eq_2 ra, Register Eq_2 a4, Register Eq_2 s2, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg78, Stack Eq_2 dwArg88, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0148)
// Called from:
//      mm_sta_tbtt
//      mm_bcn_transmitted
void vif_mgmt_switch_channel(Eq_2 ra, Eq_2 a4, Eq_2 s2, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg78, Eq_2 dwArg88, Eq_2 dwArgE8, Eq_2 dwArg0148)
{
	Eq_2 a3_23;
	word32 s8_303;
	word32 s4_302;
	word32 s3_301;
	word32 s2_300;
	word32 s1_304;
	word32 s6_306;
	word32 s10_307;
	word32 a4_305;
	word32 a4_297;
	word32 a6_299;
	word32 a5_298;
	word32 a2_296;
	word32 a1_295;
	word32 a0_294;
	word32 s1_293;
	Eq_2 s0_112;
	Eq_2 ra_49 = chan_ctxt_unlink(ke_msg_alloc(ra, 88, 0x0D, 0x03, a4, mstatus, dwLoc08, out s0_112, out s1_293, out a0_294, out a1_295, out a2_296, out a3_23, out a4_297, out a5_298, out a6_299, out s2_300, out s3_301, out s4_302, out s8_303), s0_112, (word32) *((word32) s0_112 + 87), a3_23, mstatus, s2, dwArg08, dwArg18, dwArg78, dwArgE8, dwArg0148, out s1_304, out a4_305, out s6_306, out s10_307);
	struct Eq_37232 * a1_108 = (word32) *((word32) s0_112 + 0x05CA);
	Eq_2 a3_69;
	struct Eq_37238 * a0_114 = me_freq_to_chan_ptr((word32) *((word32) s0_112 + 0x05C8), a1_108, out a3_69);
	word32 a5_72 = (word32) *((word32) s0_112 + 0x05CC);
	*((word32) s0_112 + 932) = a0_114;
	*((word32) s0_112 + 936) = (word16) a5_72;
	*((word32) s0_112 + 0x03AA) = (word16) (word32) *((word32) s0_112 + 0x05CE);
	word32 a5_78 = (word32) *((word32) s0_112 + 1481);
	*((word32) s0_112 + 987) = (byte) a5_78;
	Eq_2 a4_120 = 0x04;
	if (a5_78 == 0x04)
		a5_78 = 0x03;
	Eq_2 s1_131;
	*((word32) s0_112 + 986) = (byte) a5_78;
	if (a0_114 != null)
	{
		*((word32) s0_112 + 1488) = (byte) (int32) a0_114->b0004;
		Eq_2 s2_100;
		word32 s5_309;
		word32 s6_310;
		word32 s3_308;
		s0_112 = chan_ctxt_add((word32) s0_112 + 0x05C8, fp + ~0x10, 0x04, dwArg88, out s1_131, out a0_114, out a4_120, out s2_100, out s3_308, out s5_309, out s6_310);
		*((word32) s1_131 + 1) = (byte) a0_114;
		*((word32) s1_131 + 2) = ~0x00;
		a1_108 = (struct Eq_37232 *) 0xFF;
		word32 a5_111 = (word32) *((word32) s0_112 + 86);
		if (a5_111 != 0x00)
		{
			if (a5_111 == 0x02)
			{
				*((word32) s0_112 + 839) = 0x00;
				if (a0_114 == null)
				{
					word32 a4_322;
					word32 s2_323;
					word32 s3_324;
					word32 s4_325;
					chan_ctxt_link(ra_49, (word32) *((word32) s0_112 + 87), (struct Eq_37232 *) 0xFF, a3_69, s2_100, mstatus, out s1_131, out a4_322, out s2_323, out s3_324, out s4_325);
					g_b4201F9B9 = 0x01;
				}
			}
			goto l2300D66A;
		}
	}
	else
		__ebreak();
	*((word32) s0_112 + 121) = 0x00;
	if (a0_114 == null)
	{
		Eq_2 a4_150;
		struct Eq_37424 * s2_155;
		word32 s1_327;
		word32 s3_328;
		word32 s4_329;
		Eq_2 s0_153 = chan_ctxt_link(ra_49, (word32) *((word32) s0_112 + 87), a1_108, a3_69, (word32) *((word32) s0_112 + 96), mstatus, out s1_327, out a4_150, out s2_155, out s3_328, out s4_329);
		word32 a2_330;
		word32 a5_331;
		mm_timer_clear((word32) s0_153 + 40, a4_150, out a2_330, out a5_331);
		word32 a0_332;
		word32 a1_333;
		word32 a2_334;
		word32 a4_335;
		word32 a5_336;
		word32 s2_337;
		word32 s3_338;
		word32 s4_339;
		word32 s8_340;
		Eq_2 s0_180 = mm_timer_set((word32) s0_153 + 24, (word32) *(union Eq_2 *) 0x44B00120 + s2_155->dw4201EC14, 432, mstatus, out s1_131, out a0_332, out a1_333, out a2_334, out a4_335, out a5_336, out s2_337, out s3_338, out s4_339, out s8_340);
		*((word32) s0_180 + 116) = 0x00;
		*((word32) s0_180 + 122) = 0x01;
	}
	else
	{
		word32 a4_326;
		mm_send_connection_loss_ind(ra_49, a4_120, mstatus, s2, out s1_131, out a4_326);
	}
l2300D66A:
	word32 s1_311;
	word32 a0_312;
	word32 a1_313;
	word32 a2_314;
	word32 a3_315;
	word32 a4_316;
	word32 a5_317;
	word32 s2_318;
	word32 s3_319;
	word32 s4_320;
	word32 s8_321;
	ke_msg_send(s1_131, mstatus, out s1_311, out a0_312, out a1_313, out a2_314, out a3_315, out a4_316, out a5_317, out s2_318, out s3_319, out s4_320, out s8_321);
}

// 2300D684: Register (ptr32 Eq_37491) vif_mgmt_get_first_ap_inf()
// Called from:
//      rxu_cntrl_frame_handle
//      apm_probe_req_handler
struct Eq_37491 * vif_mgmt_get_first_ap_inf()
{
	struct Eq_37491 * a0_10 = null;
	if ((word32) g_b42020B39 != 0x00)
	{
		while (a0_10 != null && (word32) a0_10->b0056 != 0x02)
			a0_10 = a0_10->ptr0000;
	}
	return a0_10;
}

// 2300D6A8: Register Eq_2 me_init(Register Eq_2 ra, Register ptr32 mstatus, Register out ptr32 s0Out)
// Called from:
//      bl_init
//      mm_reset_req_handler
Eq_2 me_init(Eq_2 ra, ptr32 mstatus, ptr32 & s0Out)
{
	word32 t1_99;
	word32 a0_100;
	word32 a1_101;
	word32 a2_102;
	word32 a3_103;
	word32 a4_104;
	word32 a5_105;
	Eq_2 ra_16 = memset(ra, 0x42020B3C, 0x00, 308, out t1_99, out a0_100, out a1_101, out a2_102, out a3_103, out a4_104, out a5_105);
	word32 s1_106;
	word32 a0_107;
	word32 a1_108;
	word32 a4_109;
	word32 a5_110;
	word32 s2_111;
	word32 s3_112;
	word32 s4_113;
	ke_state_set(0x05, 0x00, mstatus, out s1_106, out a0_107, out a1_108, out a4_109, out a5_110, out s2_111, out s3_112, out s4_113);
	Eq_2 ra_58 = apm_init(scanu_init(ra_16, mstatus), mstatus);
	sm_init(mstatus);
	s0Out = bam_init(mstatus);
	return ra_58;
}

