pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0000.c
// 2300DA16: Register (ptr32 Eq_38085) me_11n_nss_max(Register (ptr32 Eq_38085) a0)
// Called from:
//      me_sta_bw_nss_max_upd
//      rc_init
struct Eq_38085 * me_11n_nss_max(struct Eq_38085 * a0)
{
	struct Eq_38085 * a5_10;
	if ((word32) a0->b0003 == 0x00)
	{
		a5_10 = (struct Eq_38085 *) 0x02;
		if ((word32) a0->b0002 == 0x00)
		{
			a5_10 = (word32) a0->b0001;
			if (a5_10 != null)
				a5_10 = (struct Eq_38085 *) 0x01;
		}
	}
	else
		a5_10 = (struct Eq_38085 *) 0x03;
	return a5_10;
}

// 2300DA34: Register int32 me_legacy_ridx_min(Register int32 a0)
// Called from:
//      rc_init
int32 me_legacy_ridx_min(int32 a0)
{
	ui32 a5_10;
	for (a5_10 = 0x00; a5_10 != 0x0C; ++a5_10)
	{
		int32 a3_12 = a5_10 & 0x00FF;
		if ((a0 >> a5_10 & 0x01) != 0x00)
			return a3_12;
	}
	a3_12 = 0x0C;
	return a3_12;
}

// 2300DA50: Register int32 me_legacy_ridx_max(Register int32 a0)
// Called from:
//      rc_init
int32 me_legacy_ridx_max(int32 a0)
{
	if (a0 == 0x00)
		return 0x0C;
	ui32 a5_15;
	for (a5_15 = 11; a5_15 != ~0x00; a5_15 += ~0x00)
	{
		ui32 a4_14 = 11 - a5_15 & 0x00FF;
		if ((a0 >> a5_15 & 0x01) != 0x00)
			return 11 - a4_14 & 0x00FF;
	}
	a4_14 = 0x0C;
	return 11 - a4_14 & 0x00FF;
}

// 2300DA7E: Register int32 me_rate_translate(Register int32 a0, Register out Eq_38150 a4Out)
// Called from:
//      me_legacy_rate_bitfield_build
//      me_init_bcmc_rate
//      apm_assoc_req_handler
int32 me_rate_translate(int32 a0, union Eq_38150 & a4Out)
{
	int32 a0_10;
	Eq_38150 a4_11 = 22;
	if ((a0 & 0x007F) == 22)
	{
		a0_10 = 0x03;
		goto l2300DAF8;
	}
	if ((a0 & 0x007F) > 22)
	{
		a4_11.u0 = 48;
		a0_10 = 0x08;
		if ((a0 & 0x007F) == 48)
			goto l2300DAF8;
		if ((a0 & 0x007F) <= 48)
		{
			a4_11.u0 = 0x18;
			a0_10 = 0x06;
			if ((a0 & 0x007F) != 0x18)
			{
				a4_11.u0 = 36;
				a0_10 = 0x07;
				goto l2300DAA4;
			}
		}
		else
		{
			a4_11.u0 = 96;
			a0_10 = 0x0A;
			if ((a0 & 0x007F) != 96)
			{
				a4_11.u0 = 0x006C;
				a0_10 = 11;
				if ((a0 & 0x007F) != 0x006C)
				{
					a4_11.u0 = 72;
					a0_10 = 0x09;
					goto l2300DAA4;
				}
			}
		}
l2300DAF8:
		a4Out = a4_11;
		return a0_10;
	}
	else
	{
		a4_11.u0 = 11;
		a0_10 = 0x02;
		if ((a0 & 0x007F) == 11)
			goto l2300DAF8;
		if ((a0 & 0x007F) <= 11)
		{
			a4_11.u0 = 0x02;
			a0_10 = 0x00;
			if ((a0 & 0x007F) == 0x02)
				goto l2300DAF8;
			a4_11.u0 = 0x04;
			a0_10 = 0x01;
		}
		else
		{
			a4_11.u0 = 0x0C;
			a0_10 = 0x04;
			if ((a0 & 0x007F) == 0x0C)
				goto l2300DAF8;
			a4_11.u0 = 0x12;
			a0_10 = 0x05;
		}
l2300DAA4:
		if ((a0 & 0x007F) != a4_11)
		{
			a4Out = a4_11;
			return 0x00FF;
		}
		goto l2300DAF8;
	}
}

// 2300DAFA: void me_get_basic_rates(Register (ptr32 byte) a0, Register Eq_2 a1)
// Called from:
//      apm_start_req_handler
void me_get_basic_rates(byte * a0, Eq_2 a1)
{
	*a1 = 0x00;
	int32 a5_21;
	for (a5_21 = 0x00; a5_21 < (word32) (*a0); ++a5_21)
	{
		word32 a3_11 = (word32) (a0 + a5_21)[1];
		if ((int32) (byte) a3_11 < 0x00)
		{
			int32 a4_15 = (word32) *a1;
			(word32) a1 + a4_15 + 1 = (ptr32) (byte) a3_11;
			*a1 = (byte) (a4_15 + 0x01);
		}
	}
}

// 2300DB32: Register word32 me_legacy_rate_bitfield_build(Register (ptr32 Eq_38256) a0, Register word32 a1, Stack Eq_2 dwArg0128, Register out Eq_38259 s1Out, Register out Eq_38260 a0Out, Register out ptr32 a4Out, Register out (ptr32 Eq_38256) s2Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out (ptr32 Eq_38265) s5Out, Register out ptr32 s6Out, Register out ptr32 s7Out, Register out ptr32 s8Out)
// Called from:
//      rc_init
//      sm_set_bss_param
//      apm_set_bss_param
//      apm_assoc_req_handler
//      rxu_mgt_ind_handler
//      apm_start_req_handler
word32 me_legacy_rate_bitfield_build(struct Eq_38256 * a0, word32 a1, Eq_2 dwArg0128, union Eq_38259 & s1Out, union Eq_38260 & a0Out, ptr32 & a4Out, struct Eq_38256 & s2Out, ptr32 & s3Out, ptr32 & s4Out, struct Eq_38265 & s5Out, ptr32 & s6Out, ptr32 & s7Out, ptr32 & s8Out)
{
	Eq_38260 s0_26 = 0x00;
	Eq_38259 s1_27 = 0x00;
	while (s1_27 < (word32) a0->b0000)
	{
		word32 a0_37 = CONVERT(Mem21[a0 + s1_27 + 1:byte], byte, word32);
		if (a1 == 0x00 || (int32) ((byte) a0_37) < 0x00)
		{
			Eq_38290 a0_42 = me_rate_translate(a0_37, out a4);
			if (a0_42 > 11)
				assert_warn();
			else
				s0_26 = (word32) (word16) (s0_26 | 0x01 << a0_42);
		}
		s1_27 = (word32) s1_27.u0 + 1;
	}
	0x00 = (int8) dwArg0128;
	s1Out = s1_27;
	a0Out = s0_26;
	a4Out = a4;
	s2Out = a0;
	s3Out = 0x01;
	s4Out = dwArg78;
	s5Out = (struct Eq_38265 *) 11;
	s6Out = 0x230AA000;
	s7Out = 0x230AC000;
	s8Out = s5;
	return dwArgE4;
}

// 2300DBB8: Register (ptr32 Eq_38316) me_build_capability(Register (ptr32 Eq_38316) a0, Register out ptr32 a2Out, Register out ptr32 a3Out, Register out Eq_38319 a4Out, Register out ptr32 a5Out)
// Called from:
//      me_build_associate_req
//      me_build_beacon
//      me_build_probe_rsp
//      me_build_associate_rsp
struct Eq_38316 * me_build_capability(struct Eq_38316 * a0, ptr32 & a2Out, ptr32 & a3Out, union Eq_38319 & a4Out, ptr32 & a5Out)
{
	ptr32 a2_11 = (word32) a0->b420205A6;
	Eq_38319 a4_12 = 0x11;
	if (a2_11 != 0x00)
	{
		a4_12.u0 = 0x01;
		if (a2_11 == 0x02)
		{
			a2_11 = 0x12FFFA00;
			if ((a0->dw42020938 & 0x12FFFA00) != 0x00)
				a4_12.u0 = 0x11;
		}
	}
	struct Eq_38316 * a0_28 = a4_12 | 1312;
	ptr32 a3_29 = (word32) a0->ptr420208F4->b0002;
	if (a3_29 != 0x01)
		a0_28 = a4_12 | 0x0420;
	a2Out = a2_11;
	a3Out = a3_29;
	a4Out = a4_12;
	a5Out = 0x01;
	return a0_28;
}

// 2300DC10: Register word32 me_init_bcmc_rate(Register (ptr32 Eq_38359) a0, Register out ptr32 a4Out)
// Called from:
//      apm_start_cfm
word32 me_init_bcmc_rate(struct Eq_38359 * a0, ptr32 & a4Out)
{
	if ((word32) a0->b00B0 != 0x00)
	{
		int32 a3_16 = (word32) a0->b00B0;
		int32 a5_17;
		int32 a0_18 = 0x00;
		for (a5_17 = 0x00; a5_17 < a3_16; ++a5_17)
		{
			ui32 a4_24 = (word32) (&(a0 + a5_17 / 0x011B)->b00B0)[1];
			if (a0_18 < (a4_24 & -0x0081))
				a0_18 = a4_24 & 0x007F;
		}
		ptr32 a4_38;
		word32 a4_58;
		word32 a3_37 = rc_init_bcmc_rate(a0, me_rate_translate(a0_18, out a4_58), out a4_38);
		a0->b011A = 0x00;
		a4Out = a4_38;
		return a3_37;
	}
	else
		assert_err();
}

// 2300DC72: Register (ptr32 Eq_32052) me_tx_cfm_singleton(Register (ptr32 Eq_32052) a5, Stack word32 dwArg1C, Stack uint32 dwArg24, Stack word32 dwArg0128)
// Called from:
//      txl_cfm_evt
struct Eq_32052 * me_tx_cfm_singleton(struct Eq_32052 * a5, word32 dwArg1C, uint32 dwArg24, word32 dwArg0128)
{
	struct Eq_38409 * a0_17;
	uint32 a5_8 = a5->ptr0000->dw0010;
	ui32 a2_11 = a5_8 >> 0x08 & 0x00FF;
	struct Eq_38422 * a0_5 = a5->ptr006C;
	uint32 a2_14 = a2_11 + (word32) ((a5_8 & 0x10000000) != 0x00);
	if ((a5_8 & 0x10000000) != 0x00)
	{
		rf_dump_status();
		a2_14 = dwArg24;
		a0_17 = (word32) a0_5->b0030;
	}
	else
		a0_17 = (word32) a0_5->b0030;
	return rc_update_counters(a0_17, a2_11 + 1, a2_14, dwArg1C, dwArg0128);
}

// 2300DCBE: Register Eq_2 me_check_rc(Register Eq_2 ra, Register (ptr32 Eq_38458) a0, Register Eq_2 s6, Stack (ptr32 Eq_6667) dwArg14, Stack Eq_2 dwArg28, Stack Eq_2 dwArg30, Stack Eq_2 dwArg58, Stack word32 dwArg010C, Register out ptr32 s0Out, Register out ptr32 s2Out)
// Called from:
//      txu_cntrl_push
Eq_2 me_check_rc(Eq_2 ra, struct Eq_38458 * a0, Eq_2 s6, struct Eq_6667 * dwArg14, Eq_2 dwArg28, Eq_2 dwArg30, Eq_2 dwArg58, word32 dwArg010C, ptr32 & s0Out, ptr32 & s2Out)
{
	ptr32 s0_14;
	ptr32 s2_26;
	Eq_2 ra_13 = rc_check(ra, a0, s6, dwArg14, dwArg28, dwArg30, dwArg58, dwArg010C, out s0_14, out s2_26);
	s0Out = s0_14;
	s2Out = s2_26;
	return ra_13;
}

