pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0000.c
// 2300DCC2: Register word32 me_update_buffer_control(Register Eq_2 ra, Register Eq_2 a0, Register ptr32 fflags, Register ptr32 frm, Register ptr32 mstatus, Stack word32 dwArg0198, Register out (ptr32 Eq_38492) a0Out, Register out (ptr32 Eq_38492) s3Out, Register out ptr32 s4Out, Register out ptr32 s8Out)
// Called from:
//      me_init_rate
//      txu_cntrl_push
word32 me_update_buffer_control(Eq_2 ra, Eq_2 a0, ptr32 fflags, ptr32 frm, ptr32 mstatus, word32 dwArg0198, struct Eq_38492 & a0Out, struct Eq_38492 & s3Out, ptr32 & s4Out, ptr32 & s8Out)
{
	ui32 a2_21 = (word32) *((word32) a0 + 282);
	struct Eq_38492 * s3_22 = *((word32) a0 + 268);
	if (a2_21 != 0x00)
	{
		int32 s2_106 = s3_22->dw0004;
		struct Eq_38511 * s1_215 = &s3_22->dw0004 + 4;
		struct Eq_38514 * a4_25 = &s3_22->dw0004 + 4;
		int32 a5_26;
		for (a5_26 = 0x00; a5_26 != 0x10; a5_26 += 0x04)
		{
			((char *) fp - 64)[a5_26] = (char) a4_25->dw0000;
			++a4_25;
			Mem41[fp + -48 + a5_26:word32] = Mem36[a4_25 + 0x0C:int32];
		}
		if ((a2_21 & 1) != 0x00)
		{
			struct Eq_38543 * a7_46 = *((word32) a0 + 272);
			uint32 t6_47 = (word32) *((word32) a0 + 244);
			word32 t5_49 = (word32) a7_46->b00B0;
			struct Eq_38557 * a6_50 = (char *) fp - 64;
			word32 s0_107 = 0x00;
			uint32 a4_108 = 0x00;
			word32 a1_53;
			for (a1_53 = 0x00; a1_53 != 0x04; ++a1_53)
			{
				uint32 a5_76 = (word32) *((char *) (a7_46 + ((word32) (*((char *) (a7_46 + ((t5_49 + a1_53 & 0x03) + 0x0E << 3) / 177) + 16)) + 0x0C) / 177) + 0x0A) & 0x03FFFFFF | 0x80000000;
				if ((a5_76 >> 11 & 0x06) != 0x00)
				{
					uint32 a3_80 = a5_76 >> 0x03 & 0x03;
					if (a1_53 == 0x00)
					{
						if (a3_80 < t6_47)
						{
							a4_108 = a3_80;
							s0_107 = 0x01;
						}
					}
					else if (s0_107 != 0x00)
						s0_107 = (word32) (a3_80 - a4_108 < 1);
				}
				++a6_50;
				a6_50[0x03FF] = (struct Eq_38557) (a5_76 | a6_50->dw0000 & 0x1FFFC000);
			}
			s2_106 &= -0x0181;
			if (s0_107 != 0x00)
				s2_106 = s2_106 & -0x0181 | a4_108 + 0x01 << 7;
			*((word32) a0 + 282) = (byte) (a2_21 | 2);
		}
		ui32 a2_122 = (word32) *((word32) a0 + 282);
		word32 * a5_123 = a2_122 & 2;
		if ((a2_122 & 2) != 0x00)
		{
			do
			{
				word32 a4_133 = *a5_123;
				if ((a5_123 >> 11 & 0x07 | a5_123 & 0x007C) != 0x00)
				{
					a5_123 = a5_123 & ~0x1FFFC000 | *((word32) a0 + 0x0114);
					*a5_123 = a4_133;
				}
			} while (fp + -48 != a4_133 + 0x04);
		}
		if ((a2_122 & 0x10) != 0x00)
		{
			int32 s5_155;
			a0_157 = a0;
			for (s5_155 = 0x00; s5_155 != 0x10; s5_155 += 0x04)
			{
				Eq_2 a0_157;
				word32 a3_529;
				word32 a5_531;
				word32 a4_530;
				word32 a1_528;
				a0_157 = tpc_get_vif_tx_power_vs_rate(ra, a0_157, fflags, frm, out a1_528, out a3_529, out a4_530, out a5_531);
				Mem176[a0_157 + 0x00:word32] = fp + -48 + s5_155;
			}
		}
		__csrrc(mstatus, 0x08);
		s3_22->dw0004 = s2_106;
		int32 a5_190;
		for (a5_190 = 0x00; a5_190 != 0x10; a5_190 += 0x04)
		{
			++s1_215;
			s1_215[0x03FF] = (struct Eq_38511) ((char *) fp - 64)[a5_190];
			Mem222[Mem217[fp + -48 + a5_190:word32] + 0x0C:word32] = s1_215;
		}
		__csrrs(mstatus, 0x08);
		*((word32) a0 + 282) = 0x00;
	}
	0x00 = dwArg0198;
	a0Out = s3_22;
	s3Out = s3_22;
	s4Out = dwArgF4;
	s8Out = dwArgD4;
	return dwArg0158;
}

// 2300DE44: Register Eq_2 me_init_rate(Register Eq_2 ra, Register (ptr32 Eq_8437) a0, Register Eq_2 s9, Register ptr32 fflags, Register ptr32 frm, Register ptr32 mstatus, Stack word32 dwArg0C, Stack (ptr32 Eq_6667) dwArg24, Stack Eq_2 dwArg38, Stack Eq_2 dwArg68, Stack Eq_2 dwArgE8, Stack Eq_2 dwArg0118, Stack word32 dwArg0198, Register out ptr32 s1Out, Register out ptr32 a3Out, Register out ptr32 a5Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out (ptr32 Eq_38759) s5Out, Register out ptr32 s6Out, Register out ptr32 s7Out, Register out (ptr32 Eq_38762) s8Out, Register out ptr32 s9Out)
// Called from:
//      sm_assoc_rsp_handler
//      me_sta_add_req_handler
Eq_2 me_init_rate(Eq_2 ra, struct Eq_8437 * a0, Eq_2 s9, ptr32 fflags, ptr32 frm, ptr32 mstatus, word32 dwArg0C, struct Eq_6667 * dwArg24, Eq_2 dwArg38, Eq_2 dwArg68, Eq_2 dwArgE8, Eq_2 dwArg0118, word32 dwArg0198, ptr32 & s1Out, ptr32 & a3Out, ptr32 & a5Out, ptr32 & s3Out, ptr32 & s4Out, struct Eq_38759 & s5Out, ptr32 & s6Out, ptr32 & s7Out, struct Eq_38762 & s8Out, ptr32 & s9Out)
{
	ptr32 a3_14;
	ptr32 a5_16;
	Eq_2 s0_20;
	ptr32 s1_21;
	struct Eq_38759 * s5_27;
	ptr32 s6_28;
	ptr32 s7_29;
	ptr32 s9_31;
	Eq_2 ra_19 = rc_init(ra, a0, s9, dwLoc08, dwArg0C, dwArg24, dwArg38, dwArg68, dwArgE8, dwArg0118, out s0_20, out s1_21, out a3_14, out a5_16, out s5_27, out s6_28, out s7_29, out s9_31);
	ptr32 s3_50;
	ptr32 s4_51;
	struct Eq_38762 * s8_52;
	word32 a0_76;
	me_update_buffer_control(ra_19, s0_20, fflags, frm, mstatus, dwArg0198, out a0_76, out s3_50, out s4_51, out s8_52);
	s1Out = s1_21;
	a3Out = a3_14;
	a5Out = a5_16;
	s3Out = s3_50;
	s4Out = s4_51;
	s5Out = s5_27;
	s6Out = s6_28;
	s7Out = s7_29;
	s8Out = s8_52;
	s9Out = s9_31;
	return ra_19;
}

// 2300DE5C: Register (ptr32 Eq_38814) me_bw_check(Register Eq_2 a0, Register (ptr32 Eq_38816) a5)
// Called from:
//      me_beacon_check
//      rxu_mgt_ind_handler
struct Eq_38814 * me_bw_check(Eq_2 a0, struct Eq_38816 * a5)
{
	struct Eq_38814 * a2_5 = a5->ptr004C;
	word32 a4_20 = (word32) a5->w0000;
	ui32 a5_10 = 0x00;
	if (a0 != 0x00)
	{
		a5_10 = (word32) g_b42020C6B;
		if (a5_10 != 0x00)
		{
			ui32 a5_11 = (word32) *((word32) a0 + 3);
			a5_10 = a5_11 & 0x03;
			if ((a5_11 & 0x03) != 0x00)
			{
				word32 a3_14 = 0x0A;
				if ((a5_11 & 0x03) != 0x01)
					a3_14 = ~0x09;
				a4_20 = (word32) (word16) (a4_20 + a3_14);
				a5_10 = 0x01;
			}
		}
	}
	a2_5->b0082 = (byte) a5_10;
	a2_5->b0083 = (byte) a5_10;
	a2_5->w0050 = (word16) a4_20;
	a2_5->w0052 = 0x00;
	return a2_5;
}

// 2300DE9C: Register Eq_2 me_beacon_check(Register Eq_2 ra, Register (ptr32 Eq_24918) a0, Register word32 a1, Register Eq_2 a2, Register Eq_2 s2, Register ui32 s8, Register ptr32 fflags, Register ptr32 frm, Register ptr32 mstatus, Stack Eq_2 dwArg68, Stack Eq_2 dwArg0198, Register out Eq_2 a3Out, Register out Eq_2 a4Out, Register out (ptr32 byte) s3Out, Register out Eq_24931 s4Out, Register out (ptr32 Eq_24932) s5Out, Register out Eq_2 s6Out, Register out Eq_24934 s7Out)
// Called from:
//      mm_bcn_change
//      rxu_mgt_frame_check
Eq_2 me_beacon_check(Eq_2 ra, struct Eq_24918 * a0, word32 a1, Eq_2 a2, Eq_2 s2, ui32 s8, ptr32 fflags, ptr32 frm, ptr32 mstatus, Eq_2 dwArg68, Eq_2 dwArg0198, union Eq_2 & a3Out, union Eq_2 & a4Out, byte & s3Out, union Eq_24931 & s4Out, struct Eq_24932 & s5Out, union Eq_2 & s6Out, union Eq_24934 & s7Out)
{
	struct Eq_38871 * a5_30 = a0->ptr420208F4;
	a0->w42020928 = 0x00;
	byte bLoc33_364 = SLICE(s8, byte, 8);
	uint32 s3_35 = a1 + -36 << 0x10;
	if ((word32) a5_30->b0002 == 0x00)
	{
		word32 a5_533;
		Eq_2 a0_48 = mac_ie_find((word32) a2 + 36, s3_35 >> 0x10, 42, out a5_533);
		if (a0_48 != 0x00)
		{
			uint32 a5_52 = ((word32) a0->w42020928 & ~0x07) << 16;
			ui32 a4_50 = (word32) *((word32) a0_48 + 2);
			uint32 a5_54 = a5_52 >> 16;
			if ((a4_50 & 1) != 0x00)
				a5_54 = a5_52 >> 16 | 1;
			a0->w42020928 = (word16) a5_54;
			if ((a4_50 & 2) != 0x00)
				a0->w42020928 = (word16) ((word32) a0->w42020928 | 2);
			if ((a4_50 & 0x04) != 0x00)
				a0->w42020928 = (word16) ((word32) a0->w42020928 | 4);
		}
	}
	struct Eq_38816 * a5_106 = (word32) g_b42020B6A;
	Eq_2 a0_107 = 0x00;
	if (a5_106 != null)
		a0_107 = mac_ie_find((word32) a2 + 36, s3_35 >> 0x10, 61, out a5_106);
	me_bw_check(a0_107, a5_106);
	Eq_2 a3_114 = &a0->w42020928 + 0x00F8;
	ui32 a0_125;
	struct Eq_24932 * s5_134;
	Eq_2 s6_140;
	struct Eq_38960 * s8_135;
	Eq_2 s4_133;
	Eq_2 s1_131;
	ptr32 s2_132;
	byte * s3_139;
	Eq_2 s0_130 = me_extract_csa((word32) a2 + 36, s3_35 >> 0x10, fp + -0x0033, &a0->w42020928 + 0x00F8, dwArg68, out s1_131, out a0_125, out s2_132, out s3_139, out s4_133, out s5_134, out s6_140, out s8_135);
	if ((a0_125 & 0x00FF) != 0x00)
	{
		struct Eq_39028 * a5_144 = (word32) s0_130 + (s2_132 + 0x05D8);
		word32 a4_145 = (word32) a5_144->b0056;
		if (a4_145 == 0x00)
		{
			if ((word32) a5_144->b0079 == 0x00)
			{
				a3_114 = (word32) bLoc33_364;
				if (a3_114 == 0x01)
					ra = mm_send_csa_traffic_ind(ra, 0x01, mstatus, dwLoc38, out s0_130, out s1_131, out a3_114, out s2_132, out s3_139, out s4_133, out s8_135);
			}
			(word32) s0_130 + (s2_132 + 0x05D8) + 121 = (ptr32) (byte) (a0_125 & 0x00FF);
		}
		else
		{
			a3_114.u0 = 0x02;
			if (a4_145 == 0x02)
				a5_144->b0347 = (byte) (a0_125 & 0x00FF);
		}
	}
	me_extract_power_constraint(s4_133, s3_139, s8_135);
	Eq_2 a4_206 = (word32) ((word32) s0_130 + (s2_132 + 0x05D8) + 988);
	if (a4_206 != s6_140)
	{
		word32 s1_534;
		s0_130 = tpc_update_vif_tx_power(ra, s1_131, fp + -50, fp + -49, a3_114, fflags, frm, out s1_534, out a3_114, out a4_206, out s2_132, out s3_139);
	}
	if (s5_134 < (word32) (((word32) s0_130 + (s2_132 + 0x05D8)) + 987))
	{
		Eq_2 a0_274;
		struct Eq_39105 * s1_283;
		struct Eq_39106 * s4_286;
		word32 a1_536;
		word32 a2_537;
		word32 a5_540;
		word32 a3_538;
		word32 a4_539;
		word32 s0_535;
		word32 s8_544;
		word32 s3_543;
		word32 a6_541;
		word32 s2_542;
		ra = ke_msg_alloc(ra, 59, 0x00, 0x0C, a4_206, mstatus, s2, out s0_535, out s1_283, out a0_274, out a1_536, out a2_537, out a3_538, out a4_539, out a5_540, out a6_541, out s2_542, out s3_543, out s4_286, out s8_544);
		if (s4_286->dw0040 == 0x00)
			assert_err();
		*a0_274 = (byte) (word32) *(byte *) 1519;
		*((word32) a0_274 + 1) = (byte) (word32) s1_283->ptr03A4->b0002;
		*((word32) a0_274 + 2) = (byte) (word32) s1_283->b03DB;
		*((word32) a0_274 + 4) = (word16) (word32) s1_283->ptr03A4->w0000;
		*((word32) a0_274 + 6) = (word16) (word32) s1_283->w03A8;
		struct Eq_39185 * a5_315 = (word32) s1_283->w03AA;
		*((word32) a0_274 + 8) = (word16) a5_315;
		*((word32) a0_274 + 0x0A) = (byte) (int32) a5_315->b000C;
		word32 s8_552;
		word32 a2_548;
		word32 a5_549;
		word32 s2_550;
		word32 s4_551;
		word32 s1_545;
		word32 a1_547;
		word32 a0_546;
		ke_msg_send(a0_274, mstatus, out s1_545, out a0_546, out a1_547, out a2_548, out a3_114, out a4_206, out a5_549, out s2_550, out s3_139, out s4_551, out s8_552);
	}
	0x00 = (int8) dwArg0198;
	a3Out = a3_114;
	a4Out = a4_206;
	s3Out = s3_139;
	s4Out = dwArgF4;
	s5Out = s5_134;
	s6Out = s6_140;
	s7Out = a0_125 & 0x00FF;
	return ra;
}

// 2300E0BE: Register word32 me_sta_bw_nss_max_upd(Register (ptr32 Eq_39231) a0, Register Eq_2 a1, Register Eq_39233 a2, Stack Eq_2 dwArgB8, Register out ptr32 s1Out, Register out Eq_39236 a1Out, Register out (ptr32 Eq_39237) a4Out, Register out (ptr32 Eq_39238) a5Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out (ptr32 Eq_39241) s5Out, Register out ptr32 s6Out, Register out ptr32 s7Out)
// Called from:
//      rxu_mgt_frame_check
//      me_sta_add_req_handler
word32 me_sta_bw_nss_max_upd(struct Eq_39231 * a0, Eq_2 a1, Eq_39233 a2, Eq_2 dwArgB8, ptr32 & s1Out, union Eq_39236 & a1Out, struct Eq_39237 & a4Out, struct Eq_39238 & a5Out, ptr32 & s3Out, ptr32 & s4Out, struct Eq_39241 & s5Out, ptr32 & s6Out, ptr32 & s7Out)
{
	struct Eq_39244 * s3_24 = (word32) a0->b4201EC2A;
	if ((word32) g_b42020B6A != 0x00)
	{
		Eq_39233 a0_42 = me_11n_nss_max(&a0->b4201EC2B + 0x00A8);
		Eq_39233 a0_48 = me_11n_nss_max(&g_t42020B4B);
		if (a0_42 < a0_48)
			a0_48 = a0_42;
		if (a2 < a0_48)
			a0_48 = a2;
		uint32 a2_60 = a0_48 & 0x00FF;
		Eq_2 a4_66 = (word32) a0->b4201ED00;
		if (a4_66 == 0x04)
			a4_66.u0 = 0x03;
		Eq_2 a1_78 = (word32) s3_24->b4202092A;
		if (a1 < a1_78)
			a1_78 = a1;
		if (a4_66 < a1_78)
			a1_78 = a4_66;
		Eq_39286 a1_93 = a1_78 & 0x00FF;
		struct Eq_39289 * a0_100 = (word32) a0->b4201EC2B;
		a0->b4201ED01 = (byte) a1_93;
		struct Eq_39237 * a4_112;
		struct Eq_39299 * s0_115;
		ptr32 s1_116;
		ptr32 s3_118;
		Eq_39236 a1_123;
		struct Eq_39241 * s5_127;
		ptr32 s6_128;
		ptr32 s7_129;
		word32 ra_114 = rc_update_bw_nss_max(a0_100, a1_93, a2_60, dwArgB8, out s0_115, out s1_116, out a1_123, out a4_112, out s3_118, out s5_127, out s6_128, out s7_129);
		ui32 a5_132 = (word32) s0_115->b011A;
		s0_115->b011A = (byte) (a5_132 | 8);
		s1Out = s1_116;
		a1Out = a1_123;
		a4Out = a4_112;
		a5Out = a5_132 | 8;
		s3Out = s3_118;
		s4Out = dwArg04;
		s5Out = s5_127;
		s6Out = s6_128;
		s7Out = s7_129;
		return ra_114;
	}
	else
		assert_err();
}

// 2300E1B0: Register Eq_2 me_add_chan_ctx(Register (ptr32 byte) a0, Register Eq_2 a4, Stack Eq_2 dwArg88, Register out ptr32 a0Out, Register out ptr32 s2Out, Register out ptr32 s3Out, Register out ptr32 s6Out)
// Called from:
//      apm_start_req_handler
Eq_2 me_add_chan_ctx(byte * a0, Eq_2 a4, Eq_2 dwArg88, ptr32 & a0Out, ptr32 & s2Out, ptr32 & s3Out, ptr32 & s6Out)
{
	ptr32 a0_22;
	ptr32 s2_29;
	ptr32 s3_30;
	ptr32 s6_33;
	word32 s1_52;
	word32 a4_53;
	word32 s5_54;
	Eq_2 s0_27 = chan_ctxt_add(fp + ~0x1B, a0, a4, dwArg88, out s1_52, out a0_22, out a4_53, out s2_29, out s3_30, out s5_54, out s6_33);
	a0Out = a0_22;
	s2Out = s2_29;
	s3Out = s3_30;
	s6Out = s6_33;
	return s0_27;
}

// 2300E1E6: Register Eq_39371 rc_get_nss(Register Eq_39371 a0, Register out Eq_2 a4Out, Register out Eq_2 a5Out)
// Called from:
//      me_check_rc
//      rc_set_next_mcs_index
//      rc_get_duration
//      rc_check_fixed_rate_config
Eq_39371 rc_get_nss(Eq_39371 a0, union Eq_2 & a4Out, union Eq_2 & a5Out)
{
	if ((a0 >> 11 & 0x07) > ~0x02)
	{
		a4Out.u0 = <invalid>;
		a5Out.u0 = <invalid>;
		return 0x00;
	}
	else
	{
		a4Out.u0 = <invalid>;
		a5Out.u0 = <invalid>;
		return a0 >> 3 & 0x03;
	}
}

