pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0000.c
// 2300E1FE: Register Eq_39371 rc_get_mcs_index(Register Eq_39371 a0, Register out ptr32 a3Out, Register out Eq_39371 a4Out, Register out Eq_39388 a5Out)
// Called from:
//      rc_set_previous_mcs_index
//      rc_set_next_mcs_index
//      is_cck_group
//      rc_get_duration
//      rc_check_fixed_rate_config
Eq_39371 rc_get_mcs_index(Eq_39371 a0, ptr32 & a3Out, union Eq_39371 & a4Out, union Eq_39388 & a5Out)
{
	Eq_39371 a4_10;
	Eq_39388 a5_5 = a0 >> 11 & 0x07;
	if (a5_5 > 0x01)
	{
		a3 = 0x03;
		a4_10.u0 = 0x00;
		if (a5_5 <= 0x03)
			a4_10 = a0 & 7;
	}
	else
		a4_10 = a0 & 0x007F;
	a3Out = a3;
	a4Out = a4_10;
	a5Out = a5_5;
	return a4_10;
}

// 2300E220: void rc_set_previous_mcs_index(Register (ptr32 Eq_39406) a0, Register Eq_39371 a1)
void rc_set_previous_mcs_index(struct Eq_39406 * a0, Eq_39371 a1)
{
	word32 a5_64;
	word32 a4_63;
	word32 a3_62;
	struct Eq_39411 * a0_16 = rc_get_mcs_index(a1, out a3_62, out a4_63, out a5_64);
	uint32 s0_20 = a1 >> 11 & 0x07;
	if (s0_20 > 0x01)
	{
		if (s0_20 <= 0x03 && a0_16 != null)
			(word32) a0->b00BD == 0x00;
	}
	else
		(word32) a0->b00B9 >= a0_16;
}

// 2300E27E: void rc_set_next_mcs_index(Register (ptr32 Eq_39440) a0, Register Eq_39371 a1)
void rc_set_next_mcs_index(struct Eq_39440 * a0, Eq_39371 a1)
{
	word32 a4_85;
	word32 a5_86;
	word32 a3_84;
	struct Eq_39411 * a0_20 = rc_get_mcs_index(a1, out a3_84, out a4_85, out a5_86);
	uint32 s3_24 = a1 >> 11 & 7;
	if (s3_24 > 0x01)
	{
		if (s3_24 <= 0x03 && a0_20 < (word32) a0->b00B8)
		{
			word32 a4_87;
			word32 a5_88;
			if ((CONVERT(Mem17[rc_get_nss(a1, out a4_87, out a5_88) + a0 + 0x00B2:byte], byte, word32) >>u a0_20 + 0x01 & 0x01) != 0x00)
				(word32) a0->b00BD == 0x00;
		}
	}
	else if (a0_20 < (word32) a0->b00BA)
		((word32) a0->w00B6 >> (char *) (&a0_20->ptr0000) + 1 & 0x01) == 0x00;
}

// 2300E30E: Register Eq_39371 is_cck_group(Register Eq_39371 a0, Register out (ptr32 Eq_39507) a5Out)
// Called from:
//      rc_update_retry_chain
//      rc_calc_tp
Eq_39371 is_cck_group(Eq_39371 a0, struct Eq_39507 & a5Out)
{
	struct Eq_39507 * a5_5 = a0 >> 11 & 0x06;
	if (a5_5 != null)
	{
		a5Out = a5_5;
		return 0x00;
	}
	else
	{
		struct Eq_39507 * a5_12;
		word32 a3_29;
		word32 a4_30;
		Eq_39371 a0_15 = (word32) (rc_get_mcs_index(a0, out a3_29, out a4_30, out a5_12) < (struct Eq_39411 *) 4);
		a5Out = a5_12;
		return a0_15;
	}
}

// 2300E32C: Register word32 rc_update_retry_chain(Register (ptr32 Eq_39529) a0, Register (arr Eq_39728) a1, Register (ptr32 Eq_39531) a3, Stack Eq_2 dwArg0128, Register out Eq_39533 s1Out, Register out (ptr32 Eq_39534) a1Out, Register out Eq_39535 a4Out, Register out (ptr32 Eq_39536) s2Out, Register out ptr32 s4Out, Register out (ptr32 (arr Eq_39728)) s5Out, Register out Eq_39539 s7Out)
// Called from:
//      rc_update_bw_nss_max
//      rc_update_stats
word32 rc_update_retry_chain(struct Eq_39529 * a0, Eq_39728 a1[], struct Eq_39531 * a3, Eq_2 dwArg0128, union Eq_39533 & s1Out, struct Eq_39534 & a1Out, union Eq_39535 & a4Out, struct Eq_39536 & s2Out, ptr32 & s4Out, Eq_39728 (& s5Out, union Eq_39539 & s7Out)
{
	Eq_39533 s1_100;
	Eq_39533 s4_27 = (word32) a0->w00C0;
	ui32 a4_28 = (word32) a0->b00AF;
	struct Eq_39569 ** a5_35 = a1 + ((s4_27 << 0x02) + ~0x03) / 4;
	if ((a4_28 & 0x04) == 0x00)
	{
		a5_35 = (struct Eq_39569 **) *(a4_28 & 0x04);
		if ((a4_28 & 0x04) < a3)
		{
			a0->w0080 = 0x00;
			a0->dw007C = 0x00;
			s1_100.u0 = 0x01;
l2300E36E:
			Eq_39539 s7_52 = (word32) a0->w0080;
			struct Eq_39536 * s2_55 = a0 + ((word32) s7_52 + 0x0C) / 0x00C2;
			struct Eq_39534 * a5_58;
			if (is_cck_group((word32) s2_55->w000A, out a5_58) == 0x00)
			{
				Eq_39606 s3_64 = 0x00;
				while (s3_64 < (word32) s4_27 - 1)
				{
					struct Eq_39608 * s6_71 = a0 + ((word32) s3_64.u0 + 0x0C) / 0x00C2;
					word32 a5_478;
					if (is_cck_group((word32) s6_71->w000A, out a5_478) != 0x00)
						s6_71->b000F = 0x00;
					s3_64 = (word32) (word16) ((word32) s3_64.u0 + 1);
				}
				s2_55->b000F = 0x01;
				a5_58 = (struct Eq_39534 *) 0x01;
			}
			struct Eq_39589 * s0_90 = a5_58->ptr007C;
			s0_90->w0088 = (word16) s7_52;
			s0_90->ptr0084 = a5_58;
			ui32 a4_102 = s4_27 - s1_100;
			struct Eq_39534 * a1_104 = (struct Eq_39534 *) 0x0C;
			while (true)
			{
				ui32 a5_106 = (word32) s1_100 + 1;
				if (s1_100 >= s4_27)
					break;
				ui32 a2_111 = a4_102 + -1;
				if ((word32) *((char *) (s0_90 + (a2_111 + 0x0C) / 0x009A) + 27) != 0x00)
				{
					s1_100 = s4_27 - s1_100;
					s0_90->w0088 = (word16) s1_100;
					s0_90->ptr0084 = (struct Eq_39534 *) a1[a4_102];
					break;
				}
				a4_102 = a2_111;
				s1_100 = (word32) (word16) a5_106;
			}
			Eq_39535 t1_134 = (word32) s0_90->w0088;
			Eq_39535 a5_137 = s4_27 - (word32) ((word16) a5_106);
			while ((word32) (word16) (s4_27 - a5_137) < s4_27)
			{
				Eq_39535 a3_144 = (word32) a5_137 - 1;
				if ((word32) *((char *) (s0_90 + ((word32) a3_144 + 0x0C) / 0x009A) + 27) != 0x00)
					goto l2300E3EC;
				a5_137 = a3_144;
			}
			a5_137 = t1_134;
l2300E3EC:
			struct Eq_39706 * a3_165 = (char *) s0_90 + 8;
			up32 a0_168 = (word32) *((char *) (s0_90 + ((word32) a5_137 + 0x0C) / 0x009A) + 8);
			Eq_39535 a4_169 = 0x00;
			while (true)
			{
				uint32 a2_171 = a4_169 << 0x10;
				if (a2_171 >> 16 >= t1_134)
					break;
				if ((word32) a3_165->b0007 != 0x00 && a2_171 >> 16 != s7_52)
				{
					up32 a2_178 = (word32) a3_165->w0000;
					if (a2_178 > 0x0F000332)
					{
						struct Eq_39534 * a7_188 = a1[a4_169];
						if (a7_188 < a1_104)
							goto l2300E4BA;
						a1_104 = a7_188;
						goto l2300E4B8;
					}
					if (a2_178 >= a0_168)
					{
l2300E4B8:
						a0_168 = a2_178;
						a5_137 = a4_169;
					}
				}
l2300E4BA:
				a4_169 = (word32) a4_169 + 1;
				++a3_165;
			}
			s0_90->w0090 = (word16) a5_137;
			struct Eq_39534 * a5_206 = a1[a5_137];
			s0_90->w0098 = 0x00;
			s0_90->ptr008C = a5_206;
			Eq_39728 a5_222 = a1[0];
			0x00 = (int8) dwArg0128;
			s0_90->t0094 = a5_222;
			s1Out = s1_100;
			a1Out = a1_104;
			a4Out = a4_169;
			s2Out = s2_55;
			s4Out = dwArg78;
			s5Out = a1;
			s7Out = s7_52;
			return s4;
		}
	}
	a0->w0080 = (word16) ((word32) s4_27 - 1);
	*((char *) *a5_35 + 0x007C) = (struct Eq_39569 **) a0;
	s1_100.u0 = 0x02;
	goto l2300E36E;
}

// 2300E4D0: Register Eq_2 rc_get_lowest_rate_config(Register Eq_2 a0)
// Called from:
//      rc_update_bw_nss_max
//      rc_init
Eq_2 rc_get_lowest_rate_config(Eq_2 a0)
{
	Eq_2 a5_11;
	uint32 a5_15;
	uint32 a4_5 = (word32) *((word32) a0 + 177);
	if (a4_5 > 0x01)
	{
		a5_11.u0 = 0x00;
		if (a4_5 > 0x03)
			return a5_11;
		a5_11.u0 = 0x0400;
		if ((word32) *((word32) a0 + 0x00B9) == 0x00)
			return a5_11;
		a5_15 = a4_5 << 0x1B;
	}
	else
	{
		ui32 a4_7 = (word32) *((word32) a0 + 0x00B9);
		a5_11.u0 = 0x0400;
		if (a4_7 == 0x00)
			return a5_11;
		a5_15 = a4_7 << 0x10;
	}
	a5_11 = a5_15 >> 16;
	return a5_11;
}

