pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0000.c
// 2300E508: Register word32 rc_sort_samples_tp(Register Eq_2 a0, Register (ptr32 Eq_39531) a3, Register (ptr32 Eq_39531) a4, Stack Eq_2 dwArg0128, Register out ptr32 s3Out, Register out ptr32 s6Out)
// Called from:
//      rc_update_bw_nss_max
//      rc_update_stats
word32 rc_sort_samples_tp(Eq_2 a0, struct Eq_39531 * a3, struct Eq_39531 * a4, Eq_2 dwArg0128, ptr32 & s3Out, ptr32 & s6Out)
{
	up32 a5_21 = (word32) *((word32) a0 + 0x00C0);
	up32 s4_27 = (word32) (word16) (a5_21 + -1);
	while (a5_21 != 0x00)
	{
		Eq_2 s2_40 = (word32) a0 + 16;
		a5_21 = 0x00;
		up32 s1_44 = 0x01;
		while (s1_44 < s4_27)
		{
			Eq_2 s5_53 = (word32) s2_40 + 0x0C;
			if (a4 < a3)
			{
				word32 a3_157;
				word32 a4_158;
				word32 a5_159;
				memmove(fp + -44, s2_40, 0x0C, out a3_157, out a4_158, out a5_159);
				word32 a3_160;
				word32 a4_161;
				word32 a5_162;
				memmove(s2_40, s5_53, 0x0C, out a3_160, out a4_161, out a5_162);
				struct Eq_39879 * a5_75;
				memmove(s5_53, fp + -44, 0x0C, out a3, out a4, out a5_75);
				word32 s0_77 = a4[1];
				a5_75->dw0004 = s0_77;
				a4->dw0000 = s0_77;
				a5_21 = s1_44;
			}
			s1_44 = (word32) (word16) (s1_44 + 0x01);
			s2_40 = s5_53;
		}
		s4_27 = a5_21;
	}
	0x00 = (int8) dwArg0128;
	s3Out = (word32) a0 + 16;
	s6Out = a1;
	return dwArgE4;
}

// 2300E596: Register Eq_2 rc_get_initial_rate_config(Register Eq_2 a0, Stack word32 dwArg38)
// Called from:
//      rc_update_bw_nss_max
//      rc_init
Eq_2 rc_get_initial_rate_config(Eq_2 a0, word32 dwArg38)
{
	Eq_2 a5_21;
	ui32 a0_16;
	ui32 a5_19;
	uint32 s1_13 = (word32) *((word32) a0 + 177);
	if (s1_13 > 0x01)
	{
		a5_21.u0 = 0x00;
		if (s1_13 > 0x03)
			goto l2300E5FE;
		int32 s2_22 = (word32) *((word32) a0 + 188);
		word32 a4_77;
		word32 a5_78;
		Eq_2 a0_28 = __clzsi2((word32) ((word32) a0 + s2_22 + 0x00B2), out a4_77, out a5_78);
		a5_19 = (word32) *((word32) a0 + 0x00BD) << 9 | s1_13 << 11 | (word32) (*((word32) a0 + 0x00BB)) << 7 | s2_22 << 3;
		a0_16 = 0x1F - a0_28 & 0x00FF;
	}
	else
	{
		a0_16 = (word32) *((word32) a0 + 0x00BA);
		a5_19 = s1_13 << 11 | (word32) (*((word32) a0 + 0x00BE)) << 0x0A;
	}
	a5_21 = (word32) (word16) (a5_19 | a0_16);
l2300E5FE:
	0x00 = dwArg38;
	return a5_21;
}

// 2300E60C: void rc_calc_prob_ewma(Register (ptr32 Eq_39970) a0)
// Called from:
//      rc_update_stats
void rc_calc_prob_ewma(struct Eq_39970 * a0)
{
	uint32 a3_5 = (word32) a0->w0000;
	if (a3_5 == 0x00)
	{
		int32 a5_6 = (word32) a0->b0008;
		if (a5_6 != 0x00FF)
			a0->b0008 = (byte) (a5_6 + 0x01);
	}
	else
	{
		ui32 a5_10 = (word32) a0->w0002;
		word32 a2_11 = (word32) a0->b0009;
		a0->b0008 = 0x00;
		uint32 a4_14 = a5_10 << 16 >> a3_5;
		if (a2_11 == 0x00)
		{
			if (a5_10 << 16 >= a3_5)
				a0->w0004 = (word16) (a4_14 + ~0x00);
			else
				a0->w0004 = 0x00;
		}
		else
			a0->w0004 = (word16) ((word32) a0->w0004 + 96 + (a4_14 << 5) >> 7);
		a0->b0009 = 0x01;
	}
}

// 2300E66A: Register (ptr32 Eq_40042) rc_check_valid_rate(Register (ptr32 Eq_40042) a0, Register Eq_39371 a1, Register out Eq_40045 a0Out)
// Called from:
//      rc_check_fixed_rate_config
struct Eq_40042 * rc_check_valid_rate(struct Eq_40042 * a0, Eq_39371 a1, union Eq_40045 & a0Out)
{
	Eq_40045 a0_23;
	struct Eq_39411 * a0_17;
	uint32 a5_21;
	uint32 a5_12 = a1 >> 11 & 0x07;
	struct Eq_40042 * s0_15 = a0;
	if (a5_12 > 0x01)
	{
		a0_23.u0 = 0x01;
		if (a5_12 > 0x03)
			goto l2300E6B2;
		word32 a4_79;
		word32 a5_80;
		s0_15 = a0 + rc_get_nss(a1, out a4_79, out a5_80);
		word32 a3_81;
		word32 a4_82;
		word32 a5_83;
		a0_17 = rc_get_mcs_index(a1, out a3_81, out a4_82, out a5_83);
		a5_21 = (word32) s0_15->b00B2;
	}
	else
	{
		word32 a3_84;
		word32 a4_85;
		word32 a5_86;
		a0_17 = rc_get_mcs_index(a1, out a3_84, out a4_85, out a5_86);
		a5_21 = (word32) a0->w00B6;
	}
	a0_23 = a5_21 >> a0_17 & 0x01;
l2300E6B2:
	a0Out = a0_23;
	return s0_15;
}

// 2300E6BC: Register Eq_2 rc_new_random_rate(Register Eq_2 a0, Register (ptr32 Eq_40095) a5, Register out Eq_40096 a1Out)
// Called from:
//      rc_update_bw_nss_max
//      rc_update_stats
//      rc_init
Eq_2 rc_new_random_rate(Eq_2 a0, struct Eq_40095 * a5, union Eq_40096 & a1Out)
{
	Eq_40096 a1_109 = (word32) *((word32) a0 + 0x00BB);
	uint32 a3_16 = (word32) *((word32) a0 + 177);
	a5->dw44C64EA6 = a5->dw0000;
	ui32 a7_14 = 0x00;
	Eq_40115 a5_18 = &a5->dw44C64EA6 >> 16;
	Eq_2 a4_108 = a3_16 << 0x1B >> 16;
	if (a1_109 != 0x00)
		a7_14 = (word32) a1_109 - 1 & 0x00FF;
	ui32 a4_129;
	if (a3_16 <= 0x01)
	{
		word32 a2_28 = (word32) *((word32) a0 + 0x00B9);
		ui32 a6_29 = (word32) *((word32) a0 + 0x00BA);
		word32 a1_32 = a6_29 - a2_28;
		ui32 a3_35 = (a5_18 & 0x007F | a1_32 + 0x01) + a2_28;
		a1_109 = a1_32 + 0x01;
		ui32 a3_37 = a3_35 & 0x00FF;
		if (((word32) *((word32) a0 + 0x00B6) >> (a3_35 & 0x00FF) & 0x01) == 0x00)
			a3_37 = a6_29;
		a4_108 |= a3_37;
		if (a3_37 == 0x00)
			a4_129 = a4_108 | 0x0400;
		else
		{
			if ((a3_37 + ~0x00 & 0x00FF) > 0x02)
				goto l2300E788;
			a4_129 = a4_108 | (a5_18 & 0x0400 | (word32) (*((word32) a0 + 0x00BE)) << 0x0A);
		}
l2300E784:
		a4_108 = (word32) (word16) a4_129;
		goto l2300E788;
	}
	else
	{
		if (a3_16 > 0x03)
			goto l2300E788;
		up32 a2_58 = (word32) *((word32) a0 + 0x00B9);
		if (a2_58 <= 0x03 && a5_18 << 0x14 < 0x00)
		{
			a1_109 = (word32) *((word32) a0 + 0x00BA);
			ui32 a3_115 = (a5_18 & 0x007F | (a1_109 - a2_58) + 0x01) + a2_58;
			Eq_40096 a3_116 = a3_115 & 0x00FF;
			if (((word32) *((word32) a0 + 0x00B6) >> (a3_115 & 0x00FF) & 0x01) == 0x00)
				a3_116 = a1_109;
			a4_108.u0 = 0x0400;
			if (a3_116 != 0x00)
			{
				a4_129 = (word32) *((word32) a0 + 0x00BE) << 0x0A | a5_18 & 0x0400 | a3_116;
				goto l2300E784;
			}
		}
		else
		{
			ui32 a6_107 = (word32) *((word32) a0 + 0x00B8);
			int32 a3_68 = a5_18 >> 0x03 & 0x03 | (word32) (*((word32) a0 + 188)) + 0x01;
			ui32 a2_72 = a5_18 & 7 | a6_107 + 1;
			word32 t3_71 = (word32) *((word32) a0 + 0x00BD);
			if (((word32) ((word32) a0 + a3_68 + 0x00B2) >> a2_72 & 1) != 0x00)
				a6_107 = a2_72 & 0x00FF;
			word32 a1_90 = a1_109 - a7_14;
			a1_109 = a1_90 + 0x01;
			a4_108 = (word32) (word16) (a4_108 | ((a5_18 >> 0x09 & 0x01 | t3_71 + 0x01) << 9 | a3_68 << 3) | (a5_18 >> 7 & 0x03 | a1_90 + 0x01) + a7_14 << 7) | a6_107;
		}
l2300E788:
		a1Out = a1_109;
		return a4_108;
	}
}

