pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0000.c
// 2300E814: Register uint32 rc_update_counters(Register (ptr32 Eq_38409) a0, Register ui32 a1, Register uint32 a2, Stack word32 dwArg1C, Stack word32 dwArg0128)
// Called from:
//      me_tx_cfm_singleton
uint32 rc_update_counters(struct Eq_38409 * a0, ui32 a1, uint32 a2, word32 dwArg1C, word32 dwArg0128)
{
	if (a0 > (struct Eq_38409 *) 0x09)
		return 0x09;
	uint32 a5_104 = (char *) a0 + 1107422224;
	if ((word32) a0->b4201EC2A != 0x00FF)
	{
		struct Eq_40325 * s0_39 = a0->ptr4201ED20;
		ui32 s1_142 = a1;
		uint32 s4_145 = a2;
		if (s0_39 == null)
			assert_err();
		s0_39->w00A6 = (word16) ((word32) s0_39->w00A6 + 0x01);
		s0_39->w00A4 = (word16) ((word32) s0_39->w00A4 + 0x01);
		struct Eq_40353 * s5_50 = (char *) s0_39 + 0x0080;
		while (s1_142 != 0x00)
		{
			struct Eq_40364 * a5_68 = s0_39 + ((word32) s5_50->w0000 + 0x0C) / 0x00AF;
			word32 a4_69 = (word32) a5_68->w0004;
			if (s4_145 > 0x03)
			{
				a5_68->w0004 = (word16) (a4_69 + 0x04);
				s1_142 += ~0x03;
				s4_145 += ~0x03;
			}
			else
			{
				uint32 s1_72 = s1_142 << 16;
				a5_68->w0004 = (word16) (a4_69 + (s1_72 >> 16));
				a5_68->w0006 = (word16) ((s1_72 >> 16) - s4_145 + (word32) a5_68->w0006);
				s4_145 = 0x00;
				s1_142 = 0x00;
			}
			if ((word32) a5_68->w0004 < (word32) a5_68->w0006)
				assert_err();
			++s5_50;
			if (s5_50 == (char *) s0_39 + 0x00A0)
				break;
		}
		a5_104 = (word32) s0_39->b00AE;
		if (a5_104 != 0x00)
		{
			if (a5_104 != 0x02)
				goto l2300E92E;
			ui32 a5_119 = (word32) a0->b4201ED2A;
			a5_104 = a5_119 & 0x01;
			if ((a5_119 & 0x01) == 0x00)
			{
				a5_104 = 0x03;
				goto l2300E94C;
			}
		}
		else
		{
			word32 a5_105 = (word32) s0_39->b00AC;
			if (a5_105 == 0x00)
			{
				a5_104 = 0x01;
l2300E94C:
				s0_39->b00AE = (byte) a5_104;
				goto l2300E92E;
			}
			s0_39->b00AC = (byte) (a5_105 + ~0x00);
			a5_104 = a5_105 + ~0x00;
		}
	}
l2300E92E:
	0x00 = dwArg0128;
	0x00 = dwArg1C;
	return a5_104;
}

// 2300E954: Register (ptr32 Eq_39411) rc_get_duration(Register Eq_39371 a0, Stack Eq_2 dwArg38, Register out (ptr32 Eq_39411) a0Out, Register out ptr32 a3Out, Register out ptr32 a4Out, Register out ptr32 a5Out, Register out (ptr32 Eq_40469) s2Out)
// Called from:
//      me_check_rc
//      rc_calc_tp
struct Eq_39411 * rc_get_duration(Eq_39371 a0, Eq_2 dwArg38, struct Eq_39411 & a0Out, ptr32 & a3Out, ptr32 & a4Out, ptr32 & a5Out, struct Eq_40469 & s2Out)
{
	ptr32 a5_26;
	ptr32 a3_18;
	word32 a5_83;
	ptr32 a4_16;
	struct Eq_39411 * a0_15 = rc_get_mcs_index(a0, out a3_18, out a4_16, out a5_83);
	struct Eq_40469 * s2_19 = a0 >> 11 & 7;
	struct Eq_39411 * s1_21 = a0_15;
	if (s2_19 > (struct Eq_40469 *) 0x01)
	{
		a5_26 = 0x03;
		a0_15 = null;
		if (s2_19 <= (struct Eq_40469 *) 0x03)
		{
			word32 a5_84;
			struct Eq_39411 ** a0_39 = rc_get_nss(a0, out a4_16, out a5_84);
			a5_26 = (char *) a0_39 + 1;
			s1_21 = (struct Eq_39411 *) *a0_39;
			a0_15 = a0_39 >> (char *) a0_39 + 1;
		}
	}
	else if (a0_15 <= (struct Eq_39411 *) 0x03)
	{
		s1_21 = a0_15 << 0x01;
		a5_26 = 0x230AC22C;
	}
	else
	{
		a5_26 = 587907980;
		s1_21 = a0_15->ptr0000;
	}
	0x00 = (int8) dwArg38;
	a0Out = a0_15;
	a3Out = a3_18;
	a4Out = a4_16;
	a5Out = a5_26;
	s2Out = s2_19;
	return s1_21;
}

// 2300E9E8: Register word32 rc_update_bw_nss_max(Register (ptr32 Eq_39289) a0, Register Eq_39286 a1, Register uint32 a2, Stack Eq_2 dwArgD8, Register out Eq_2 s0Out, Register out ptr32 s1Out, Register out Eq_39286 a1Out, Register out ptr32 a4Out, Register out (ptr32 Eq_39289) s3Out, Register out ptr32 s5Out, Register out ptr32 s6Out, Register out ptr32 s7Out)
// Called from:
//      me_sta_bw_nss_max_upd
//      me_rc_set_rate_req_handler
word32 rc_update_bw_nss_max(struct Eq_39289 * a0, Eq_39286 a1, uint32 a2, Eq_2 dwArgD8, union Eq_2 & s0Out, ptr32 & s1Out, union Eq_39286 & a1Out, ptr32 & a4Out, struct Eq_39289 & s3Out, ptr32 & s5Out, ptr32 & s6Out, ptr32 & s7Out)
{
	struct Eq_39289 * s3_157 = a0;
	ptr32 a4_169 = (char *) a0 + 432;
	Eq_2 s0_173 = a0->t4201ED20;
	if (s0_173 != 0x00)
	{
		if ((word32) *((word32) s0_173 + 0x00BB) != a1 || (word32) (*((word32) s0_173 + 188)) != a2)
		{
			*((word32) s0_173 + 0x00BB) = (byte) a1;
			if (a1 > 0x03)
				assert_err();
			*((word32) s0_173 + 188) = (byte) a2;
			if (a2 > 0x07)
				assert_err();
			a4_169 = (word32) *((word32) s0_173 + 0x00C6);
			if (a4_169 == 0x0FFFFFFF)
			{
				*((word32) s0_173 + 0x0A) = (word16) rc_get_lowest_rate_config(s0_173);
				(word32) s0_173 + ((word32) (*((word32) s0_173 + 0x00C0)) + 11) + 0x0A = (word32) (word16) rc_get_initial_rate_config(s0_173, dwLoc18);
				int32 s1_120 = 0x01;
				while (true)
				{
					struct Eq_39531 * a2_84 = (word32) *((word32) s0_173 + 0x00C0);
					struct Eq_40095 * a5_103 = (char *) a2_84 - 1;
					if (s1_120 >= (char *) a2_84 - 1)
						break;
l2300EB0E:
					word32 a1_295;
					word32 a0_90 = rc_new_random_rate(s0_173, a5_103, out a1_295);
					struct Eq_40095 * a3_101 = (word32) *((word32) s0_173 + 0x00C0);
					struct Eq_40601 * a4_102 = (word32) s0_173 + 0x0A;
					a5_103 = null;
					while (a5_103 < a3_101)
					{
						++a4_102;
						if ((word32) a4_102->wFFFFFFF4 == a0_90)
							goto l2300EB0E;
						a5_103 = (struct Eq_40095 *) ((char *) &a5_103->dw0000 + 1);
					}
					(word32) s0_173 + (s1_120 + 0x0C) + 0x0A = (word32) (word16) a0_90;
					s1_120 = (word32) (word16) (s1_120 + 0x01);
				}
				struct Eq_39531 * a3_127 = fp + -72;
				struct Eq_40609 * a5_128 = (word32) s0_173 + 8;
				struct Eq_39531 * a4_129 = null;
				while (a2_84 != a4_129)
				{
					a5_128->b0006 = 0x00;
					a5_128->b0007 = 0x01;
					a5_128->w0000 = 0x00;
					a5_128->b0005 = 0x00;
					a3_127->dw0000 = 0x00;
					a4_129 = (word32) (word16) ((char *) &a4_129->dw0000 + 1);
					++a5_128;
					++a3_127;
				}
				word32 s2_175;
				word32 s1_296;
				word32 s4_297;
				s0_173 = rc_update_retry_chain(rc_sort_samples_tp(s0_173, a3_127, a4_129, dwArgD8, out s3_157, out s6), fp + -72, a3_127, dwArgD8, out s1_296, out a1, out a4_169, out s2_175, out s4_297, out s5, out s7);
				struct Eq_40661 * a0_185 = (char *) s3_157 + 432 + s2_175;
				a0_185->b011A = (byte) ((word32) a0_185->b011A | 1);
			}
		}
		s0Out = s0_173;
		s1Out = dwLoc4C;
		a1Out = a1;
		a4Out = a4_169;
		s3Out = s3_157;
		s5Out = s5;
		s6Out = s6;
		s7Out = s7;
		return dwLoc08;
	}
	else
		assert_err();
}

// 2300EB62: Register ui32 rc_init_bcmc_rate(Register (ptr32 Eq_38359) a0, Register Eq_38290 a1, Register out Eq_38394 a4Out)
// Called from:
//      me_init_bcmc_rate
ui32 rc_init_bcmc_rate(struct Eq_38359 * a0, Eq_38290 a1, union Eq_38394 & a4Out)
{
	Eq_38394 a4_6 = a0->t010C;
	ui32 a3_7 = (word32) a0->w0118;
	int32 a5_12 = 0x00;
	if (a1 <= 0x03)
		a5_12 = (int32) (word16) (a3_7 & 0x0400);
	ui32 a1_15 = a1 | a5_12;
	(a1_15 | 0x20000000)->t0014 = a4_6;
	(a1_15 | 0x20000000)->t0018 = a4_6;
	(a1_15 | 0x20000000)->t001C = a4_6;
	(a1_15 | 0x20000000)->t0020 = a4_6;
	a4Out = a4_6;
	return a3_7;
}

// 2300EB8C: Register (ptr32 Eq_40042) rc_check_fixed_rate_config(Register (ptr32 Eq_40042) a0, Register Eq_39371 a1, Register out ptr32 a0Out)
// Called from:
//      me_rc_set_rate_req_handler
struct Eq_40042 * rc_check_fixed_rate_config(struct Eq_40042 * a0, Eq_39371 a1, ptr32 & a0Out)
{
	uint32 a5_5 = (word32) a0->b00B1;
	uint32 a3_8 = a1 >> 11 & 7;
	if (a5_5 < a3_8)
	{
		a0Out = 0x00;
		return s0;
	}
	if (a5_5 == 0x04)
	{
		if (a3_8 != a5_5)
			goto l2300EC18;
	}
	else if ((a5_5 + ~0x01 & 0x00FF) <= 0x01)
	{
		if ((a1 >> 11 & 0x06) != 0x00)
		{
l2300EBB2:
			if ((a1 >> 0x09 & 0x01) != 0x00 && (word32) a0->b00BD == 0x00 || (word32) a0->b00BB < (a1 >> 0x07 & 0x03))
				goto l2300EC18;
			word32 a5_145;
			word32 a4_144;
			if ((word32) a0->b00BC >= rc_get_nss(a1, out a4_144, out a5_145))
			{
l2300EBE0:
				ptr32 a0_72;
				struct Eq_40042 * s0_76 = rc_check_valid_rate(a0, a1, out a0_72);
				a0Out = a0_72;
				return s0_76;
			}
l2300EC18:
			a0Out = 0x00;
			return a0;
		}
		if ((word32) a0->b00B9 > 0x03)
			goto l2300EC18;
l2300EC06:
		if ((a1 >> 0x0A & 0x01) == 0x00 && (word32) a0->b00BE == 0x01)
			goto l2300EC18;
		goto l2300EBE0;
	}
	if ((a1 >> 11 & 0x06) != 0x00)
		goto l2300EBB2;
	goto l2300EC06;
}

