pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0000.c
// 2300EC26: Register uint32 rc_calc_tp(Register Eq_2 a0, Register ui32 a1, Stack Eq_2 dwArg18, Register out (ptr32 Eq_40839) s1Out, Register out (ptr32 Eq_40840) a0Out, Register out (ptr32 word32) a3Out, Register out (ptr32 Eq_40842) s2Out, Register out Eq_39371 s3Out, Register out ptr32 s4Out, Register out ptr32 s8Out)
// Called from:
//      me_check_rc
//      rc_update_stats
//      me_rc_stats_req_handler
uint32 rc_calc_tp(Eq_2 a0, ui32 a1, Eq_2 dwArg18, struct Eq_40839 & s1Out, struct Eq_40840 & a0Out, word32 & a3Out, struct Eq_40842 & s2Out, union Eq_39371 & s3Out, ptr32 & s4Out, ptr32 & s8Out)
{
	struct Eq_40840 * a0_22;
	struct Eq_40847 * a1_20 = (word32) a0 + (a1 + 0x0C);
	uint32 s0_21 = (word32) a1_20->w0008;
	if (s0_21 > 0x01FFF998)
	{
		s3 = (word32) a1_20->w000A;
		word32 a5_108;
		is_cck_group(s3, out a5_108) != 0x00;
		word32 a0_40;
		word32 a4_109;
		word32 a5_110;
		s1 = rc_get_duration(s3, dwArg18, out a0_40, out a3, out a4_109, out a5_110, out s2);
		s0_21 = s0_21 + 1000 >> s1 + a0_40 / 0x00C4;
		a0_22 = s0_21 + 1000000 >> 16;
	}
	else
		a0_22 = null;
	s1Out = s1;
	a0Out = a0_22;
	a3Out = a3;
	s2Out = s2;
	s3Out = s3;
	s4Out = dwArg04;
	s8Out = dwLoc1C;
	return s0_21;
}

// 2300EC9C: Register Eq_2 rc_update_stats(Register Eq_2 ra, Register Eq_2 a0, Stack (ptr32 Eq_6667) dwArg64, Stack Eq_2 dwArg78, Stack Eq_2 dwArg80, Stack Eq_2 dwArgA8, Register out (ptr32 Eq_40900) s0Out, Register out ptr32 s1Out, Register out ptr32 a0Out, Register out Eq_2 s2Out, Register out (ptr32 (arr Eq_39728)) s3Out, Register out ptr32 s4Out, Register out Eq_40906 s5Out, Register out Eq_2 s6Out, Register out ptr32 s7Out, Register out Eq_40909 s9Out)
// Called from:
//      me_check_rc
//      rc_init
Eq_2 rc_update_stats(Eq_2 ra, Eq_2 a0, struct Eq_6667 * dwArg64, Eq_2 dwArg78, Eq_2 dwArg80, Eq_2 dwArgA8, struct Eq_40900 & s0Out, ptr32 & s1Out, ptr32 & a0Out, union Eq_2 & s2Out, Eq_39728 (& s3Out, ptr32 & s4Out, union Eq_40906 & s5Out, union Eq_2 & s6Out, ptr32 & s7Out, union Eq_40909 & s9Out)
{
	word32 a5_848;
	word32 a6_849;
	word32 a7_850;
	word32 a3_846;
	word32 a4_847;
	word32 a2_845;
	word32 a1_844;
	memcpy(fp + -0x0088, (word32) a0 + 0x007C, 32, out a1_844, out a2_845, out a3_846, out a4_847, out a5_848, out a6_849, out a7_850);
	Eq_2 s0_112 = a0;
	word32 a4_50 = (word32) *((word32) a0 + 166);
	if (a4_50 != 0x00)
	{
		ui32 a5_51 = (word32) *((word32) a0 + 0x00A4);
		Eq_2 a3_52 = *((word32) a0 + 0x00A8);
		((word32) a0 + 0x00A4)->u0 = 0x00;
		*((word32) a0 + 0x00A8) = ((a5_51 << 16 ^ a4_50) << 5) + ((word32) a3_52 + 96) >> 7;
	}
	struct Eq_39531 * a2_64 = (word32) *((word32) a0 + 0x00C0);
	*((word32) a0 + 0x00AD) = 0x00;
	struct Eq_39531 * a3_116 = fp + -0x0068;
	struct Eq_40952 * a5_68 = (word32) a0 + 0x0E;
	struct Eq_39531 * a4_123 = null;
	Eq_39728 s3_139[] = fp + -0x0068;
	while (a2_64 != a4_123)
	{
		a3_116->dw0000 = 0x00;
		a5_68->b0000 = 0x00;
		a5_68->b0001 = 0x01;
		a4_123 = (word32) (word16) ((char *) &a4_123->dw0000 + 1);
		++a3_116;
		++a5_68;
	}
	ptr32 s1_156;
	word32 a1_87 = (word32) *((word32) a0 + 0x00C6);
	uint32 s2_128 = 0x00;
	ptr32 s4_113 = 0x0C;
	if (a1_87 == 0x0FFFFFFF)
	{
		while (s2_128 < (word32) (*((word32) s0_112 + 0x00C0)))
		{
			rc_calc_prob_ewma((word32) s0_112 + ((s2_128 + s4_113) + 0x04));
			word32 a0_107;
			ui32 s2_119;
			word32 s1_851;
			word32 s3_852;
			word32 s8_853;
			s0_112 = rc_calc_tp(s0_112, s2_128 & 0x00FF, dwLoc98, out s1_851, out a0_107, out a3_116, out s2_119, out s3_852, out s4_113, out s8_853);
			((s2_119 << 0x02) + (fp + -64))->dw0FD8 = a0_107;
			a4_123 = fp + -64;
			s2_128 = (word32) (word16) (s2_119 + 0x01);
		}
		word32 s2_857;
		word32 s6_854;
		word32 a4_856;
		word32 a1_855;
		s0_112 = rc_update_retry_chain(rc_sort_samples_tp(s0_112, a3_116, a4_123, dwArg78, out s3_139, out s6_854), s3_139, a3_116, dwArg78, out s1_156, out a1_855, out a4_856, out s2_857, out s4_113, out s5, out s7);
		if (s1_156 == 0x00)
		{
			up32 a3_165 = (word32) *((word32) s0_112 + 0x00C0);
			if (a3_165 > 0x09)
			{
				int32 s2_181 = (word32) ((word32) s0_112 + ((word32) (*((word32) s0_112 + 0x0080)) + 0x0C) + 0x0A);
				s4_113 = (word32) ((word32) s0_112 + ((word32) (*((word32) s0_112 + 0x0088)) + 0x0C) + 0x0A);
				s3_139 = (Eq_39728 (*)[]) ~0x00;
				s7 = 0x04;
				s5 = s2_181 >> 11 & 6;
				s9 = s2_181 & 0x0200;
				word32 a4_861;
				word32 a5_862;
				word32 t1_858;
				word32 a2_859;
				word32 a3_860;
				word32 a0_192;
				word32 a1_193;
				ra = memset(ra, fp + -0x0094, ~0x00, 0x0C, out t1_858, out a0_192, out a1_193, out a2_859, out a3_860, out a4_861, out a5_862);
				do
				{
					Eq_41338 a5_202 = s3_139;
					if ((a5_202 & 0x00FF) <= 0x04)
					{
						<anonymous> * a5_294 = *((char *) g_a230AC218 + (a5_202 & 0x00FF) * 0x04);
						struct Eq_40900 * s0_307;
						ptr32 s1_308;
						ptr32 a0_309;
						Eq_2 ra_312;
						Eq_2 s2_313;
						Eq_39728 (* s3_314)[];
						ptr32 s4_315;
						Eq_40906 s5_316;
						Eq_2 s6_317;
						ptr32 s7_318;
						Eq_40909 s9_320;
						word32 tp_334;
						a5_294();
						s0Out = s0_307;
						s1Out = s1_308;
						a0Out = a0_309;
						s2Out = s2_313;
						s3Out = s3_314;
						s4Out = s4_315;
						s5Out = s5_316;
						s6Out = s6_317;
						s7Out = s7_318;
						s9Out = s9_320;
						return ra_312;
					}
					Eq_41334 s3_219 = (char *) s3_139 + 1;
					a0_192 = rc_new_random_rate(s0_112, a5_202 & 0x00FF, out a1_193);
					s3_139 = s3_219 & 0x00FF;
				} while ((s3_219 & 0x00FF) != 0x06);
				up32 a7_222 = (word32) *((word32) s0_112 + 0x00C0);
				up32 a5_224 = 0x01;
				uint32 a3_225 = 0x00;
				while (a5_224 < a7_222)
				{
					struct Eq_41381 * a4_235 = (word32) s0_112 + (a5_224 + 0x0C);
					if ((int32) a4_235->w0008 < 0x00 && (word32) a4_235->b000C <= 0x0A || ((word32) (*((word32) s0_112 + 0x0080)) == a5_224 || ((word32) (*((word32) s0_112 + 0x0088)) == a5_224 || ((word32) (*((word32) s0_112 + 144)) == a5_224 || a3_225 > 0x05))))
						a5_224 = (word32) (word16) (a5_224 + 0x01);
					else
					{
						word32 a2_259 = (word32) ((a3_225 << 0x01) + (fp + -64))->wFFFFFFAC;
						if (a2_259 != 0x0FFFFFFF)
						{
							struct Eq_41436 * a6_262 = (word32) s0_112 + 0x0A;
							up32 a0_263;
							for (a0_263 = 0x00; a0_263 < a7_222; ++a0_263)
							{
								++a6_262;
								if ((word32) a6_262->wFFFFFFF4 == a2_259)
									goto l2300EF9E;
							}
							a4_235->w000A = (word16) a2_259;
							a4_235->w0008 = 0x00;
							a4_235->b000D = 0x00;
							a5_224 = (word32) (word16) (a5_224 + 0x01);
						}
l2300EF9E:
						++a3_225;
					}
					a4_235->w0004 = 0x00;
					a4_235->w0006 = 0x00;
				}
				*((word32) s0_112 + 4) = 0x00;
				goto l2300EE64;
			}
			struct Eq_41223 * a4_335 = (word32) s0_112 + 4;
			up32 a5_336 = 0x00;
			while (a3_165 != a5_336)
			{
				a4_335->w0000 = 0x00;
				a4_335->w0002 = 0x00;
				a5_336 = (word32) (word16) (a5_336 + 0x01);
				++a4_335;
			}
		}
l2300EDAC:
		s1_156 = 0x00;
		goto l2300EE64;
	}
	else
	{
		ui32 a3_346 = (word32) *((word32) a0 + 0x00AF);
		ui32 a5_347 = 0x00;
		if ((a3_346 & 32) == 0x00)
		{
			word32 s1_399 = (word32) *((word32) a0 + 0x0080);
			rc_calc_prob_ewma((word32) a0 + (s1_399 + 0x10));
			struct Eq_41050 * s1_404 = (word32) a0 + (s1_399 + 0x0C);
			s1_404->w0004 = 0x00;
			s1_404->w0006 = 0x00;
			*((word32) a0 + 4) = 0x00;
			goto l2300EDAC;
		}
		while (true)
		{
			uint32 a2_351 = a5_347 << 0x10;
			if (a2_351 >> 16 >= a4_123)
				break;
			if ((word32) ((word32) a0 + (a5_347 + 0x0C) + 0x0A) == a1_87)
				goto l2300EFF8;
			a5_347 = a5_347 + 0x01 & 0x00FF;
		}
		if (a4_123 == a2_351 >> 16)
		{
			ui32 a5_363 = a5_347 + ~0x00;
			struct Eq_41292 * a2_367 = (word32) a0 + ((a5_363 & 0x00FF) + 0x0C);
			a2_367->w000A = (word16) a1_87;
			a2_367->w0008 = 0x00;
			a5_347 = a5_363 & 0x00FF;
		}
l2300EFF8:
		uint32 a5_371 = a5_347 << 16;
		*((word32) a0 + 0x0080) = (word16) (a5_371 >> 16);
		*((word32) a0 + 0x0088) = (word16) (a5_371 >> 16);
		*((word32) a0 + 144) = (word16) (a5_371 >> 16);
		((word32) a0 + 0x007C)->u0 = 0x00;
		((word32) a0 + 0x0084)->u0 = 0x00;
		((word32) a0 + 0x008C)->u0 = 0x00;
		struct Eq_41284 * a2_380 = (word32) a0 + 4;
		struct Eq_39531 * a5_381 = null;
		while (a4_123 != a5_381)
		{
			a2_380->t0000.u0 = 0x00;
			a2_380->w0002 = 0x00;
			a5_381 = (word32) (word16) ((char *) &a5_381->dw0000 + 1);
			++a2_380;
		}
		*((word32) a0 + 0x00AF) = (byte) (a3_346 & -97 | 64);
		s1_156 = 0x01;
l2300EE64:
		struct Eq_40900 * a5_416 = (word32) s0_112 + 0x0080;
		struct Eq_41136 * a4_424 = fp + -0x0088 + 4;
		struct Eq_40900 * s0_425 = (word32) s0_112 + 0x00A0;
		do
		{
			if ((word32) a4_424->w0000 != (word32) a5_416->w0000)
			{
				s1_156 = 0x01;
				break;
			}
			++a5_416;
			++a4_424;
		} while (a5_416 != s0_425);
		Eq_2 s6_444 = *((word32) dwArgA8 + 0x00A8);
		Eq_2 s2_445 = *((word32) dwArgA8 + 200);
		ptr32 a0_447 = *((word32) dwArgA8 + 0x0C);
		s0Out = s0_425;
		s1Out = s1_156;
		a0Out = a0_447;
		s2Out = s2_445;
		s3Out = s3_139;
		s4Out = s4_113;
		s5Out = s5;
		s6Out = s6_444;
		s7Out = s7;
		s9Out = s9;
		return ra;
	}
}

