pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0000.c
// 2300FA38: Register Eq_2 rxu_mpdu_upload_and_indicate.constprop.11(Register (ptr32 Eq_42948) a3, Register ptr32 mstatus, Stack Eq_2 dwArg18, Register out Eq_2 a4Out, Register out Eq_2 a5Out, Register out (ptr32 Eq_42953) s5Out)
// Called from:
//      rxu_mgt_frame_check
//      rxu_cntrl_frame_handle
Eq_2 rxu_mpdu_upload_and_indicate.constprop.11(struct Eq_42948 * a3, ptr32 mstatus, Eq_2 dwArg18, union Eq_2 & a4Out, union Eq_2 & a5Out, struct Eq_42953 & s5Out)
{
	ui32 a4_21 = (word32) g_b4202153A;
	Eq_2 a0_23 = a3->t0004;
	ui32 a5_26 = (word32) g_b42021539 << 16 | a4_21 << 8;
	word32 a3_27 = ((Eq_582550[]) 76)[a4_21].dw0000;
	g_b42021562 = 0x00;
	ui32 a5_30 = a5_26 | a4_21 << 8;
	(a5_30 | 2)->dw004C = a3_27;
	struct Eq_42953 * s5_35 = (a5_30 | 2)->ptr0008;
	struct Eq_42992 * a5_36 = s5_35->ptr0018;
	word32 a3_179;
	uint32 a0_41 = rxu_cntrl_machdr_len_get((word32) a5_36->b0000 | (word32) a5_36->b0001 << 8, out a3_179);
	word32 s4_45 = (word32) g_b42021538;
	Eq_2 s0_29 = a0_23;
	ui32 s2_46 = s4_45 - a0_41;
	if ((s2_46 & 0x00FF) != 0x00)
	{
		if ((s2_46 & 0x00FF & 1) != 0x00)
			assert_warn();
		struct Eq_42992 * a2_63 = s5_35->ptr0018;
		struct Eq_42992 * a5_70 = a2_63 + ((a0_41 >> 0x01 & 0x00FF) + 0x7FFFFFFF << 1) / 2;
		struct Eq_43087 * a4_71 = a2_63 + (((word32) g_b42021538 >> 1) + 0x7FFFFFFF << 1) / 2;
		while (a5_70 >= a2_63)
		{
			a5_70 = (struct Eq_42992 *) ((char *) a5_70 - 2);
			a4_71 = (struct Eq_43087 *) ((char *) a4_71 - 2);
			a4_71[1] = (struct Eq_43087) (word16) (word32) a5_70[1];
		}
		s0_29 = a5_70[2];
		a5_70[0x0E] = (struct Eq_42992) (word16) ((word32) a5_70[0x0E] - (s2_46 & 0x00FF));
		word32 a5_87 = (word32) g_b42021538;
		g_b42021562 = (byte) (s2_46 & 0x00FF);
		g_b42021538 = (byte) (a0_41 + (a5_87 - s4_45));
	}
	g_dw420215A8 = 0x00;
	struct Eq_43027 * a5_111;
	word32 s2_180;
	Eq_2 a4_110 = rxl_mpdu_transfer(s0_29, mstatus, dwArg18, out a5_111, out s2_180);
	__csrrc(mstatus, 0x08);
	Eq_2 s0_116 = a5_111->t0004;
	*((word32) s0_116 + 28) = 0x03;
	*((word32) a4_110 + 20) = s0_116;
	Eq_2 a5_120 = (word32) a5_111->w001C;
	*((word32) a5_120 + 24) = s0_116;
	__csrrc(mstatus, 0x08);
	co_list_push_back(s0_116, a5_120);
	__csrrs(mstatus, 0x08);
	__csrrs(mstatus, 0x08);
	a4Out = a4_110;
	a5Out = a5_120;
	s5Out = s5_35;
	return s0_116;
}

// 2300FB66: Register Eq_2 rxu_mgt_frame_check(Register Eq_2 ra, Register Eq_2 s0, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 s10, Register ptr32 fflags, Register ptr32 frm, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg58, Stack Eq_2 dwArg0138, Register out Eq_2 a1Out, Register out Eq_2 a4Out, Register out (ptr32 Eq_39231) a5Out, Register out (ptr32 Eq_43153) s5Out, Register out (ptr32 Eq_43154) s6Out, Register out (ptr32 Eq_43155) s7Out, Register out Eq_2 s10Out, Register out ptr32 fflagsOut, Register out ptr32 frmOut)
// Called from:
//      rxu_cntrl_frame_handle
Eq_2 rxu_mgt_frame_check(Eq_2 ra, Eq_2 s0, Eq_2 a0, Eq_2 a1, Eq_2 s10, ptr32 fflags, ptr32 frm, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg58, Eq_2 dwArg0138, union Eq_2 & a1Out, union Eq_2 & a4Out, struct Eq_39231 & a5Out, struct Eq_42953 & s5Out, struct Eq_43154 & s6Out, struct Eq_43155 & s7Out, union Eq_2 & s10Out, ptr32 & fflagsOut, ptr32 & frmOut)
{
	Eq_2 s4_238;
	Eq_2 a4_1217 = (word32) *((word32) s0 + 1) << 8 | (word32) (*s0);
	struct Eq_43172 * s5_31 = *((word32) a0 + 4);
	struct Eq_39231 * a5_1220 = a4_1217 & 0x0400;
	if ((a4_1217 & 0x0400) != 0x00)
	{
l2300FD06:
		s4_238.u0 = 0x01;
		goto l2300FEAA;
	}
	ui32 a5_40 = (word32) *((word32) s0 + 22);
	s4_238.u0 = 0x01;
	a5_1220 = a5_40 & 0x0F;
	if ((a5_40 & 0x0F) != 0x00)
	{
l2300FEAA:
		a1Out = a1;
		a4Out = a4_1217;
		a5Out = a5_1220;
		s5Out = s4;
		s6Out = s6;
		s7Out = s7;
		s10Out = s10;
		fflagsOut = fflags;
		frmOut = frm;
		return s4_238;
	}
	Eq_2 a5_43 = 0x00FF;
	if (a1 != 0x00FF)
	{
l2300FC82:
		struct Eq_39231 * s2_165;
		struct Eq_43202 * s5_168;
		Eq_2 ra_163 = phyif_utils_decode(ra, (char *) s5_31 + 40, fp + -73, fflags, frm, out a1, out s2_165, out s5_168, out s6, out fflags, out frm);
		ui32 s8_187 = (word32) *((word32) s0 + 1) << 8 | (word32) (*s0);
		int32 s9_189 = (word32) g_b42021538;
		a5_1220 = (word32) g_b4202153A;
		word32 s3_193 = (word32) s5_168->w001C;
		s7 = (struct Eq_43155 *) &g_w42021530;
		if (a5_1220 == (struct Eq_39231 *) 0x00FF)
		{
			if (s2_165 == a5_1220)
			{
				a4_1217.u0 = 0x04;
				s10.u0 = 0x00;
l2300FCDC:
				Eq_2 s4_218;
				struct Eq_42948 * a3_215 = (struct Eq_42948 *) 80;
				if ((s8_187 & 252) == 80)
				{
					if (s10 == 0x00)
						goto l2300FD00;
					s6 = (struct Eq_43154 *) 0x01;
					s4_218.u0 = 0x04;
l2300FE20:
					Eq_2 a0_481;
					word32 s1_490;
					word32 s2_491;
					word32 s4_493;
					word32 s8_494;
					word32 s0_1442;
					word32 a2_1443;
					word32 a6_1445;
					word32 a3_1444;
					word32 s3_492;
					ke_msg_alloc(ra_163, 0x02FFFC00, s4_218, (word32) (word16) (s3_193 + 28), a4_1217, mstatus, s10, out s0_1442, out s1_490, out a0_481, out a1, out a2_1443, out a3_1444, out a4_1217, out a5_1220, out a6_1445, out s2_491, out s3_492, out s4_493, out s8_494);
					s10 = a0_481;
					if (a0_481 != 0x00)
					{
						word32 a5_1450;
						word32 a4_1449;
						Eq_2 a3_502 = phy_get_channel(fp + -72, out a4_1449, out a5_1450);
						if (s6 == null)
						{
							if ((s9_189 & 1) != 0x00)
								assert_warn();
							s3_492 = (word32) (word16) (s3_492 - s9_189);
						}
						*a0_481 = (word16) s3_492;
						ui32 s3_535 = s3_492 + 0x03;
						int32 a5_537;
						for (a5_537 = 0x00; (s3_535 & -4) != a5_537; a5_537 += 0x04)
							*((word32) a3_502 + 28) = (word32) a0_481 + a5_537;
						uint32 a5_559 = (word32) s7->b000A;
						*((word32) a0_481 + 2) = (word16) s8_494;
						*((word32) a0_481 + 7) = (byte) s2_491;
						*((word32) a0_481 + 8) = (byte) a5_559;
						((word32) a0_481 + 26)->u0 = 0x00;
						((word32) a0_481 + 25)->u0 = 0x00;
						*((word32) a0_481 + 4) = (word16) (a5_559 >> 0x10);
						*((word32) a0_481 + 6) = (byte) a5_559;
						*((word32) a0_481 + 24) = (byte) (int32) s5_168->b0033;
						if (s4_493 == 0x07 && s1_490 == 0x00)
						{
							*((word32) a0_481 + 16) = s5_168->dw0020;
							*((word32) a0_481 + 20) = s5_168->dw0024;
							*((word32) a0_481 + 27) = (byte) (s5_168->t0028 >> 0x0C & 0x0F);
						}
						word32 s2_1458;
						word32 s3_1459;
						word32 s1_1454;
						word32 a2_1456;
						word32 a3_1457;
						word32 a0_1455;
						word32 s4_1460;
						word32 s8_1461;
						ke_msg_send(a0_481, mstatus, out s1_1454, out a0_1455, out a1, out a2_1456, out a3_1457, out a4_1217, out a5_1220, out s2_1458, out s3_1459, out s4_1460, out s8_1461);
					}
					s4_238.u0 = 0x00;
					goto l2300FEAA;
				}
				if ((s8_187 & 252) <= 80)
				{
					a3_215 = (struct Eq_42948 *) 32;
					if ((s8_187 & 252) == 32)
						goto l2300FD4E;
					if ((s8_187 & 252) <= 32)
					{
						if ((s8_187 & 252) != 0x00)
						{
							if ((s8_187 & 252) != 0x10)
								goto l2300FD00;
l2300FDBA:
							if (a4_1217 == 0x00)
								goto l2300FDBC;
							goto l2300FD00;
						}
						goto l2300FD4E;
					}
					a3_215 = (struct Eq_42948 *) 48;
					if ((s8_187 & 252) == 48)
						goto l2300FDBA;
					if ((s8_187 & 252) == 64)
					{
l2300FD4E:
						if (apm_embedded_enabled(s10, out a4_1217) == 0x00)
							goto l2300FD00;
						goto l2300FE1C;
					}
					goto l2300FD00;
				}
				a3_215 = (struct Eq_42948 *) 0x00B0;
				if ((s8_187 & 252) == 0x00B0)
				{
l2300FD7E:
					if (a4_1217 == 0x00)
					{
l2300FDBC:
						s6 = null;
						s4_218.u0 = 0x06;
						goto l2300FE20;
					}
					goto l2300FD4E;
				}
				if ((s8_187 & 252) <= 0x00B0)
				{
					a3_215 = (struct Eq_42948 *) 0x0080;
					if ((s8_187 & 252) == 0x0080)
					{
						word32 a0_317;
						Eq_2 s2_322;
						word32 a2_1440;
						word32 a4_1441;
						ke_state_get(0x04, dwLoc28, out a0_317, out a2_1440, out a4_1441, out s2_322);
						if (a0_317 == 0x01)
						{
							s6 = (struct Eq_43154 *) 0x01;
							s4_218.u0 = 0x04;
						}
						else
						{
							s6 = null;
							s4_218.u0 = 0x00FF;
						}
						a4_1217.u0 = 0x00FF;
						if (s2_322 != 0x00FF)
						{
							if ((word32) *((byte) s10.u0 + 88) != 0x00)
								ra_163 = me_beacon_check(ra_163, (word32) g_b4202153A, s3_193, s0, s2_322, s8_187, fflags, frm, mstatus, dwArg08, dwArg0138, out a3_215, out a4_1217, out s3_193, out s4_218, out s5_168, out s6, out s7);
						}
						else
						{
							word32 a0_334;
							word32 a4_1447;
							word32 a2_1446;
							word32 s2_1448;
							ke_state_get(0x04, dwLoc28, out a0_334, out a2_1446, out a4_1447, out s2_1448);
							a4_1217.u0 = 0x01;
							if (a0_334 != 0x01 && apm_embedded_enabled(s10, out a4_1217) != 0x00)
							{
l2300FE1C:
								s6 = (struct Eq_43154 *) 0x01;
								s4_218.u0 = 0x07;
								goto l2300FE20;
							}
						}
						if (s4_218 != 0x00FF)
							goto l2300FE20;
						goto l2300FD00;
					}
					a3_215 = (struct Eq_42948 *) 0x00A0;
					if ((s8_187 & 252) != 0x00A0)
						goto l2300FD00;
l2300FD74:
					a3_215 = (struct Eq_42948 *) 0x00FF;
					s4_238.u0 = 0x00;
					if (s2_165 == (struct Eq_39231 *) 0x00FF)
						goto l2300FEAA;
					goto l2300FD7E;
				}
				a3_215 = (struct Eq_42948 *) 0x00C0;
				if ((s8_187 & 252) == 0x00C0)
					goto l2300FD74;
				if ((s8_187 & 252) != 0x00D0)
					goto l2300FD00;
				a3_215 = (word32) s0 + s9_189;
				if (s2_165 == (struct Eq_39231 *) 0x00FF)
				{
l2300FD00:
					word32 s5_1439;
					a1 = rxu_mpdu_upload_and_indicate.constprop.11(a3_215, mstatus, s10, out a4_1217, out a5_1220, out s5_1439);
					goto l2300FD06;
				}
				word32 a5_231 = (word32) a3_215->b0000;
				if (a5_231 != 0x07)
				{
					if (a5_231 != 0x08)
					{
						a4_1217.u0 = 0x03;
						if (a5_231 != 0x03)
							goto l2300FD00;
						s4_218.u0 = 0x08;
					}
					else
					{
						a5_1220 = s3_193 - s9_189;
						a4_1217.u0 = 0x03;
						s4_238.u0 = 0x00;
						if (a5_1220 <= (struct Eq_39231 *) 0x03)
							goto l2300FEAA;
						struct Eq_43620 * a4_301 = (word32) g_b4202153A;
						if (a4_301 == (struct Eq_43620 *) 0x00FF)
							goto l2300FD00;
						a4_1217 = (word32) a3_215->b0001;
						if (((word32) a4_301->b420205A6 | a4_1217) != 0x00)
							goto l2300FD00;
						s4_218.u0 = 0x06;
					}
					s6 = null;
					goto l2300FE20;
				}
				Eq_39233 a2_244;
				word32 a5_233 = (word32) a3_215->b0001;
				if (a5_233 != 0x00)
				{
					if (a5_233 != 0x01)
						goto l2300FD00;
					int32 a5_252 = s2_165->dw4201ECFC;
					a4_1217 = (char *) &s2_165->t0000 + 432;
					s4_238.u0 = 0x00;
					a5_1220 = a5_252 & 0x02;
					if ((a5_252 & 0x02) == 0x00)
						goto l2300FEAA;
					a2_244.u0 = 0x00FF;
					if (((word32) a3_215->b0002 & 0x01) != 0x00)
						a2_244.u0 = 0x00;
					a1.u0 = 0x00FF;
l2300FE78:
					word32 s5_1453;
					word32 s3_1452;
					word32 s1_1451;
					me_sta_bw_nss_max_upd(s2_165, a1, a2_244, dwArg58, out s1_1451, out a1, out a4_1217, out a5_1220, out s3_1452, out s4_238, out s5_1453, out s6, out s7);
					goto l2300FEAA;
				}
				int32 a5_240 = s2_165->dw4201ECFC;
				a4_1217 = (char *) &s2_165->t0000 + 432;
				s4_238.u0 = 0x00;
				a5_1220 = a5_240 & 0x02;
				if ((a5_240 & 0x02) == 0x00)
					goto l2300FEAA;
				a1 = (word32) a3_215->b0002;
				a5_1220 = (struct Eq_39231 *) 0x01;
				a2_244.u0 = 0x00FF;
				if (a1 <= 0x01)
					goto l2300FE78;
				goto l2300FEAA;
			}
			a5_1220 = (word32) s2_165->b4201EC2A;
			g_b4202153A = (byte) a5_1220;
		}
		a5_1220 = (struct Eq_39231 *) ((char *) &a5_1220->t0000 + 0x05D8);
		s10 = &a5_1220->b4201ED01 + 4727;
		a4_1217 = (word32) a5_1220->b4201FFCE;
		goto l2300FCDC;
	}
	if ((s5_31->dw0040 & 0x0600) != 0x00)
	{
l2300FC7A:
		g_b4202153A = (byte) a5_43;
		goto l2300FC82;
	}
	word32 a5_50;
	Eq_2 a3_48 = g_t42020B30;
	if (a4_1217 != 0x00B0)
	{
		a5_50 = 0x01;
		if (a4_1217 != 0x00)
		{
l2300FC22:
			while (a3_48 != 0x00)
			{
				if ((word32) *((word32) a3_48 + 80) == (word32) (*((word32) s0 + 4)) && ((word32) (*((word32) a3_48 + 81)) == (word32) (*((word32) s0 + 5)) && ((word32) (*((word32) a3_48 + 82)) == (word32) (*((word32) s0 + 6)) && ((word32) (*((word32) a3_48 + 83)) == (word32) (*((word32) s0 + 7)) && ((word32) (*((word32) a3_48 + 84)) == (word32) (*((word32) s0 + 8)) && (word32) (*((word32) a3_48 + 0x0055)) == (word32) (*((word32) s0 + 9)))))))
				{
					word32 a4_84 = (word32) *((word32) a3_48 + 86);
					if (a4_84 == 0x00)
					{
						if (a5_50 != 0x00)
							goto l2300FC76;
					}
					else if (a4_84 == 0x02 && a5_50 == 0x00)
					{
l2300FC76:
						a5_43 = (word32) *((word32) a3_48 + 87);
						goto l2300FC7A;
					}
				}
				a3_48 = *a3_48;
			}
			a5_43 = a1;
			goto l2300FC7A;
		}
	}
	a5_50 = 0x01;
	if ((word32) *((word32) s0 + 4) == (word32) (*((word32) s0 + 16)) && ((word32) (*((word32) s0 + 5)) == (word32) (*((word32) s0 + 0x0011)) && ((word32) (*((word32) s0 + 6)) == (word32) (*((word32) s0 + 18)) && ((word32) (*((word32) s0 + 7)) == (word32) (*((word32) s0 + 19)) && (word32) (*((word32) s0 + 8)) == (word32) (*((word32) s0 + 20))))))
		a5_50 = (word32) (*((word32) s0 + 9) - *((word32) s0 + 21) != 0x00);
	goto l2300FC22;
}

// 2300FFB6: void rxu_cntrl_init()
// Called from:
//      rxl_init
void rxu_cntrl_init()
{
	co_list_init(&g_dw42021570);
	co_list_init(&g_t42021568);
	co_list_init(&g_t4202157C);
	co_list_init(&g_t42021584);
	g_w42021592 = ~0x00;
}

