pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_text_0000.c
// 2300FFFA: Register Eq_2 rxu_cntrl_frame_handle(Register Eq_2 ra, Register Eq_2 s1, Register Eq_2 a0, Register Eq_2 a1, Register Eq_2 a2, Register Eq_2 a4, Register Eq_2 s4, Register Eq_2 s5, Register Eq_2 s6, Register Eq_2 s7, Register Eq_2 s10, Register ptr32 fflags, Register ptr32 frm, Register ptr32 mstatus, Stack Eq_2 dwArg08, Stack Eq_2 dwArg18, Stack Eq_2 dwArg24, Stack Eq_2 dwArg28, Stack Eq_2 dwArg38, Stack Eq_2 dwArg58, Stack Eq_2 dwArg68, Stack Eq_2 dwArg74, Stack Eq_2 dwArg78, Stack Eq_2 dwArg84, Stack Eq_2 dwArg88, Stack Eq_2 dwArg94, Stack Eq_2 dwArg98, Stack Eq_2 dwArg9C, Stack Eq_2 dwArgA4, Stack Eq_2 dwArgA8, Stack Eq_2 dwArgB8, Stack Eq_2 dwArgC8, Stack Eq_2 dwArgD8, Stack Eq_2 dwArgE8, Stack Eq_2 dwArgF8, Stack Eq_2 dwArg0104, Stack Eq_2 dwArg010C, Stack Eq_2 dwArg0118, Register out ptr32 s0Out, Register out Eq_2 s1Out, Register out ptr32 a0Out, Register out Eq_2 a1Out, Register out ptr32 a3Out, Register out Eq_2 a4Out, Register out ptr32 s3Out, Register out ptr32 s4Out, Register out Eq_2 s5Out, Register out Eq_2 s6Out, Register out Eq_2 s7Out, Register out Eq_2 s10Out, Register out ptr32 fflagsOut, Register out ptr32 frmOut)
// Called from:
//      rxl_cntrl_evt
Eq_2 rxu_cntrl_frame_handle(Eq_2 ra, Eq_2 s1, Eq_2 a0, Eq_2 a1, Eq_2 a2, Eq_2 a4, Eq_2 s4, Eq_2 s5, Eq_2 s6, Eq_2 s7, Eq_2 s10, ptr32 fflags, ptr32 frm, ptr32 mstatus, Eq_2 dwArg08, Eq_2 dwArg18, Eq_2 dwArg24, Eq_2 dwArg28, Eq_2 dwArg38, Eq_2 dwArg58, Eq_2 dwArg68, Eq_2 dwArg74, Eq_2 dwArg78, Eq_2 dwArg84, Eq_2 dwArg88, Eq_2 dwArg94, Eq_2 dwArg98, Eq_2 dwArg9C, Eq_2 dwArgA4, Eq_2 dwArgA8, Eq_2 dwArgB8, Eq_2 dwArgC8, Eq_2 dwArgD8, Eq_2 dwArgE8, Eq_2 dwArgF8, Eq_2 dwArg0104, Eq_2 dwArg010C, Eq_2 dwArg0118, ptr32 & s0Out, union Eq_2 & s1Out, ptr32 & a0Out, union Eq_2 & a1Out, ptr32 & a3Out, union Eq_2 & a4Out, ptr32 & s3Out, ptr32 & s4Out, union Eq_2 & s5Out, union Eq_2 & s6Out, union Eq_2 & s7Out, union Eq_2 & s10Out, ptr32 & fflagsOut, ptr32 & frmOut)
{
	ptr32 s3_1136;
	Eq_2 s6_1129 = *((word32) a0 + 4);
	Eq_2 s5_1114 = *((word32) s6_1129 + 64);
	Eq_2 s0_1057 = 0x42021530;
	Eq_2 a5_1030 = s5_1114 << 0x12;
	if (s5_1114 << 0x12 >= 0x00)
	{
l2301002C:
		s3_1136 = 0x00;
		goto l23010266;
	}
	ui32 s8_38 = (word32) *s1;
	((word32) s6_1129 + 76)->u0 = 0x00;
	g_b42021539 = ~0x00;
	g_b4202153A = ~0x00;
	g_w42021530 = (word16) ((word32) *((word32) s1 + 1) << 8 | (word32) (*s1));
	ui32 a5_47 = (word32) *((word32) s1 + 23);
	ui32 a4_48 = (word32) *((word32) s1 + 22);
	g_b42021560 = 0x00;
	g_w42021532 = (word16) (a5_47 << 8 | a4_48);
	uint32 a5_56 = (word32) *((word32) s1 + 23) << 8 | (word32) (*((word32) s1 + 22));
	g_w42021534 = (word16) (a5_56 >> 0x04);
	g_b42021536 = (byte) (a5_56 & 0x0F);
	Eq_2 s2_35 = a0;
	ui32 a5_64 = (word32) *((word32) s1 + 1) << 8 | (word32) (*s1);
	if ((a5_64 & 0x0088) == 0x0088)
	{
		ui32 a5_70;
		if ((a5_64 & 0x0300) == 0x0300)
			a5_70 = (word32) *((word32) s1 + 30);
		else
			a5_70 = (word32) *((word32) s1 + 24);
		g_b42021537 = (byte) (a5_70 & 0x07);
	}
	else
		g_b42021537 = 0x00;
	word32 a5_100;
	struct Eq_42948 * a3_1141;
	g_b42021538 = (byte) rxu_cntrl_machdr_len_get((word32) *s1.u0 | (word32) (*((byte) s1.u0 + 1)) << 8, out a3_1141);
	if (((word32) *((byte) s1.u0 + 1) & 0x01) != 0x00)
	{
		g_t42021554 = (word16) (word32) *((word32) s1 + 16);
		g_w42021556 = (word16) (word32) *((word32) s1 + 18);
		a5_100 = (word32) *((word32) s1 + 20);
	}
	else
	{
		g_t42021554 = (word16) (word32) *((word32) s1 + 4);
		g_w42021556 = (word16) (word32) *((word32) s1 + 6);
		a5_100 = (word32) *((word32) s1 + 8);
	}
	word32 a5_114;
	g_w42021558 = (word16) a5_100;
	ui32 a5_108 = (word32) *((byte) s1.u0 + 1) << 8 | (word32) (*s1.u0);
	if ((a5_108 & 0x0200) != 0x00)
	{
		if ((a5_108 & 0x0100) != 0x00)
		{
			g_w4202155A = (word16) (word32) *((word32) s1 + 24);
			g_w4202155C = (word16) (word32) *((word32) s1 + 26);
			a5_114 = (word32) *((word32) s1 + 28);
		}
		else
		{
			g_w4202155A = (word16) (word32) *((word32) s1 + 16);
			g_w4202155C = (word16) (word32) *((word32) s1 + 18);
			a5_114 = (word32) *((word32) s1 + 20);
		}
	}
	else
	{
		g_w4202155A = (word16) (word32) *((word32) s1 + 0x0A);
		g_w4202155C = (word16) (word32) *((word32) s1 + 0x0C);
		a5_114 = (word32) *((word32) s1 + 0x0E);
	}
	Eq_2 a1_1041;
	g_w4202155E = (word16) a5_114;
	if (s5_1114 << 0x06 >= 0x00)
	{
		if ((word32) g_b4202159F != 0x00 && ((s5_1114 & 0x0200) == 0x00 && ((word32) g_t42021598 == (word32) (*((word32) s1 + 0x0A)) && ((word32) g_b42021599 == (word32) (*((word32) s1 + 11)) && ((word32) g_t4202159A == (word32) (*((word32) s1 + 0x0C)) && ((word32) g_b4202159B == (word32) (*((word32) s1 + 0x0D)) && ((word32) g_t4202159C == (word32) (*((word32) s1 + 0x0E)) && (word32) g_b4202159D == (word32) (*((word32) s1 + 0x0F)))))))))
		{
			a3_1141 = (struct Eq_42948 *) 0x01000400;
			if ((((word32) *((word32) s1 + 1) << 8 | (word32) (*s1)) & 0x01000400) == 0x01000000)
				g_t4202159E.u0 = 0x01;
			else
				g_t4202159E.u0 = 0x00;
		}
		if ((s8_38 & 0x0C) != 0x00)
		{
			if ((s8_38 & 0x0C) == 0x08)
			{
				struct Eq_44205 * a0_1138 = vif_mgmt_get_first_ap_inf();
				if (a0_1138 != null)
				{
					a3_1141 = (word32) *((word32) s1 + 4);
					if (a3_1141 == (word32) a0_1138->b0050)
					{
						a3_1141 = (word32) *((word32) s1 + 5);
						if (a3_1141 == (word32) a0_1138->b0051)
						{
							a3_1141 = (word32) *((word32) s1 + 6);
							if (a3_1141 == (word32) a0_1138->b0052)
							{
								a3_1141 = (word32) *((word32) s1 + 7);
								if (a3_1141 == (word32) a0_1138->b0053)
								{
									a3_1141 = (word32) *((word32) s1 + 8);
									if (a3_1141 == (word32) a0_1138->b0054 && (word32) (*((word32) s1 + 9)) == (word32) a0_1138->b0055)
									{
										apm_send_mlme(ra, a0_1138, (struct Eq_44269 *) 0x00C0, (word32) s1 + 0x0A, 0x00, (struct Eq_42953 *) 0x01, fflags, frm, mstatus, dwLoc18, dwArg24, dwArg38, dwArg68, dwArg88, dwArg94, dwArg9C, dwArgA8, dwArgC8, dwArgD8, dwArg0118, out a1, out a4, out a5_1030, out s5_1114, out s6_1129, out s7, out s10);
										goto l2301002C;
									}
								}
							}
						}
					}
				}
			}
			a1 = rxu_mpdu_upload_and_indicate.constprop.11(a3_1141, mstatus, s6, out a4, out a5_1030, out s5_1114);
			s3_1136 = 0x01;
l23010266:
			if (a5_1030 != 0x00)
			{
				word32 a5_2654;
				a4 = ke_evt_set(0x20000000, a4, mstatus, out a5_2654);
			}
			0x00 = (int8) dwArg010C;
			s0Out = dwArgCC;
			s1Out = dwLoc4C;
			a0Out = s3_1136;
			a1Out = a1;
			a3Out = s2;
			a4Out = a4;
			s3Out = s3_1136;
			s4Out = dwArg0168;
			s5Out = s5_1114;
			s6Out = s6_1129;
			s7Out = s7;
			s10Out = s10;
			fflagsOut = fflags;
			frmOut = frm;
			return dwLoc08;
		}
		if (((word32) *((word32) s1 + 1) >> 3 & 0x01) != 0x00 && (word32) g_w42021592 == ((word32) (*((byte) s1.u0 + 23)) << 8 | (word32) (*((byte) s1.u0 + 22))))
		{
			word32 a3_2688;
			word32 a2_2687;
			if (memcmp(s1 + 0x0A, 0x4202158C, 0x06, out a1, out a2_2687, out a3_2688, out a4, out a5_1030) == 0x00)
				goto l2301002C;
		}
		g_w42021592 = (word16) ((word32) *((byte) s1.u0 + 23) << 8 | (word32) (*((byte) s1.u0 + 22)));
		word32 a4_2683;
		word32 a3_2682;
		word32 a5_2684;
		word32 a2_2681;
		word32 a6_2685;
		word32 a7_2686;
		memcpy(0x4202158C, s1 + 0x0A, 0x06, out a1, out a2_2681, out a3_2682, out a4_2683, out a5_2684, out a6_2685, out a7_2686);
		if ((word32) g_w42021530 << 0x11 < 0x00)
		{
			a5_1030 = s5_1114 & 28;
			a4.u0 = 0x14;
			if ((s5_1114 & 28) != 0x14)
				goto l2301002C;
			word32 a2_2689;
			word32 a3_2690;
			if (rxu_cntrl_protected_handle(s1, s5_1114, out a1, out a2_2689, out a3_2690, out a4, out a5_1030) == 0x00)
				goto l2301002C;
		}
		a1_1041.u0 = 0x00FF;
l230102CA:
		s3_1136 = rxu_mgt_frame_check(ra, s0_1057, a0, a1_1041, s10, fflags, frm, mstatus, dwLoc48, dwArg08, dwArgE8, out a1, out a4, out a5_1030, out s5_1114, out s6_1129, out s7, out s10, out fflags, out frm);
		goto l23010266;
	}
	uint32 s7_135 = (s5_1114 >> 0x0F) + ~0x07;
	a4 = (s7_135 & 0x00FF) + 432;
	s7 = s7_135 & 0x00FF;
	a5_1030 = (word32) a4 + 1107421792;
	s3_1136 = (word32) *((word32) a4 + 1107421821);
	if (s3_1136 == 0x00)
		goto l2301002C;
	struct Eq_44308 * a5_144 = (word32) *((word32) a4 + 1107421818);
	g_t42021548 = s5_1114;
	g_b4202153A = (byte) a5_144;
	g_b42021539 = (byte) (s7_135 & 0x00FF);
	Eq_2 a3_145 = 0x05D8;
	s5_1114.u0 = 1107427192;
	if ((word32) a5_144->b420205A6 == 0x02 && ((word32) g_t42021554 & 0x01) == 0x00)
	{
		word32 a4_2655;
		g_b4202153B = (byte) hal_machw_search_addr(&g_t42021554, out a3_145, out a4_2655);
	}
	if ((s8_38 & 0x0300) == 0x0300)
		*((word32) s6_1129 + 76) |= 4;
	ui32 a5_184 = (word32) g_w42021530;
	a4 = a5_184 << 0x11;
	if (a5_184 << 0x11 < 0x00)
	{
		s0_1057 = *((word32) a1 + 24);
		if (rxu_cntrl_protected_handle(s1, a1, out a1, out a2, out a3_145, out a4, out a5_1030) == 0x00)
			goto l2301002C;
	}
	s6_1129 = s8_38 & 0x0C;
	if ((s8_38 & 0x0C) == 0x00)
	{
		a4 = (word32) *((word32) s0_1057 + 2);
		if (s8_38 << 0x14 < 0x00)
		{
			a5_1030 = (word32) (s7_135 & 0x00FF)->w4201ED98;
			if (a5_1030 == a4)
				goto l2301002C;
		}
		s7 = (s7_135 & 0x00FF) + 432;
		ui32 a5_227 = (word32) *((word32) s0_1057 + 48);
		*((word32) s7 + 1107422184) = (word16) a4;
		a1.u0 = 432;
		if ((a5_227 & 0x02) != 0x00)
		{
			s0_1057 = *((word32) a3_145 + 16);
			a5_1030 = *((word32) a2 + 0x0044);
			if (a2 >= a4)
			{
				if (a2 != a4)
					goto l2301002C;
				a5_1030 = *((word32) a2 + 64);
				if (a2 >= a3_145)
					goto l2301002C;
			}
			*((word32) a3_145 + 64) = a5_1030;
			*((word32) a4 + 0x0044) = a5_1030;
		}
		a1_1041 = (word32) *((word32) s0_1057 + 9);
		goto l230102CA;
	}
	a5_1030.u0 = 0x08;
	if ((s8_38 & 0x0C) != 0x08)
		goto l2301002C;
	if ((s8_38 & 64) != 0x00)
	{
		a4 = mm_cfg_element_keepalive_timestamp_update(a4, out a5_1030);
		goto l2301002C;
	}
	ui32 a5_265;
	if ((s8_38 & 0x0080) != 0x00)
		a5_265 = (word32) *((word32) s0_1057 + 7) + 0x00C5 + ((s7_135 & 0x00FF) + 0x00D8) << 1;
	else
		a5_265 = (s7_135 & 0x00FF) + 0x0338;
	a5_1030 = a5_265 + 1107421792;
	Eq_2 a3_279 = (word32) *((word32) s0_1057 + 2);
	if (s8_38 << 0x14 < 0x00)
	{
		a4 = (word32) *a5_1030.u0;
		if (a4 == a3_279)
			goto l2301002C;
	}
	*a5_1030.u0 = (word16) a3_279;
	a4 = (word32) *((word32) s0_1057 + 0x0A);
	if (((word32) *((word32) s0_1057 + 48) & 0x02) != 0x00)
	{
		struct Eq_44463 * a5_288 = (word32) *((word32) s0_1057 + 7);
		s0_1057 = a5_288->t0020;
		a5_1030 = ((Eq_582551[]) 4)[a5_288].t0000;
		if (a5_288 << 0x03 >= a3_279)
		{
			if (a5_288 << 0x03 != a3_279)
				goto l2301002C;
			a5_1030 = null[a5_288].t0000;
			if (a5_288 << 0x03 >= a1)
				goto l2301002C;
		}
		*a1 = a5_1030;
		*((word32) a3_279 + 4) = a5_1030;
	}
	if ((word32) *((word32) a4 + 0x42020938) != 0x00 || g_t4202152C != 0x00)
	{
		Eq_2 s8_348 = (word32) s1 + (word32) (*((word32) s0_1057 + 8));
		struct Eq_44556 * a3_352;
		word32 a2_2656;
		word32 a5_2658;
		word32 a4_2657;
		if (memcmp(s8_348, 588036228, 0x06, out a1, out a2_2656, out a3_352, out a4_2657, out a5_2658) == 0x00 && (word32) (*((word32) s8_348 + 6)) == 0x08FFFE88)
		{
			a1 = (s7_135 & 0x00FF) + 432;
			a4 = (word32) *((byte) a1.u0 + 1107421818);
			s5_1114 = (word32) a4 + 0x42020550;
			if ((word32) *((word32) a4 + 1107428774) == 0x00)
			{
				a5_1030 = a3_352->t0008;
				if ((word32) a3_352->b0005 == 0x00)
					goto l2301002C;
				*((word32) a5_1030 + 1) = (byte) (s7_135 & 0x00FF);
				*((word32) a5_1030 + 2) = (byte) a4;
			}
			else
			{
				*((word32) g_t4202152C + 1) = (byte) (s7_135 & 0x00FF);
				*((word32) g_t4202152C + 2) = (byte) (word32) *((byte) a1.u0 + 1107421818);
				a5_1030 = g_t4202152C;
			}
			word32 a4_851 = (word32) *((word32) s0_1057 + 8);
			dwLoc4C = a5_1030;
			a5_1030 = ProcessEAPoLPkt(ra, (byte) a1.u0 + 1107421792, (word32) a4 + 0x42020550, s8_38 & 0x0C, fflags, frm, mstatus, (word32) s1 + (a4_851 + 0x08), SEQ(wLoc42, (word16) (~0x07 - a4_851 + (word32) (*((word32) (*((word32) a0 + 4)) + 28)))), s4, dwLoc28, dwLoc08, dwArg18, dwArg28, dwArg38, s7, s5, dwArg58, dwArg68, dwArg78, dwArg84, dwArg88, dwArg98, dwArgA4, dwArgA8, dwArgB8, dwArgD8, dwArgF8, dwArg0104, out a1, out a4, out s5_1114, out s6_1129, out s7, out s10)->t0120;
			goto l2301002C;
		}
	}
	a5_1030 = 0x0D - g_dw4201EA2C;
	a4.u0 = 0x05;
	if (a5_1030 <= 0x05)
		goto l2301002C;
	ui32 a5_366 = (word32) *s0_1057;
	a5_1030 = a5_366 & 0x0400;
	if ((a5_366 & 0x0400) != 0x00)
		goto l2301002C;
	a5_1030 = (word32) *((word32) s0_1057 + 6);
	if (a5_1030 != 0x00)
		goto l2301002C;
	if (((word32) *((word32) s0_1057 + 48) & 0x01) != 0x00)
	{
		struct Eq_44819 * s2_403;
		word32 s8_2662;
		word32 s1_2659;
		word32 s4_2661;
		word32 s3_2660;
		struct Eq_35932 * s0_401 = me_mic_init(fp + -72, &g_t42021554, &g_w4202155A, (word32) *((word32) *((byte) a1.u0 + 32) + 7), out s1_2659, out s2_403, out s3_2660, out s4_2661, out s8_2662);
		struct Eq_44844 * a5_408 = s2_403->ptr0004;
		struct Eq_44848 * s1_409 = (word32) s0_401->b0008;
		s7 = a5_408->t0008;
		struct Eq_42953 * s9_414 = (struct Eq_42953 *) 848;
		s5_1114 = (word32) (word16) (~0x07 - s1_409 + (word32) a5_408->w001C);
		s10.u0 = 848;
		do
		{
			Eq_2 s8_425 = s5_1114;
			word32 a1_426 = Mem315[s7 + 8:int32] + s1_409;
			if (s9_414 < s5_1114 + s1_409)
				s8_425 = (word32) (word16) (s10 - s1_409);
			word32 s1_451;
			word32 s8_459;
			word32 a1_2663;
			word32 s4_2665;
			word32 a2_2664;
			Eq_2 a3_1271;
			me_mic_calc(fp + -72, a1_426, s8_425, s4, dwArgD8, out s1_451, out a1_2663, out a2_2664, out a3_1271, out s2_35, out s3_1136, out s4_2665, out s5_1114, out s6_1129, out s7, out s8_459, out s9_414, out s10);
			if (s5_1114 == 0x00)
			{
				a3_1271 = fp + -80;
				s1 = (word32) (word16) (s1_451 + s8_459);
				do
				{
					Eq_2 a1_1272 = s6_1129;
					word32 a4_476 = Mem470[s7 + 8:int32] + s1;
					if (s6_1129 + s1 > 848)
					{
						s1 = 848 - s1;
						a1_1272 = (word32) (word16) s1;
					}
					Eq_2 a5_482 = 0x00;
					while (true)
					{
						word32 a2_485 = a5_482 + a3_1271;
						if (a5_482 == a1_1272)
							break;
						*a2_485 = (byte) (word32) *((word32) a5_482 + a4_476);
						a5_482 = (word32) a5_482 + 1;
					}
					s6_1129 = (word32) (word16) (s6_1129 - a5_482);
					a3_1271 = a2_485;
					if (s6_1129 == 0x00)
					{
						Eq_2 a4_509;
						Eq_2 a5_510;
						word32 a2_2677;
						word32 a3_2678;
						me_mic_end(s1, fp + -72, out a2_2677, out a3_2678, out a4_509, out a5_510);
						0x00 = (int8) dwArg74;
						s0_1057 = dwArg94;
						if (a4_509 == a5_510 && a4_509 == a5_510)
							goto l2301070A;
						Eq_2 a0_728;
						struct Eq_45304 * s0_736;
						word32 s4_740;
						word32 a4_2695;
						word32 s1_2691;
						word32 a1_2692;
						word32 a2_2693;
						word32 a3_2694;
						word32 a5_2696;
						word32 a6_2697;
						word32 s3_2699;
						word32 s2_2698;
						word32 s8_2700;
						ke_msg_alloc(ra, 0x01000406, 0x0D, 0x18, a4_509, mstatus, s6, out s0_736, out s1_2691, out a0_728, out a1_2692, out a2_2693, out a3_2694, out a4_2695, out a5_2696, out a6_2697, out s2_2698, out s3_2699, out s4_740, out s8_2700);
						struct Eq_45334 * a4_752;
						struct Eq_45335 * a2_756;
						struct Eq_45336 * a3_757;
						word32 a5_2702;
						word32 a6_2703;
						word32 a7_2704;
						word32 a1_2701;
						memcpy(a0_728, (word32) s0_736->b0009 + 432 + s4_740 + 0x1E, 0x06, out a1_2701, out a2_756, out a3_757, out a4_752, out a5_2702, out a6_2703, out a7_2704);
						a2_756->t0008 = a0_728;
						a3_757->t000C = a0_728;
						struct Eq_45366 * s0_769 = a4_752->ptr0018;
						*((word32) a0_728 + 16) = (byte) (a4_752 >> 0x0A & 0x01);
						struct Eq_45378 * a4_773 = (word32) s0_769->b000A;
						*((word32) a0_728 + 18) = (byte) a4_773;
						*((word32) a0_728 + 0x0011) = (byte) (word32) a4_773->b0061;
						word32 s1_2705;
						word32 a0_2706;
						word32 a2_2707;
						word32 a3_2708;
						word32 s2_2709;
						word32 s8_2712;
						word32 s4_2711;
						word32 s3_2710;
						ke_msg_send(a0_728, mstatus, out s1_2705, out a0_2706, out a1, out a2_2707, out a3_2708, out a4, out a5_1030, out s2_2709, out s3_2710, out s4_2711, out s8_2712);
						goto l2301002C;
					}
					s7 = *((word32) s7 + 4);
					s1.u0 = 0x00;
				} while (s7 != 0x00);
				break;
			}
			s7 = *((word32) s7 + 4);
			s1_409 = null;
		} while (s7 != 0x00);
		word32 a2_2679;
		word32 a3_2680;
		assert_rec(a3_1271, mstatus, out a2_2679, out a3_2680, out a4, out a5_1030);
		a1.u0 = 0x230AA20C;
		goto l2301002C;
	}
l2301070A:
	ui32 a4_528 = (word32) *((word32) s0_1057 + 11);
	int32 s4_529 = (word32) *((word32) s0_1057 + 8);
	((word32) *((word32) s0_1057 + 9) << 16 | (word32) (*((word32) s0_1057 + 0x0A)) << 8 | a4_528 << 24 | a4_528 << 24)->dw004C = ((Eq_582553[]) 76)[a4_528].dw0000;
	word32 a3_537 = ((Eq_582554[]) 76)[a4_528].dw0000;
	struct Eq_44796 * a2_541 = a4_528 << 24 & -113;
	a2_541->dw004C = a3_537;
	ui32 a5_546 = (word32) *((word32) s1 + 1) << 8 | (word32) (*s1);
	if ((a5_546 & 252) == 0x0088)
	{
		ui32 a4_551;
		ui32 a5_552;
		if ((a5_546 & 0x0300) == 0x0300)
		{
			a4_551 = (word32) *((word32) s1 + 30);
			a5_552 = (word32) *((word32) s1 + 31);
		}
		else
		{
			a4_551 = (word32) *((word32) s1 + 24);
			a5_552 = (word32) *((word32) s1 + 25);
		}
		ui32 a5_558 = a5_552 << 8 | a4_551;
		struct Eq_44960 * a4_563 = (a5_558 & 7) << 4 | a2_541;
		if ((a5_558 & 0x0080) != 0x00)
		{
			(a4_563 | 1)->dw004C = a3_537;
			goto l230107FC;
		}
		a4_563->dw004C = a3_537;
	}
	struct Eq_44915 * a4_610;
	s5_1114 = (word32) (word16) s4_529;
	Eq_2 s1_575 = (word32) s1 + (s5_1114 & 0x00FE);
	word32 a4_2669;
	word32 a2_2667;
	word32 a3_2668;
	word32 a1_2666;
	word32 a5_2670;
	if (memcmp(s1_575, 588036228, 0x06, out a1_2666, out a2_2667, out a3_2668, out a4_2669, out a5_2670) != 0x00 || (word32) (*((word32) s1_575 + 6)) == 0x08000137)
	{
		word32 a2_2672;
		word32 a3_2673;
		word32 a5_2675;
		word32 a4_2674;
		word32 a1_2671;
		if (memcmp(s1_575, 588036220, 0x06, out a1_2671, out a2_2672, out a3_2673, out a4_2674, out a5_2675) != 0x00)
		{
			uint32 a5_614 = (word32) (word16) ((word32) *((word32) *((word32) s2_35 + 4) + 28) - s5_1114);
			*((word32) s1_575 + 0x0FFE) = (byte) a5_614;
			*((word32) s1_575 + 0x0FFF) = (byte) (a5_614 >> 8);
			*((word32) s0_1057 + 49) = 0x01;
			s4_529 = s4_529 + ~0x0D & 0x00FF;
			a4_610 = (word32) s1_575 - 0x0E;
l230107BA:
			a4_610->w0000 = (word16) (word32) *((word32) s0_1057 + 36);
			a4_610->w0002 = (word16) (word32) *((word32) s0_1057 + 38);
			a4_610->w0004 = (word16) (word32) *((word32) s0_1057 + 40);
			a4_610->w0006 = (word16) (word32) *((word32) s0_1057 + 42);
			a4_610->w0008 = (word16) (word32) *((word32) s0_1057 + 44);
			a4_610->w000A = (word16) (word32) *((word32) s0_1057 + 46);
l230107FC:
			Eq_2 a4_649 = *((word32) s2_35 + 4);
			*((word32) a4_649 + 28) = (word16) ((word32) *((word32) a4_649 + 28) - s4_529);
			Eq_2 a5_656 = *((word32) s2_35 + 4);
			*((word32) s0_1057 + 50) = (byte) s4_529;
			*((word32) a5_656 + 84) = s4_529;
			g_dw420215A8 = s4_529;
			Eq_2 s2_700;
			word32 a5_2676;
			a4 = rxl_mpdu_transfer(s2_35, mstatus, dwLoc18, out a5_2676, out s2_700);
			__csrrc(mstatus, 0x08);
			Eq_2 a5_703 = *((word32) s2_700 + 4);
			*((word32) s2_700 + 28) = 0x03;
			*((word32) s2_700 + 20) = a4;
			a5_1030 = (word32) *((word32) a5_703 + 28);
			*((word32) s2_700 + 24) = a5_1030;
			__csrrc(mstatus, 0x08);
			co_list_push_back(s2_700, a5_1030);
			__csrrs(mstatus, 0x08);
			__csrrs(mstatus, 0x08);
			a1 = s2_700;
			goto l23010266;
		}
	}
	*((word32) s0_1057 + 49) = 0x00;
	a4_610 = (word32) s1_575 - 6;
	s4_529 = s4_529 + ~0x05 & 0x00FF;
	goto l230107BA;
}

